Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: <guilabel>Refine Curve Fit</guilabel>: This option is only available with the Linear 1 Pass focus algorithm and Curve Fits of Hyperbola and Parabola. If this option is checked then at the end of the sweep of datapoints, Ekos fits a curve and measures the R². It then applies Peirce's Criterion based on Gould's methodology for outlier identification. See <ulink url="https://en.wikipedia.org/wiki/Peirce%27s_criterion">Peirce's Criterion</ulink> for details incl Peirce's original paper and Gould's paper which are both referenced in the notes. If Peirce's Criterion detects 1 or more outliers then another curve fit is attempted with the outliers removed. Again the R² is calculated and compared with the original curve fit R². If the R² is better, then the latest run is used, if not, the original curve fit (with the outliers included) is used.
fr: <guilabel>Affiner la courbe de régression</guilabel> : cette option n'est disponible qu'avec l'algorithme de mise au point linéaire à 1 passe et le type de courbe hyperbole et parabole. Si cette option est cochée et à la fin du balayage de l'ensemble de points, Ekos calcule la courbe de régression et mesure le R². Le critère de Peirce fondé sur la méthode de Gould est ensuite appliqué pour identifier les points aberrants. Veuillez consulter la page sur le <ulink url="https://en.wikipedia.org/wiki/Peirce%27s_criterion">critère de Peirce</ulink> pour les détails (inclus les articles originaux de Peirce et de Gould qui sont référencés dans les notes). Si le critère de Peirce détecte au moins une valeur aberrante, alors une nouvelle courbe est calculée sans ces valeurs aberrantes. Le R² est calculé à nouveau et comparé à l'ancien. S'il est meilleur, la dernière passe est utilisée et sinon, c'est la première (avec les valeurs aberrantes) qui est utilisée.

source: Outliers are clearly marked on the V-Curve with an X through the datapoint.
fr: Les valeurs aberrantes sont clairement indiquées sur la courbe en V grâce à un X sur les points.

source: <guilabel>Average over</guilabel>: Number of frames to capture at each datapoint. It is usually sensible to start with 1 but increasing this will result in an averaging process for the star Measure selected.
fr: <guilabel>Moyenner sur</guilabel> : nombre d'images à acquérir pour chaque point de données. Il est généralement raisonnable de commencer à 1 mais l'augmentation de ce nombre résultera dans un processus de calcul de la moyenne pour la mesure des étoiles sélectionnées.

source: <guilabel>Donut Buster</guilabel>: This is an experimental feature and should be used with caution. The intention of Donut Buster is to improve focusing for telescopes with central obstructions that create donut shaped stars when defocused. In future it is likely that more functionality will be developed for Donut Buster. In this release the functionality is aimed at data collection in order to research methods of improving focus.
fr: <guilabel>Donut Buster</guilabel> : c'est encore une fonctionnalité expérimentale qui devrait être utilisé avec précaution. L'idée ici est d'améliorer la mise au point pour des télescopes ayant une obstruction centrale qui crée des étoiles en forme de beignet lorsque loin de la position de mise au point. Il est probable que dans le futur il y aura davantage de fonctionnalités développées. Dans cette version, cette fonctionnalité est davantage ciblée vers la récolte de données afin d'améliorer la mise au point.

source: <guilabel>Time Dilation Factor</guilabel>: This is an experimental feature of Donut Buster and should be used with caution. This feature scales the exposure time during Autofocus from the Exposure value entered in the Exposure field for the furthest datapoints from focus. Datapoints near focus are taken with an unscaled exposure. For example, if Focus is setup with an Exposure of 2s and Time Dilation Factor is set to 4, then when Autofocus moves out to take its first datapoint, an exposure of 2s * 4 = 8s is used. On each successive datapoint the exposure is reduced down to 2s around the point of optimum focus. As the focuser moves through focus, so the exposure is scaled upwards to 8s for the last datapoint.
fr: <guilabel>Facteur de dilatation du temps</guilabel> : cette fonctionnalité de Donut Buster est encore expérimentale et devrait être utilisée avec précaution. Elle règle la durée d'exposition à partir de la valeur de la mise au point automatique saisie dans le champ d'exposition pour les points les plus éloignés de la mise au point. Les points proches de la mise au point ne sont pas impactés. Par exemple, si la mise au point est réglée à 2s et que le facteur de dilatation du temps est réglé à 4, la mise au point automatique se déplace vers l'extérieur pour son premier point et la durée d'exposition sera de 2s * 4 = 8s. Pour les points suivants, la durée d'exposition est réduite à 2s autour de la position de mise au point optimale. À mesure que le moteur de mise au point passe la position optimale, la durée sera augmentée à 8s pour le dernier point.

source: The purpose of this feature is to increase the brightness of out of focus datapoints which will be dimmer than in-focus datapoints and therefore harder for star detection to resolve from the background noise.
fr: Le but de cette méthode est d'augmenter la luminosité des points loin de la position optimale qui sont par nature moins brillants que les points proches et donc plus difficile à résoudre par rapport au bruit ambiant.

source: This feature assumes Autofocus is run from near to optimum focus.
fr: Cette fonctionnalité impliquer que le processus de mise au point automatique est lancé près de la position optimale de mise au point.

source: If <guilabel>Detection</guilabel> is set to Threshold then the following additional field is available:
fr: Si <guilabel>Détection</guilabel> est positionné à Seuil, alors les champs additionnels sont disponibles :

source: <guilabel>Threshold</guilabel>: This contains a percentage value used for star detection using the <emphasis>Threshold</emphasis> detection algorithm. Increase to restrict the centroid to bright cores. Decrease to enclose fuzzy stars.
fr: <guilabel>Seuil</guilabel> : la valeur en pourcentage du seuil est utilisée pour détecter les étoiles pour l'algorithme de détection <emphasis>Seuil</emphasis>. Augmentez cette valeur pour restreindre le centroïde aux cœurs brillants. Diminuez-la pour inclure les étoiles floues.

source: If <guilabel>Detection</guilabel> is set to Bahtinov then the following additional widgets are available:
fr: Si <guilabel>Détection</guilabel> est positionné à Bahtinov, alors les composants graphiques additionnels sont disponibles :

source: <guilabel>Num. of rows</guilabel>: The number of lines displayed on screen when using a Bahtinov mask.
fr: <guilabel>Nombre de lignes</guilabel> : le nombre de lignes affichées à l'écran lors de l'utilisation d'un masque de Bathinov.

source: <guilabel>Sigma</guilabel>: The sigma of the gaussian blur applied to the image before applying Bahtinov edge detection.
fr: <guilabel>Sigma</guilabel> : le sigma du flou gaussien appliqué à l'image avant d'appliquer l'algorithme de détection des bords de Bathinov.

source: <guilabel>Kernel Size</guilabel>: The kernel size of the gaussian blur applied to the image before applying Bahtinov edge detection.
fr: <guilabel>Taille du noyau</guilabel> : la taille du noyau du flou gaussien appliquée à l'image avant d'appliquer l'algorithme de détection des bords de Bathinov.

source: If <guilabel>Algorithm</guilabel> is set to Linear or Iterative then the following additional widget is available:
fr: Si <guilabel>Algorithme</guilabel> est positionné à Linéaire ou Itératif, alors les composants graphiques additionnels sont disponibles :

source: <guilabel>Tolerance</guilabel>: The tolerance percentage value is used to help decide when the Autofocus process stops. During the Autofocus process, HFR values are recorded, and once the focuser is close to an optimal position, it starts measuring HFRs against the minimum recorded HFR in the session and stops whenever a measured HFR value is within % difference of the minimum recorded HFR. Decrease the value to narrow the optimal focus point solution radius. Increase to expand solution radius.
fr: <guilabel>Tolérance</guilabel> : le pourcentage de tolérance est le critère d'arrêt de la procédure de mise au point automatique. Durant cette procédure, les valeurs HFR sont enregistrées et une fois que le moteur de mise au point est proche de la position optimale, il compare les HFR aux valeurs de HFR minimales et s'arrête dès qu'une valeur HFR est dans cette plage de tolérance. Diminuez cette valeur pour restreindre le rayon de la solution et inversement.

source: Setting the Tolerance value too low might result in a repetitive loop and would most likely result in a failed Autofocus process.
fr: Veuillez noter que si cette valeur est trop faible, il est possible que l'algorithme entre dans une boucle qui fera échouer la procédure de mise au point automatique.

source: <title>Focus Mechanics</title>
fr: <title>Mécanique de la mise au point</title>

source: <screeninfo>Focus Mechanics</screeninfo>
fr: <screeninfo>Mécanique de la mise au point</screeninfo>

source: <phrase>Focus Mechanics</phrase>
fr: <phrase>Mécanique de la mise au point</phrase>

source: Focus Mechanics Parameters:
fr: Paramètres de la mécanique de la mise au point :

source: <guilabel>Walk</guilabel>: This specifies the way Autofocus will "walk" inwards through its sweep to produce the V-Curve from which the focus solution will be calculated.
fr: <guilabel>Course</guilabel> : cette option spécifie la manière dont le moteur de mise point avance pour produire la courbe en V de laquelle la solution de mise au point sera calculée.

source: The following are available:
fr: Les options suivantes sont disponibles :

source: <emphasis role="bold">Classic</emphasis>: This is the recommended setting. The inward sweep follows a series of steps of equal size (<guilabel>Initial Step Size</guilabel>). The algorithm includes logic to determine when to stop that makes the exact number of steps unpredictable but it will be about 2 * (<guilabel>Out Step Multiple</guilabel>) + 1.
fr: <emphasis role="bold">Classique</emphasis> : c'est le réglage recommandé. La course vers l'intérieur suit une série de pas de taille égale (<guilabel>Taille initiale de pas</guilabel>). L'algorithme inclut de la logique pour déterminer le moment d'arrêt mais rend la détermination du nombre exact de pas imprévisible mais devrait être de l'ordre 2 * (<guilabel>Multiple de pas extérieur</guilabel>) + 1.

source: This Walk is tolerant of curve fitting failures in the last step where it will take a further step and try again to solve. It is also somewhat tolerant of not being started near to focus so is a good choice for the initial Autofocus run.
fr: Cette méthode est tolérante aux échecs d'ajustement de la courbe au dernier pas où elle avancera d'un pas supplémentaire et essaiera à nouveau de trouver une solution. Elle est également tolérante à une position de départ éloignée de la position de mise au point point et est par conséquent un bon choix pour la première exécution de la procédure de mise au point automatique.

source: Because of the "tolerance" of this Walk to less than perfect setup it is a conservative option to chose, but comes at the expense of extra steps and therefore extra time in the Autofocus process.
fr: Parce que cette course est tolérante à des montages très peu parfaits, c'est un choix conservateur, mais au prix de davantage de pas et donc de temps du processus de mise au point automatique.

source: <emphasis role="bold">Fixed Steps</emphasis>: This feature is available in the Linear 1 Pass <guilabel>Algorithm</guilabel>. It is quite similar to Classic but <guilabel>Fixed Steps</guilabel> is used to control the total number of steps taken.
fr: <emphasis role="bold">Pas fixes</emphasis> : cette option est disponible pour l'<guilabel>algorithme</guilabel> linéaire à 1 passe. Elle est similaire à Classique mais <guilabel>Pas fixes</guilabel> est utilisée pour contrôler le nombre total de pas utilisé.

source: This algorithm is more predicable than Classic in that it takes a definite number of steps (so will be faster), but is less tolerant of issues curve fitting the last data point and needs to be started near to focus.
fr: Cet algorithme est plus prévisible que Classique puisqu'il utilise un nombre de pas défini (et sera ainsi plus rapide), mais est moins tolérant aux problèmes d'ajustement de courbe près des derniers points et doit donc être démarré près de la position de mise au point.

source: When selected, the <guilabel>Out Steps Multiple</guilabel> is replaced by <guilabel>Fixed Steps:</guilabel>
fr: Lorsque sélectionnée, l'option <guilabel>Multiple de pas extérieur</guilabel> est remplacée par <guilabel>Pas fixes</guilabel>.

source: <emphasis role="bold">CFZ Shuffle</emphasis>: This feature is available in the Linear 1 Pass <guilabel>Algorithm</guilabel>. It is a variation on Fixed Steps so the comments on that Walk are applicable here as well.
fr: <emphasis role="bold">Mélange CFZ</emphasis> : cette option est disponible pour l'<guilabel>algorithme</guilabel> linéaire à 1 passe. C'est une variante de Pas fixes et donc les commentaires sur cette course sont applicables ici aussi.

source: The difference between CFZ Shuffle and Fixed Steps is that near the center of the sweep (which should be around the Critical Focus Zone (CFZ)) the algorithm takes steps of half the specified size.
fr: La différence entre Mélange CFZ et Pas fixes réside dans le fait que près du centre de la solution (qui devrait être près de la zone critique de mise au point CFZ), l'algorithme utilisera des pas de la moitié de la taille initiale.

source: <guilabel>Focuser Settle</guilabel>: The number of seconds to wait, after moving the focuser, before starting the next capture. The purpose is to stop any vibrations in the optical train from affecting the next frame.
fr: <guilabel>Stabilisation du moteur de mise au point</guilabel> : règle le nombre de secondes à attendre après déplacement du moteur de mise au point et avant de débuter une nouvelle acquisition. La raison est d'éviter toute vibration du train optique qui pourrait affecter la prochaine image.

source: <guilabel>Initial Step size</guilabel>: This sets the step size to be used by various focus algorithms. For absolute and relative focusers this is the number of ticks; for timer based focusers this is the number of milliseconds.
fr: <guilabel>Taille initiale du pas</guilabel> : règle la taille de pas utilisée par différents algorithmes de mise au point. Pour les moteurs de mises au point, cela correspond aux nombres de pas ; pour ceux fondés sur le temps, cela correspond aux nombres de millisecondes.

source: <guilabel>Out Step Multiple</guilabel>: Used by the Linear and Linear 1 Pass focus algorithms in the Classic walk, this parameter specifies the initial number of outward steps the focuser takes at the start of an Autofocus run.
fr: <guilabel>Multiple du pas extérieur</guilabel> : utilisé par les algorithmes de mise au point linéaire à 1 passe et linéaire dans la course classique. Ce paramètre spécifie le nombre initial de pas vers l'extérieur au début de la procédure de mise au point automatique.

source: <guilabel>Number Steps</guilabel>: Used by the Linear 1 Pass algorithm in the Fixed Steps and CFZ Shuffle walks, this parameter specifies the total number of steps the focuser takes to create the V-Curve in an Autofocus run.
fr: <guilabel>Nombre de pas</guilabel> : utilisé par l'algorithme linéaire à 1 passe pour les courses à pas fixes et le mélange CFZ. Ce paramètre spécifie le nombre total de pas du moteur de mise au point pour créer la courbe en V lors de la procédure de mise au point automatique.

source: <guilabel>Max Travel</guilabel>: Puts bounds on the amount of travel from the current focuser position that is permitted by the Autofocus algorithms. The purpose is to protect the focuser from travelling too far and potentially damaging itself. On the other hand, the value needs to be big enough to allow sufficient focuser motion to permit the auto focus runs to complete.
fr: <guilabel>Déplacement Max</guilabel> : place des bornes sur le déplacement depuis la position courante qui est autorisé pour l'algorithme de mise au point automatique. La raison est d'éviter que le moteur de se déplace trop et ainsi le protège de s'endommager. Toutefois, il faut que la valeur soit assez grande pour permettre au moteur de se déplacer suffisamment pour terminer la procédure de mise au point automatique.

source: <guilabel>Max Step Size</guilabel>: Used by the Iterative algorithm to limit the maximum step size that can be used.
fr: <guilabel>Taille maximale du pas</guilabel> : utilisé par l'algorithme itératif pour limiter la taille maximale de pas qui peut être utilisé.

source: <guilabel>Driver Backlash</guilabel>: See the section on <link linkend="focus-backlash">Backlash</link>.
fr: <guilabel>Jeu du pilote</guilabel> : voir la section sur le <link linkend="focus-backlash">Jeu</link>.

source: There are 2 schemes that can be used:
fr: Il existe deux schémas d'utilisation :

source: Set <guilabel>Driver Backlash</guilabel> to 0 to switch it off and deal with Backlash elsewhere.
fr: Mettez 0 à <guilabel>Jeu du pilote</guilabel> pour désactiver et gérer ce jeu ailleurs.

source: Set <guilabel>Driver Backlash</guilabel> &gt; 0 to use Driver Backlash to manage Backlash in the device driver. Note that this field is only editable if the device driver supports Backlash.
fr: Mettez une valeur positive à <guilabel>Jeu du pilote</guilabel> pour que ce soit le pilote du périphérique qui gère le jeu. Veuillez noter que ce champ n'est modifiable que pour les pilotes gérant le jeu.

source: This is the same data field that is displayed in the Indi Control Panel for the focuser device. It can be set in either place.
fr: Ce champ est le même que celui affiché dans le tableau de bord Indi du moteur de mise au point. Il peut être réglé aux deux endroits.

source: <guilabel>AF Overscan</guilabel>: See the section on <link linkend="focus-backlash">Backlash</link>.
fr: <guilabel>Balayage de la mise au point automatique</guilabel> : voir la section concernant le <link linkend="focus-backlash">Jeu</link>.

source: Set <guilabel>AF Overscan</guilabel> to 0 to switch it off and deal with Backlash elsewhere.
fr: Mettez 0 à <guilabel>Balayage de la mise au point automatique</guilabel> pour désactiver et gérer le jeu ailleurs.

source: Set <guilabel>AF Overscan</guilabel> &gt; 0 to have the Focus module manage Backlash.
fr: Mettez une valeur positive à <guilabel>Balayage de la mise au point automatique</guilabel> pour que le module de mise au point gère le jeu.

source: <guilabel>Capture Timeout</guilabel>: The amount of time in seconds to wait for a captured image to be received before declaring a timeout. This should only be triggered if there are problems with the camera during the Focus process so set this to a high enough value that it will not occur during normal operation.
fr: <guilabel>Délai d'acquisition</guilabel> : spécifie le nombre de secondes à attendre pour qu'une image acquise soit reçue avant de déclarer une expiration du délai. Cela ne devrait être déclenché que s'il y a des problèmes avec l'appareil photo durant le processus de mise au point, ainsi réglez à une valeur suffisamment haute pour éviter que cela n'intervienne durant les opérations normales.

source: <guilabel>Motion Timeout</guilabel>: The amount of time in seconds to wait for the focuser to move to the requested position before declaring a timeout. This should only be triggered if there are problems with the focuser during the Focus process so set this to a high enough value that it will not occur during normal operation.
fr: <guilabel>Expiration du mouvement</guilabel> : spécifie le nombre de secondes à attendre que le mouvement du moteur de mise au point soit à la position requise avant de déclarer une expiration du délai. Cela ne devrait être déclenché que s'il y a des problèmes avec le moteur de mise au point, ainsi réglez à une valeur suffisamment haute pour éviter que cela n'intervienne durant les opérations normales.

source: Focus Critical Focus Zone (CFZ)
fr: Mise au point de la zone critique de mise au point (CFZ)

source: <screeninfo>Focus CFZ</screeninfo>
fr: <screeninfo>Mise au point de la CFZ</screeninfo>

source: <phrase>Focus CFZ</phrase>
fr: <phrase>Mise au point de la CFZ</phrase>

source: Focus CFZ Parameters:
fr: Paramètres de la mise au point de la CFZ :

source: <guilabel>Algorithm</guilabel>: This specifies the Critical Focus Zone (CFZ) algorithm. The purpose of this is to calculate the CFZ for the equipment attached in the Optical Train. It is not necessary to use this functionality in order to successfully focus, but it provides useful information if correctly configured.
fr: <guilabel>Algorithme</guilabel> : ce champ spécifie l'algorithme de la CFZ. La raison de ceci est de calculer la CFZ de l'équipement attaché au train optique. Il n'est pas nécessaire d'utiliser ceci pour obtenir une mise au point réussie, mais cela fournit de l'information utile pour une configuration correcte.

source: It requires some knowledge to configure it correctly. There is plenty of information available on the internet.
fr: Cet algorithme nécessite un peu de connaissance pour le configurer correctement. Il existe quantité d'information sur Internet.

source: The idea of the CFZ dialog is that it starts with data from the Optical Train used in the Focus tab and uses that to calculate the CFZ. The user can adjust parameters to do "what-if" scenarios to see how it affects the CFZ. Clicking the <guilabel>Reset to OT</guilabel> button resets any adjusted parameters to the Optical Train values.
fr: L'idée de l'onglet CFZ est de débuter avec les données du train optique de l'onglet de mise au point et utilise cela pour calculer la CFZ. L'opérateur peut ajuster les paramètres pour simuler des modèles de scénarios pour voir comment cela affecte la CFZ. Le bouton <guilabel>Réinitialiser à OT</guilabel> permet de réinitialiser les valeurs à celle du train optique.

source: If the <guilabel>Display</guilabel> box is checked then the CFZ is drawn on the V-Curve after Autofocus successfully completes.
fr: Si la case <guilabel>Affichage</guilabel> est cochée alors la CFZ est dessinée sur la courbe en V après que la procédure de mise au point ce soit terminée avec succès.

source: It is necessary to specify the <guilabel>Step Size</guilabel> parameter which specifies in microns how far one tick moves the focal plane. For refractors there is usually a 1-to-1 relationship between moving the focuser which moves the telescope draw-tube mechanism and the focal plane movement. For other types of telescope the relationship is likely to be more complex. Refer to details of your telescope / manufacturer for this information.
fr: Il est nécessaire d'indiquer la <guilabel>Taille de pas</guilabel> (en microns) qui précise la distance d'un pas par rapport au plan focal. La relation est normalement linéaire pour les réfracteurs entre les déplacement du tube et l'éloignement du plan focal. Veuillez vous référer aux données de votre télescope pour obtenir cette information.

source: The following algorithms are available:
fr: Les algorithmes suivants sont disponibles :
