Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-capture.po
Languages: fr

source: When using data from camera manufacturer documentation, avoid selecting a gain near a step
fr: Évitez d'utiliser une valeur de gain près d'une marche quand vous vous basez sur la documentation du constructeur.

source: Avoid selecting gain near a step
fr: Évitez de choisir une valeur de gain près d'une marche

source: Instead, shift the gain selection away from the step
fr: Choisissez plutôt une valeur éloignée d'une marche

source: Shift gain away from such steps
fr: Éloignez-vous de telles marches

source: <guilabel>Noise Increase %</guilabel>: The <guimenu>'Noise Increase %'</guimenu> selector controls a factor used in Dr Glover's equation. This value will alter the relative balance between the two sources of noise in the sub-exposure. As a general rule, Dr Glover had recommended using a value of 5%, but lowering it to 2% when the computed exposure time is considered to be too short.
fr: <guilabel>% d'augmentation du bruit</guilabel> : le sélecteur <guimenu>% d'augmentation du bruit</guimenu> est un paramètre utilisé dans l'équation du Dr Glover. Cette valeur modifie l'équilibre relatif entre les deux sources de bruit de l'image. Le Dr Glover recommande d'utiliser une valeur de 5% mais de la diminuer à 2% lorsque la durée d'exposition est considérée trop courte.

source: The perspective of the "increase" is a relative increase in read-noise compared to noise from light pollution. It may seem counter-intuitive, but raising the value of 'Noise Increase %' will reduce the exposure time, reducing the noise from light pollution (and reducing the target signal), so the 'increase' means a relative increase in the effect of the read noise compared with the pollution noise. Lowering the value of 'Noise Increase %' will increase the exposure time, and will allow more noise from light pollution, (and more target signal), into the exposure. This effectively reduces the relative impact of read-noise.
fr: Augmentation signifie ici une augmentation relative entre le bruit de lecture et celui de la pollution lumineuse. Cela peut paraître contre-intuitif, mais augmenter cette valeur diminue la durée d'exposition, diminuant ainsi le bruit de la pollution lumineuse (diminuant aussi le signal de la cible), ainsi augmenter signifie une augmentation relative de l'effet de bruit de lecture comparée au bruit de la pollution lumineuse. Au contraire, diminuer cette valeur augmente la durée d'exposition et ainsi le bruit de la pollution lumineuse (augmentant aussi le signal de la cible), ce qui a pour effet de réduire l'impact du bruit de lecture.

source: In this implementation of the calculator, the value for the 'Noise Increase %' can be set to in a very broad range to allow a user a greater range for experimentation. But a user should recognize that large changes to this value can have undesired consequences. Forcing an exposure time down may cause the exposure to carry a relatively heavy burden from read noise, and would reduce the quality of the sub-exposure, (the ratio of exposure time to total noise will fall). As a result a significantly higher number of exposures for integration would be needed to achieve an acceptable level of quality. Forcing an exposure time up to long exposure might cause the exposure to have excessive noise from light pollution.
fr: L'implémentation du calculateur permet de choisir des valeurs de « % d'augmentation du bruit » dans une très grande plage pour permettre à l'utilisateur d'expérimenter cet outil. Mais il devra s'attendre à obtenir des effets indésirables s'il teste avec des valeurs trop grandes. En forçant pour obtenir des durée d'exposition faibles, l'effet du bruit de lecture risque de devenir trop important et réduire ainsi la qualité des images. Au contraire, il risque d'augmenter l'effet de la pollution lumineuse.

source: The value selected for the 'noise increase %' is also one which is dependent upon the imaging technique being employed. When a speckle technique ('lucky imaging') is being employed, the user will likely need to force the exposure time down to an extremely short duration (sub-second exposures are standard with this technique). So the user may need to drastically raise the value of 'noise increase %' to reduce the time of the sub-exposure down to the durations demanded by this technique.
fr: Ce paramètre dépend également de la technique d'imagerie utilisée. Pour la technique d'imagerie rapide, il faudra certainement forcer la durée d'exposition vers le bas, typiquement vers des durée sous la seconde, ce qui implique d'augmenter drastiquement ce paramètre.

source: Exposure Calculator Results
fr: Résultats du calculateur

source: <guilabel>Exposure Time (sec)</guilabel>: The calculated duration of an exposure.
fr: <guilabel>Durée d'exposition (s)</guilabel> : spécifie la durée d'exposition.

source: <guilabel>Pollution Electrons</guilabel>: The calculated number of light pollution electrons per pixel impacting the exposure.
fr: <guilabel>Électrons de pollution</guilabel> : le nombre calculé d'électrons de pollution par pixel impactant la durée d'exposition.

source: <guilabel>Shot Noise</guilabel>: The calculated noise from light pollution impacting the exposure.
fr: <guilabel>Bruit de l'image</guilabel> : le bruit calculé de la pollution lumineuse impactant la durée d'exposition.

source: <guilabel>Total Noise</guilabel>: The calculated noise from both light pollution and image sensor read noise impacting the exposure.
fr: <guilabel>Bruit total</guilabel> : le bruit calculé provenant de la pollution lumineuse et du bruit de lecture impactant la durée d'exposition.

source: <emphasis role="bold">Recognize the relationship of exposure time to total noise</emphasis>: The ratio of exposure time to exposure total noise can be thought of as a measurement of a potential quality for the exposure. Short exposures will contain a high amount of noise relative to their exposure time, so a shorter exposure would tend to be of relatively lower quality. Short exposures may still be viable, but a disproportionately higher number of short sub-exposures will be needed for integration to achieve an image of a desired quality.
fr: <emphasis role="bold">Interprétation du rapport durée d'exposition sur bruit total</emphasis> : ce nombre peut être interprété comme une mesure de la qualité potentielle d'une durée d'exposition. Les durées d'exposition courtes contiennent beaucoup de bruit par rapport à la durée d'exposition, et ainsi seront de moindre qualité. Elles restent viables mais il faudra un nombre proportionnellement trop important de prises à empiler pour obtenir une image de qualité acceptable.

source: Stacking / Image Integration Information
fr: Information sur l'empilement des images

source: The value of image stacking is that as images are stacked, the accumulation of exposure time and the data that represents the target signal is increased proportionally with the added number of images being integrated, but the increase in noise is disproportionally lower. As a result, the quality of integrated images can be seen as curve which starts with a good “yield” when the first few sub-exposures are integrated, but this curve has diminishing returns as the number of sub-exposures being integrated is increased.
fr: Cette valeur informe sur l'effet bénéfique d'empiler les images sur l'acquisition du signal de la cible. Le résultat est une courbe indiquant la qualité de l'empilement des images en fonction du nombre d'images, la qualité diminuant avec le nombre d'images.

source: Ideally a desired signal to noise ratio (SNR) would be used for the measure of the level of quality of an image, but the exposure calculator does not possess an ability to recognize the strength of the signal from an intended imaging target, so it cannot calculate an estimated signal to noise ratio. So the level of quality to be specified in the stacking calculation is the integration time in seconds divided by the calculated noise in the integrated image, (a “Time/Noise Ratio”). For the purposes of the calculation, the “Time/Noise Ratio” can be considered as a partial analog to a signal to noise ratio. But the user must recognize that a specified time to noise ratio is not an absolute measure of the quality of all integrated images from all targets because a signal strength (magnitude or flux) is not part of this calculation.
fr: Idéalement, un rapport signal sur bruit (SNR) devrait être utilisé pour mesurer le niveau de qualité des images, mais le calculateur ne permet pas de reconnaître la force du signal d'une image cible et ne peut ainsi pas calculer ce rapport. Le niveau de qualité dans le calcul d'empilement est la durée d'intégration en secondes divisée par le bruit. Ce rapport « Durée/bruit »> peut être considéré comme une analogie grossière du rapport signal sur bruit. Mais l'utilisateur doit garder en tête que le rapport « Durée/bruit » n'est pas une mesure absolue de la qualité de l'empilement des images de toutes les cibles puisque la force du signal (magnitude ou flux) ne fait pas partie du calcul.

source: <guimenuitem>Table</guimenuitem>: A table provides details for stacking based upon the number of hours planned for imaging.
fr: <guimenu>Table</guimenu> : un tableau fournit les détails de l'empilement en fonction du nombre d'heures planifiée pour l'imagerie.

source: The table provides a quick reference for finding the approximate number of sub-exposures that might be completed for a given number of hours in an imaging session. But some functions that consume time are not included in this time calculation. For example, USB based cameras typically take some time for data transmission, or if the user has selected automatic dithering, additional time will be consumed in the imaging process, which is not included in this time calculation.
fr: Ce tableau fournit une indication rapide pour trouver le nombre idéal de trames à utiliser pour un nombre d'heures donné pour une session d'imagerie. Mais certaines étapes qui consomment beaucoup de temps ne sont pas inclues dans le calcul de la durée d'exposition. Par exemple, les appareils connectés via un câble USB prennent beaucoup de temps à transmettre les données. Ou encore le décalage automatique entre les prises. Ces étapes ajoutent du temps au processus d'imagerie et ne sont pas inclues dans le calcul.

source: The far right column of the table shows the calculated time/noise ratio of the integrated (stacked) image that would be produced.
fr: La colonne tout à droite indique le rapport « Durée/bruit » de l'image empilée qui sera produite.

source: <guimenuitem>Graph</guimenuitem>: An interactive graph allows the user to visualize the relative change in potential quality for integrated images with various counts of sub-exposures applied in image stacking. This graph can be navigated through the adjustment of the time/noise ratio value; adjusting this value will recompute the quantity of sub-exposures required for the integrated image to achieve that specified time/noise ratio.
fr: <guimenuitem>Graphique</guimenuitem> : un graphique interactif permet à l'utilisateur de visualiser les changements relatifs de la qualité potentielle des images empilées en fonction du nombre de trames utilisées pour l'empilement. En faisant varier ce rapport, le nombre de trames sera recalculée pour que l'image empilée atteigne ce rapport « Durée/bruit ».

source: In the selection of a Time/Noise ratio for the calculation of the count of stacked exposures, the user might want consider the incremental change to the potential quality of the image from an additional sub-exposure. To help a user assess the value of increasing the number of sub-exposures for integration; the tool includes a calculation of the slope for the selected point on the time/noise curve (the user interface uses a delta symbol to present this value). This delta value represents the change in potential quality that will result from the addition or subtraction of a single sub-exposure.
fr: Lors du choix du rapport Durée/Bruit pour le calcul du nombre de trames idéal à empiler, l'utilisateur souhaitera considérer le changement incrémental à la qualité potentielle de l'image d'une trame supplémentaire. Pour l'aider, l'outil inclut un calcul de la pente du point sélectionné sur la courbe de la durée en fonction du bruit (cette valeur est représentée par un symbole delta sur l'interface graphique). Ce delta représente la variation dans la qualité potentielle en ajoutant ou en soustrayant une trame.

source: As one should expect, at the low-end of exposure counts (when a low value for the Time/Noise Ratio is input), the delta value will be relatively high, so the addition of one image will provide a relatively large improvement to the integrated image. But as a user increases the value for the Time/Noise Ratio, more images will be included for integration, and the delta value will fall, indicating that there is less to be gained from adding more sub-exposures.
fr: Comme on peut s'y attendre, pour des petites valeurs du rapport Durée/Bruit, le delta sera relativement élevé, et ainsi l'ajout d'une trame aura un impact important sur l'image empilée. Mais en augmentant le rapport Durée/Bruit, davantage de trames seront inclues dan l'empilement et la valeur du delta va diminuer, indiquant que l'ajout de plus de trames devient de moins en moins intéressant.

source: The default value for the time / noise ratio is set to 80. This value should not be construed in any way as an optimal value; it was simply chosen as a somewhat average value. A user should consider a few factors when adjusting the value of the time / noise ratio: 1) the strength of the target object, 2) the time / noise ratio of the calculated sub-exposure, 3) the limitations of time for imaging and processing, and limitations of storage capacity for the images.
fr: La valeur par défaut pour le rapport Durée/Bruit est de 80. Cette valeur de devrait pas être considérée comme une valeur optimale. Elle a simplement été choisie comme une valeur moyenne. L'utilisateur doit tenir compte de plusieurs facteurs pour l'ajuster. 1) La brillance de l'objet cible, 2) le rapport Durée/Bruit des trames calculées et 3) la contrainte de temps pour la session d'imagerie et de traitement, ainsi que de la taille du médium d'enregistrement des images.

source: For a strong target, (example, Orion Nebula with magnitude 4), would provide a relatively strong signal. On such a target, the value for the Time/Noise Ratio might be reduced and the computation of sub-exposures, may still produce an image with a very good signal to noise ratio. A much weaker target (example, Thor’s Helmet, magnitude 11), might require a higher time/noise ratio to compensate for the relatively weak target signal.
fr: Les cibles brillantes (par exemple la nébuleuse d'Orion de magnitude 4) fournissent un signal relativement fort. Pour de telles cibles, le rapport Durée/Bruit peut être réduite et le calcul des trames produira toujours une images avec un très bon rapport Signal/Bruit. Les cibles plus faibles (par exemple le Bouclier de Thor de magnitude 11) nécessitent un rapport Durée/Bruit plus élevé pour compenser le signal relativement faible.

source: Depending on the various inputs and imaging conditions, the potential quality of a sub-exposure can vary greatly. In poor sky quality with little or no filtering, the computed sub-exposure time will naturally be short to avoid an overwhelming noise from light pollution, and the exposure time relative to the computed noise will be low (a low time/noise ratio). To achieve a high quality integrated image from low time/noise ratio sub-exposures may require thousands sub-exposures. If the user is concerned about imaging and processing time or storage capacity; then a higher time/noise ratio would needed to reduce the quantity of sub-exposures. Conversely, when input conditions result in a sub-exposure with a long exposure time relative to the computed noise (as with narrow-band imaging), the result may be a sub-exposure with a very high time/noise ratio. In such cases the default value of 80, might result in very few sub-exposures for the integration. But the delta value will be quite high, indicating that raising the time-noise ratio will greatly improve the potential quality of the integrated image.
fr: Selon les différentes valeurs en entrée et les conditions d'imagerie, la qualité potentielle peut grandement varier. Dans des conditions de qualité de ciel mauvaise, la durée calculé des trames sera naturellement courte pour éviter l'effet important de bruit venant de la pollution lumineuse. Si la durée d'imagerie et de traitement, ainsi que la taille d'enregistrement des images sont des paramètres importants pour l'utilisateur, une augmentation du rapport Durée/Bruit sera nécessaire pour réduite la quantité de trames. À l'inverse, quand les conditions sont bonnes et que le rapport résulte en des trames de longues durées par rapport au bruit calculé (dans l'imagerie à filtre étroit par exemple), le résultat sera des trames avec un rapport Durée/Bruit très grand. Dans ce cas, la valeur par défaut de 80 conduira à peu de trames pour l'empilement. Mais la valeur delta sera plutôt haute, indiquant qu'augmenter le rapport Durée/Bruit améliorera de beaucoup la qualité potentielle de l'image empilée.

source: Part of the value of using a Time/Noise ratio as the input for the calculation of the required number of sub-exposures is that it should tend to compensate for the differences in relative noise for sub-exposures of various lengths. A shorter sub-exposure would have a lower time/noise ratio, so it has less capacity to improve an integrated image. Therefore, a disproportionately higher number of short exposures are needed to achieve a given time/noise ratio in an integrated image.
fr: L'intérêt d'utiliser le rapport Durée/Bruit comme paramètre d'entrée pour le calcul du nombre idéal de trames est de compenser la différence de bruit relative lors de l'utilisation de trames de durée différentes. Les trames de petites durées ont un rapport Durée/Bruit plus petit et possède ainsi une moindre capacité à améliorer l'image empilée. Ainsi un nombre disproportionné de courtes expositions est nécessaire pour obtenir un rapport Durée/Bruit défini de l'image empilée.

source: As an example, consider the calculation of the number of sub-exposures required when two sub-exposures times were compared: a 300 second sub-exposure vs a 30 second sub-exposure. The 300 second sub-exposure had a calculated noise of 22.1, resulting in a sub-exposure time/noise ratio of 13.6. When the 'noise increase %' is raised to force the exposure time down to 30 seconds, we see a calculated noise of 9.47, resulting in a much lower sub-exposure time/noise ratio of 3.2. The 300 second exposure is of significantly higher potential quality than the 30 second exposure. We will demand the default time/noise ratio of 80 for integration in both of these cases.
fr: Prenons l'exemple du calcul du nombre de trames nécessaires en comparant deux durées de trames différentes : une trame de 300 secondes et une trame de 30 secondes. Celle de 300 secondes a un rapport calculé de 22.1 résultant en un rapport Durée/Bruit de 13.6. Quand le paramètre « % d'augmentation du bruit » est augmenté pour forcer la durée d'exposition à 30 secondes, on obtient une durée calculée de 9.47, ce qui donne un rapport Durée/Bruit de 3.2. Celle de 300 secondes a une qualité potentielle légèrement supérieure que celle de 30 secondes. On utilise le rapport Durée/Bruit par défaut de 80.

source: For an integration using the 300 second sub-exposures we find that 34 sub-exposures are required to achieve a time/noise ratio of 80. So a total integration time of 2.83 hours is required.
fr: Pour l'empilement des trames de 300 secondes, on trouve que 34 trames sont nécessaires pour obtenir le rapport Durée/Bruit de 80. Ce qui donne une durée totale d'exposition de 2.83 heures.

source: 300 Second sub-exposure
fr: Trames de 300 secondes

source: For an integration using the 30 second sub-exposures we find that 637 sub-exposures would be required to achieve a time/noise ratio of 80. So a total integration time of 5.31 hours is required with these shorter exposures to achieve the same time/noise ratio in the integrated image.
fr: Pour l'empilement des trames de 30 secondes, on trouve que 637 trames sont nécessaires pour obtenir le rapport Durée/Bruit de 80. Ce qui donne une durée totale d'exposition de 5.31 heures avec ces trames plus courtes pour obtenir le même rapport Durée/Bruit de l'image empilée.

source: 30 Second sub-exposure
fr: Trame de 30 secondes

source: Video Tutorials
fr: Tutoriels vidéos

source: <phrase>Capture</phrase>
fr: <phrase>Acquisition</phrase>

source: Filter Wheels
fr: Roues à filtres
