Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_config.po
Languages: fr

source: Eyepiece of a Dobsonian telescope: Choose Horizontal Coordinates, and in the <menuchoice><guimenu>View</guimenu><guisubmenu>Skymap Orientation</guisubmenu></menuchoice> submenu, select <guilabel>Zenith Down</guilabel> and check the <guilabel>Erect observer correction</guilabel> option. Then adjust the orientation manually once to match your telescope eyepiece view, and it should henceforth track it correctly.
fr: Oculaire d'un télescope de Dobson : choisissez les coordonnées horizontales, et dans le sous-menu <menuchoice><guimenu>Affichage</guimenu><guisubmenu>Orientation de la carte du ciel</guisubmenu></menuchoice>, choisissez <guilabel>Zénith en bas</guilabel> et cochez l'option <guilabel>Correction observateur debout</guilabel>. Ensuite ajustez l'orientation manuellement une fois pour correspondre la vue de l'oculaire et le suivi devrait fonctionner.
