Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_hips.po
Languages: fr

source: <acronym>HiPS</acronym> Progressive Overlay
fr: <acronym>HiPS</acronym> Superposition progressive

source: Views
fr: Vues

source: HiPS Progressive Overlay
fr: Superposition progressive HiPS

source: &kstars; provides support for HiPS: Hierarchical Progressive Surveys. HiPS provides multi-resolution progressive surveys to be overlayed directly in client applications. It provides an immersive experience as you can explore the night sky dynamically. With over 200+ surveys across the whole electromagnetic spectrum from radio, infrared, visual, to even gamma rays, the user can pan and zoom progressively deeper into the data visually.
fr: &kstars; fournit la gestion pour HiPS (Hierarchical Progressive Survey). HiPS fournit des relevés progressifs à de multiples résolutions qui peuvent être superposées directement dans les applications client. Cela fournit une expérience immersive puisque vous pouvez explorer le ciel de nuit dynamiquement. Avec plus de 200 études dans tout le spectre électromagnétique depuis les ondes radio, l'infrarouge, le visuel et même les rayons gamme, l'utilisateur peut se déplacer et visuellement zoomer de plus en plus dans les données.

source: It can be enabled from the <menuchoice><guimenu>View</guimenu> <guisubmenu>HiPS All Sky Overlay</guisubmenu></menuchoice> submenu.
fr: Il peut être activé depuis le sous-menu <menuchoice><guimenu>Afficher</guimenu> <guisubmenu>Superposition tout le ciel HiPS</guisubmenu></menuchoice>.

source: Under the submenu, a list of enabled surveys are listed. Click on the survey of interest to activate it. You can only activate one-overlay at a time. After activating the survey, &kstars; shall begin downloading the data in the background and progressively overlay the images unto the sky map as they become ready. Zooming in usually requires another patch of images that should trigger another download cycle.
fr: On trouve dans le sous-menu la liste des relevés activés. Cliquez sur une étude qui vous intéresse pour l'activer. Vous ne pouvez activer qu'un relevé à la fois. Après avoir activer un relevé, &kstars; va commencer à télécharger les données en arrière plan et progressivement superposer les images sur la carte du ciel. Le zoom requiert en général un nouvel ensemble d'images qui déclenchera un nouveau cycle de téléchargement.

source: DSS Color HiPS
fr: HiPS Couleur DSS

source: DSS Color Overlay
fr: Superposition Couleur DSS

source: The above screenshot shows the DSS Color visual overlay in &kstars;.
fr: La capture d'écran ci-dessus montre la superposition visuelle en couleur DSS dans &kstars;.

source: <guimenuitem>HiPS Settings...</guimenuitem> menu item shows a dialog with the following pages:
fr: Le menu de <guimenuitem>Configuration HiPS…</guimenuitem> montre une boîte de dialogue avec les pages suivantes

source: <guilabel>Display</guilabel>: Enable or disable <guilabel>Show HiPS grid</guilabel> and <guilabel>Linear interpolation</guilabel> checkboxes. The interpolation is enabled by default and should make the overlay appear smoother.
fr: <guilabel>Affichage</guilabel> : active ou désactive les cases à cocher <guilabel>Afficher la grille HiPS</guilabel> et <guilabel>Interpolation linéaire</guilabel>. L'interpolation est activée par défaut et devrait rendre la superposition plus lisse.

source: <guilabel>Cache</guilabel>: Set the <guilabel>Disk:</guilabel> and <guilabel>Memory:</guilabel> cache size in MB. Increase cache size if you have abundant resources and want to reduce bandwidth required to download the images.
fr: <guilabel>Cache</guilabel> : règle la taille du cache <guilabel>disque</guilabel> et <guilabel>Mémoire</guilabel> en Mo. Augmenter la taille du cache si vous avez assez de place et si vous souhaitez réduire la bande passante nécessaire au téléchargement.

source: <guilabel>Sources</guilabel>: Browse a list of HiPS sources and enable/disable them accordingly. When you select each source, a summary and a preview are downloaded that include information on the mission in additional to technical data on the survey.
fr: <guilabel>Sources</guilabel> : navigue à travers une liste de sources HiPS et les active ou désactive à la demande. En sélectionnant une source, un résumé et un aperçu seront téléchargés qui inclut de l'information sur la mission et des données techniques sur les relevés.
