Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-guide.po
Languages: fr

source: Dithering does not result in a long wander from the original target position. Ekos keeps track of the original and current target positions, and moves the target back towards the original target should the position have drifted too far.
fr: Les déviations ne résultent pas en une longue balade loin de la position initiale de la cible. Ekos se charge de conserver la position initiale et courante de la cible et déplacera la cible vers sa position initiale dans le cas où la dérive serait devenue trop grande.

source: One-pulse dithering is an interesting quicker option which sends a pulse to dither, but does not verify that the dither reached its desired location. It is possible that the dithering for any given dither isn't as much as desired, but the overall effect should be good.
fr: La déviation à impulsion unique est une option intéressante et plus rapide qui envoie une impulsion de déviation mais sans vérifier qu'elle atteint la position souhaitée. Il est possible que la déviation de n'importe quelle déviation donnée n'est pas tant souhaitée mais l'effet global devrait être bon.

source: Non-guide dithering is also supported. This is useful when no guide camera is available or when performing short exposures. In this case, the mount can be commanded to dither in a random direction for up to the pulse specified in the <guilabel>Non-Guide Dither Pulse</guilabel> option.
fr: Les mini-déviations sans guide sont également possibles. Cela est utile si aucune caméra guide n'est disponible ou lors d'exposition très courte. Dans ce cas, la monture peut être commandée pour réaliser de mini-déviations dans une direction aléatoire pour une durée configuré avec l'option <guilabel>Impulsion déviation sans guide</guilabel>.

source: <title>Drift Graphics</title>
fr: <title>Graphique de la dérive</title>

source: <screeninfo>Drift Graphics</screeninfo>
fr: <screeninfo>Graphique de la dérive</screeninfo>

source: <phrase>Drift Graphics</phrase>
fr: <phrase>Graphique de la dérive</phrase>

source: The drift graphics is a very useful tool to monitor the guiding performance. It is a 2D plot of guiding <emphasis>deviations</emphasis> and <emphasis>corrections</emphasis>. By default, only the guiding deviations in RA and DE are displayed. The horizontal axis is the time in seconds since the autoguiding process was started while the vertical axis plots the guiding drift/deviation in arcsecs for each axis. Guiding corrections (pulses) can also be plotted in the same graph and you can enable them by checking the <guilabel>Corr</guilabel> checkbox below each Axis. The corrections are plotted as shaded areas in the background with the same color as that of the axis.
fr: Le graphique de la dérive est un outil très puissant pour surveiller les performances de guidage. C'est un graphique 2D des <emphasis>déviations</emphasis> du guidage et des <emphasis>corrections</emphasis>. Par défaut, seules les déviations en AD et DEC sont affichées. L'axe horizontal représente le temps en secondes depuis le début du processus de guidage alors que l'axe vertical représente les déviations ou dérives du guidage en secondes d'arc. Les corrections de guidage (impulsions) peuvent être tracées sur le même graphique et vous pouvez les activer en cochant les cases <guilabel>Corr.</guilabel> sous chaque axe. Les corrections sont affichées sous la forme de zones ombrées en arrière-plan avec les mêmes couleurs que celles des axes.

source: You can pan and zoom the plot, and when hovering the mouse over the graph, a tooltip is displayed containing information about this specific point in time. It contains the guiding drift and any corrections made, in addition to the local time, this event was recorded. A vertical slider to the right of the image can be used to adjust the height of the secondary Y-axis for pulses corrections.
fr: Vous pouvez déplacer le graphique ainsi que faire un zoom et lorsque vous survolez une zone, des infobulles apparaîtront contenant de l'information pour un moment spécifique. Elle contient la dérive et la correction effectuée et l'heure locale d'enregistrement de l'évènement. Un curseur vertical à la droite de l'image permet d'ajuster la hauteur de l'axe Y secondaire qui affiche les impulsions de correction.

source: The <guilabel>Trace</guilabel> horizontal slider at the bottom can be used to scroll through the guide history. Alternatively, you can click the <guilabel>Max</guilabel> checkbox to lock the graph onto the latest point so that the drift graphics autoscrolls. The buttons to the right of the slider are used for autoscaling the graphs, exporting the guide data to a CSV file, clearing all the guide data, and for scaling the target in the <guilabel>Drift Plot</guilabel>. Furthermore, the guide graph includes a label to indicate when a dither occurred so the user knows guiding was not bad at those points.
fr: Le curseur horizontal <guilabel>Trace</guilabel> au bas de graphique permet de défiler dans l'historique du guidage. Vous pouvez aussi cliquer la case <guilabel>Max</guilabel> pour verrouiller le graphique sur le dernier point pour ainsi activer le défilement automatique du graphique de dérive. Les boutons à la droite du curseur permettent la mise à l'échelle automatique du graphique, l'exportation des données de guidage vers un fichier CSV, la réinitialisation de toutes les données de guidage et la mise à l'échelle de la cible dans <guilabel>Graphique de la dérive</guilabel>. De plus, ce graphique affiche une étiquette pour indiquer le moment des mini-déviations (dithering), ce qui est utile à l'utilisateur pour savoir que le guidage n'était pas mauvais à ce moment-là.

source: The colors of each axis can be customized in <link linkend="colors">&kstars; Settings color scheme</link>.
fr: La couleur de chaque axe peut être modifiée dans la boîte de dialogue <link linkend="colors">Réglages de schémas de couleurs de &kstars;</link>.

source: Drift Plot
fr: Graphique des dérives

source: A bulls-eye scatter plot can be used to gauge the <emphasis>accuracy</emphasis> of the overall guiding performance. It is composed of three concentric rings of varying radii with the central green ring having a default radius of 2 arcsecs. The last RMS value is plotted as <inlinemediaobject><imageobject><imagedata fileref="add-circle.png" format="PNG"/></imageobject></inlinemediaobject> with its color reflecting which concentric ring it falls within. You can change the radius of the innermost green circle by adjusting the drift plot accuracy.
fr: Un graphique de dispersion peut être utilisé pour juger de la <emphasis>précision</emphasis> de la performance de guidage globale. Il se compose de trois anneaux concentriques de rayon différent avec l'anneau central ayant un rayon de 2 secondes d'arc. La dernière valeur RMS est tracée avec l'icône <inlinemediaobject><imageobject><imagedata fileref="add-circle.png" format="PNG"/></imageobject></inlinemediaobject> et dont la couleur reflète sa position. Vous pouvez modifier la couleur de l'anneau central en ajustant la précision du graphique de dérive.

source: <title>Guiding with GPG</title>
fr: <title>Guidage avec GPG</title>

source: GPG Guiding
fr: Guidage avec GPG

source: <phrase>Guiding with GPG</phrase>
fr: <phrase>Guidage avec GPG</phrase>

source: With GPG guiding, the internal guider uses predictive and adaptive guiding for the RA axis. This adaptively models the periodic error of the mount, and adds its predicted contribution to each guide pulse.
fr: Avec le guidage avec GPG (Gaussian Process Guider), le guide interne utilise un guidage prédictif et adaptatif pour l'axe en ascension droite seulement. Cela crée un modèle adaptatif de l'erreur périodique de la monture et ajoute la contribution prédite à chaque impulsion.

source: The main settings to consider are Major Period and Estimate Period. If you know the worm period for your mount, perhaps by examining <ulink url="https://github.com/OpenPHDGuiding/phd2/wiki/Mount-Worm-Period-Info">this table</ulink>, then uncheck Estimate Period and enter your known Major Period. If not, then check Estimate Period. Intra-frame dark guiding can be used to "spread out the GPG prediction. For instance, if you guide at 5s, you can set the dark guiding interval to 1s and its prediction is pulsed every second, but the guiding drift correction would be sent every 5s. In this way, it outputs the predicted corrections much faster than the guide camera exposure rate, effectively performing periodic error correction and allowing longer guide camera exposures. All the other parameters are best left to defaults.
fr: Les réglages principaux à considérer sont Période Principale et Période Estimée. Si vous connaissez la période hélicoïdale de votre monture, peut-être en analysant cette <ulink url="https://github.com/OpenPHDGuiding/phd2/wiki/Mount-Worm-Period-Info">table</ulink>, décochez Période Estimée et saisissez la valeur de Période Principale. Dans le cas contraire, cochez Période Estimée. Le guidage avec les trames Dark peut être utilisé pour diffuser les prédictions GPG. Par exemple, si vous guider avec une durée de 5 secondes, vous pouvez régler l'intervalle de guidage de Dark à 1 seconde, ainsi les prédictions d'impulsions sont envoyées chaque seconde, tout en ayant des corrections de déviation de guidage envoyés chaque 5 secondes. Ainsi, les prédictions de corrections sont envoyées bien plus rapidement que le taux d'exposition de l'appareil, réalisant ainsi des corrections d'erreurs périodiques et permettant de plus longues poses de l'appareil guide. Tous les autres paramètres restent inchangés.

source: Dark Frames
fr: Trames Dark

source: Dark frames can be helpful to reduce noise in your guide frames. If you choose to use this option, then it is recommended that you take dark frames before you begin your calibration or guiding procedure. To take a dark frame, check the <guilabel>Dark</guilabel> checkbox and then click <guibutton>Capture</guibutton>. For the first time this is performed, Ekos will ask you about your camera shutter. If your camera does not have a shutter, then Ekos will warn you anytime you take a dark frame to cover your camera/telescope before proceeding with the capture. On the other hand, if the camera already includes a shutter, then Ekos will directly proceed with taking the dark frame. All dark frames are automatically saved to Ekos Dark Frame Library. By default, the Dark Library keeps reusing dark frames for 30 days after which it will capture new dark frames. This value is configurable and can be adjusted in <link linkend="ekos">Ekos settings</link> in the &kstars; settings dialog.
fr: Les trames Dark sont utiles pour aider à réduire le bruit des trames de guidage. Si vous choisissez cette option, il est hautement recommandé d'en prendre avec de commencer la calibration et la procédure de guidage. Pour prendre une trame Dark, cochez la case <guilabel>Dark</guilabel> et ensuite cliquez sur le bouton <guibutton>Acquisition</guibutton>. La première fois que vous réaliserez cela, Ekos vous demandera si votre caméra possède un obturateur et si ce n'est pas le cas, il vous avertira de couvrir votre caméra ou télescope avant le début de l'acquisition. Si votre caméra en possède un, alors Ekos procédera directement à l'acquisition des trames Dark. Toutes les trames Dark seront automatiquement enregistrées dans la bibliothèque de Dark. Par défaut ces trames seront utilisées pendant 30 jours après quoi une nouvelle série sera prise. Cette durée peut être configurée dans <link linkend="ekos">Configuration Ekos</link> dans la boîte de dialogue de la configuration de &kstars;.

source: <screeninfo>Ekos Dark frames library</screeninfo>
fr: <screeninfo>Bibliothèque de trames Dark d'Ekos</screeninfo>

source: <phrase>Ekos Dark frames library</phrase>
fr: <phrase>Bibliothèque de trames Dark d'Ekos</phrase>

source: It is recommended to take dark frames covering several binning and exposure values so that they may be reused transparently by Ekos whenever needed.
fr: Il est recommandé de prendre des trames Dark couvrant plusieurs groupements de pixels et différentes durées d'exposition afin qu'elles puissent être utilisées de manière transparente par Ekos lorsque c'est nécessaire.

source: PHD2 Support
fr: Gestion de PHD2

source: You can opt to select external PHD2 application to perform guiding instead of the built-in guider.
fr: Vous pouvez choisir d'utiliser l'application externe PHD2 pour réaliser le guidage plutôt que d'utiliser le guidage intégré.

source: <screeninfo>Ekos Guide PHD2 settings</screeninfo>
fr: <screeninfo>Réglages du guidage PHD2 Ekos</screeninfo>

source: <phrase>Ekos Guide PHD2 settings</phrase>
fr: <phrase>Réglages du guidage PHD2 Ekos</phrase>

source: If PHD2 is selected, the <guibutton>Connect</guibutton> and <guibutton>Disconnect</guibutton> buttons are enabled to allow you to establish a connection with the PHD2 server. You can control PHD2 exposure and DEC guide settings. When clicking <guibutton>Guide</guibutton>, PHD2 should perform all the required actions to start the guiding process. PHD2 <emphasis role="bold">must</emphasis> be started and configured <emphasis>before</emphasis> Ekos.
fr: Si PHD2 est sélectionné, les boutons <guibutton>Connexion</guibutton> et <guibutton>Déconnexion</guibutton> sont activés pour vous permettre d'établir la connexion avec le serveur PHD2. Vous pouvez contrôler la durée d'exposition de PHD2 et régler le guidage en DEC. Quand vous cliquez sur <guibutton>Guidage</guibutton>, PHD2 réalisera toutes les actions requises pour débuter la procédure de guidage. Veuillez noter que PHD2 <emphasis role="bold">doit</emphasis> être démarré et configuré <emphasis>avant</emphasis> Ekos.

source: After launching PHD2, select your INDI equipment and set their options. From Ekos, connect to PHD2 by clicking the <guibutton>Connect</guibutton> button. On startup, Ekos will attempt to automatically connect to PHD2. Once the connection is established, you may begin the guiding immediately by click on the <guibutton>Guide</guibutton> button. PHD2 performs calibration if necessary. If dithering is selected, PHD2 is commanded to dither given the offset pixels indicated, and once guiding is settled and stable, the capture process in Ekos resumes.
fr: Après avoir démarré PHD2, sélectionnez votre matériel INDI et configurez les options. Vous pouvez vous connecter à PHD2 directement depuis Ekos en cliquant sur le bouton <guibutton>Connexion</guibutton>. Au démarrage Ekos tentera de se connecter automatiquement à PHD2. Une fois que la connexion est établie, vous pouvez débuter le guidage immédiatement en cliquant sur le bouton <guibutton>Guidage</guibutton>. PHD2 procédera à la calibration si nécessaire. Si les mini-déviations (dithering) sont activées, PHD2 enverra les commandes de mini-déviations données par le décalage des pixels et dès que le guidage est stabilisé et stable, Ekos pourra reprendre la procédure d'acquisition.

source: Guiding Logs
fr: Journaux de guidage

source: Ekos' internal guider saves a CSV guide log in PHD2 format data that can be useful for analysis of the mount's performance. In Linux this is stored under <filename>~/.local/share/kstars/guidelogs/</filename>. This log is only available when using Ekos' internal guider. It should be compatible with <ulink url="https://openphdguiding.org/phd2-log-viewer/">PHD2's guide log viewer</ulink>.
fr: Ekos enregistre les données de guidage dans un fichier CSV au format PHD2 qui peut être utile pour analyser les performances de la monture. Sous Linux, elles sont enregistrées sous (<filename>~/.local/share/kstars/guide_log.txt</filename>). Ce fichier journal n'est disponible que pour le guidage interne et devrait être compatible avec l'utilitaire de <ulink url="https://openphdguiding.org/phd2-log-viewer/">visualisation des fichiers journaux de guidage de PHD2</ulink>.
