Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_faq.po
Languages: fr

source: Questions and Answers
fr: Questions et réponses

source: What do the different symbols for deep-sky objects mean?
fr: Que signifient tous ces symboles associés aux objets lointains ?

source: The symbol indicates the object type:
fr: Le symbole indique le type d'objet :

source: dotted circle: Open Cluster
fr: Cercle pointillé : amas ouvert

source: cross-in-circle: Globular Cluster
fr: Croix dans un cercle : amas globulaire

source: box: Gaseous Nebula
fr: Rectangle : nébuleuse gazeuse

source: diamond: Supernova Remnant
fr: Losange : reste de supernova

source: circle with outer lines: Planetary Nebula
fr: Cercle entouré d'une ligne : nébuleuse planétaire

source: ellipse: Galaxy
fr: Ellipse : galaxie

source: What do the different colors of Deep-sky objects mean?
fr: Que signifient les différentes couleurs des objets lointains ?

source: Generally, the different colors indicate to which catalog the object belongs (Messier, NGC or IC). However, some objects have a different color which indicates that there are extra images available in the <link linkend="popup-menu">popup menu</link> (the default <quote>extras</quote> color is red).
fr: En général, la couleur indique à quel catalogue l'objet appartient (Messier, NGC ou IC). Cependant, certains objets ont une couleur différente, qui indique que des images supplémentaires sont disponibles dans le <link linkend="popup-menu">menu contextuel</link> (la couleur <quote>supplémentaire</quote> par défaut est le rouge).

source: Why are there so many more U.S. cities than in other countries?
fr: Pourquoi y a-t-il beaucoup plus de villes américaines que de villes d'autres pays ?

source: When we started &kstars;, we were unable to find a longitude/latitude database that covered the globe equitably. However, the &kstars; community is rapidly overcoming this problem! We have already received city lists from many users around the world. If you can contribute to this effort, please send us your list of cities and coordinates.
fr: Quand nous avons commencé &kstars;, nous n'avons pu trouver une base de données de latitudes et longitudes mondiales. Cependant la communauté de &kstars; surmonte rapidement ce problème. Nous avons déjà reçu des listes de villes de nombreux utilisateurs du monde entier. Si vous pouvez contribuer à cet effort, veuillez nous envoyer vos listes de villes avec leurs coordonnées.

source: How can I add a new custom location to &kstars;?
fr: Comment ajouter un emplacement personnalisé à &kstars; ?

source: If you would like to use a location that is not on the list, enter the relevant information (longitude, latitude, city name, province name, and country name), then press <guibutton>Add City</guibutton> button. All fields must be filled, except the optional province field. You can also modify the values for an existing city, by simply changing the values in the window, and adding it to the list.
fr: Si vous souhaitez utiliser un emplacement qui n'est pas sur la liste, veuillez entrer l'information pertinente (longitude, latitude, nom de ville, nom de province et nom du pays), puis appuyez sur le bouton <guibutton>Ajouter ville</guibutton>. Tous les champs doivent être remplis, sauf celui de la province qui est optionnel. Vous pouvez également modifier les valeurs d'une ville existante, en les modifiant simplement dans la fenêtre puis en l'ajoutant à la liste.

source: I have added a custom location to &kstars; that I no longer want. How do I remove it from the program?
fr: J'ai ajouté un emplacement personnalisé à &kstars;, et je n'en veux plus. Comment le retirer du programme ?

source: You can easily remove a custom location from &kstars; by selecting it in the cities list and pressing the <guibutton>Remove City</guibutton> button. Note that you can not remove a &kstars; default city.
fr: Vous pouvez facilement supprimer un emplacement personnalisé de &kstars; en le sélectionnant la liste de villes et en cliquant sur le bouton <guibutton>Supprimer ville</guibutton>. Veuillez noter que vous ne pouvez pas supprimer la ville par défaut.

source: Why do some objects disappear when I am scrolling the display?
fr: Pourquoi certaines étoiles et objets disparaissent lorsque l'image est translatée ?

source: When the display is in motion, &kstars; must recompute the screen coordinates of every object in its database, which involves some pretty heavy trigonometry. When scrolling the display (either with the arrow keys or by dragging with the mouse), the display may become slow and jerky, because the computer is having trouble keeping up. By excluding many of the objects, the computational load is greatly reduced, which allows for smoother scrolling. You can turn off this feature in the <guilabel>Configure - &kstars;</guilabel> window, and you can also configure which objects get hidden.
fr: Lorsque l'affichage est en mouvement, &kstars; doit recalculer les coordonnées de chaque objet dans sa base de données, ce qui implique de la trigonométrie lourde. En faisant défiler l'affichage (soit avec les touches fléchées, soit en tirant avec la souris), l'affichage peut devenir lent et saccadé, du fait que l'ordinateur a du mal à suivre. En excluant certains objets, la charge de l'ordinateur est réduite, ce qui rend le défilement plus régulier. Vous pouvez désactiver cette fonction dans la fenêtre <guilabel>Configurer &kstars;</guilabel> et vous pouvez déterminer quels objets seront cachés.

source: I do not understand all the terms used in &kstars;. Where can I learn more about the astronomy behind the program?
fr: Je ne comprends pas certains termes utilisés dans &kstars;. Où puis-je en apprendre plus au sujet de l'astronomie ?

source: The &kstars; Handbook includes the <link linkend="astroinfo">AstroInfo Project</link>; a series of short, hyperlinked articles about astronomical topics that can be explored and illustrated with &kstars;. AstroInfo is a community effort, like GNUpedia or Everything2. If you'd like to contribute to AstroInfo, please join our mailing list: <email>kstars-devel AT kde.org</email>.
fr: Le manuel de &kstars; inclut le <link linkend="astroinfo">projet AstroInfo</link> ; une série de petits articles avec des hyperliens sur les sujets astronomiques qui peuvent être explorés et illustrés avec &kstars;. AstroInfo est un effort communautaire, comme GNUpedia ou Everything2. Si vous voulez contribuer à AstroInfo, veuillez rejoindre notre liste de diffusion : <email>kstars-devel AT kde.org</email>.

source: I want &kstars; to start up with a time and date different from my system CPU clock. Is this possible?
fr: Je veux que &kstars; démarre avec une heure et une date différentes de mon horloge matérielle. Est-ce possible ?

source: Yes; to start &kstars; with a different time/date, use the <option>--date</option> argument, followed by a date string like <quote>4 July 1976 12:30:00</quote>
fr: Oui. Pour démarrer &kstars; avec une heure et une date différentes, utilisez l'argument <option>--date</option>, suivi par une chaîne comme <quote>4 Juillet 1976 12:30:00</quote>

source: I want &kstars; to start up with the simulation clock paused. Is this possible?
fr: Je veux que &kstars; démarre avec l'horloge de simulation arrêtée. Est-ce possible ?

source: Yes; to start &kstars; with the clock paused, simply add the <option>--paused</option> argument to the command line.
fr: Oui. Pour démarrer &kstars; avec l'horloge arrêtée, utilisez l'argument <option>--paused</option> en ligne de commande.

source: How accurate/precise is &kstars;?
fr: À quel point &kstars; est-il exact ?

source: &kstars; is pretty accurate, but it is not (yet) as precise as it can possibly be. The problem with high-precision calculations is that you start having to deal with a large number of complicating factors. If you are not a professional astronomer, you will probably never have a problem with its accuracy or precision.
fr: &kstars; est très précis, mais il n'est pas aussi précis qu'il pourrait l'être. Le problème que l'on rencontre lors de calculs de haute précision est qu'il existe un grand nombre de facteurs qui compliquent les choses. Si vous n'êtes pas un astronome professionnel, vous n'aurez probablement jamais de problème lié à la précision.

source: Here is a list of some of the complicating factors which limit the program's precision:
fr: Voici une liste de facteurs qui limitent la précision du programme :

source: Planet positions are only accurate for dates within 4000 years or so of the current epoch. The planet positions are predicted using a Fourier-like analysis of their orbits, as observed over the past few centuries. We learnt in school that planets follow simple elliptical orbits around the Sun, but this is not strictly true. It would be true only if there was only one planet in the Solar system, and if the Sun and the planet were both point masses. As it is, the planets are constantly tugging on each other, perturbing the orbits slightly, and tidal effects also induce precessional wobbling. In fact, recent analysis suggests that the planets' orbits may not even be stable in the long term (&ie;, millions or billions of years). As a rule of thumb, you can expect the position of a planet to be accurate to a few arcseconds between the dates -2000 and 6000.
fr: Les positions des planètes sont précises seulement pour les dates d'environ 4 000 ans avant et après notre époque. Les positions des planètes sont prédites en utilisant une analyse de leurs orbites de type Fourier, comme observé aux siècles passés. Nous avons appris à l'école que les planètes suivent de simples orbites elliptiques autour du Soleil, mais ce n'est pas strictement vrai. Ce serait vrai s'il n'y avait qu'une planète dans le système solaire, et si le Soleil et la planète étaient des masses ponctuelles. Dans la réalité, les planètes interagissent en permanence, perturbant légèrement leurs orbites et les effets de marée induisent aussi une précession. En fait, des analyses récentes suggèrent que les orbites des planètes peuvent ne pas être stables sur un long terme.(&ie; des millions d'années). Schématiquement, vous pouvez attendre une position précise des planètes à quelques secondes d'arc entre les dates -2 000 et 6 000.

source: Pluto is the exception to this; its position is perhaps ten times less precise than the positions of the other planets. Still, for dates near the present epoch, its position can be trusted to about an arcsecond.
fr: Pluton est l'exception à cette règle ; sa position est peut-être dix fois moins précise que les positions des autres planètes. Même pour des dates proches de l'époque actuelle, sa position ne peut être estimée qu'à une seconde d'arc près.

source: The moon's position is the most difficult to predict to high precision. This is because its motion is quite perturbed by the Earth. Also, since it is so nearby, even minute effects that would be undetectable in more distant bodies are easily apparent in the moon.
fr: La position de la Lune est la plus difficile à prédire avec une haute précision. C'est dû au fait que son mouvement est très perturbé par la Terre. De plus, comme elle est très voisine, même des effets minuscules que seraient indétectables dans des corps plus éloignés sont facilement apparents sur la Lune.

source: The objects with the worst long-term precision in the program are the comets and asteroids. We use a very simplistic orbital model for the minor planets that does not include third-body perturbations. Therefore, their positions can only be trusted for dates near the present epoch. Even for the present epoch, one can expect positional errors among the minor planets of order 10 arcseconds or more.
fr: Les objets avec la précision à long terme la pire dans le programme sont les comètes et astéroïdes. Nous utilisons un modèle orbital simple pour les planètes mineures qui n'inclut pas les perturbations par des corps tiers. De ce fait, on ne peut faire confiance à leur position que pour des époques proches de la nôtre. Même pour le présent, on peut avoir des erreurs de position pour les planètes mineures de l'ordre de 10 secondes d'arc ou plus.

source: Why do I have to download an improved NGC/IC catalog and Messier object images? Why not just include them as part of the &kstars; distribution?
fr: Pourquoi dois-je télécharger un catalogue amélioré NGC/IC et des images d'objets Messier ? Pourquoi ne pas les inclure dans la distribution de &kstars; ?

source: The author of the downloadable NGC/IC catalog has released it with the restriction that it may not be used commercially. For most &kstars; users, this is not a problem. However, it is technically against the &kstars; license (the <acronym>GPL</acronym>) to restrict usage in this way. We removed the Messier object images from the standard distribution for two reasons: to simply reduce the size of &kstars;, and also because of similar licensing concerns with a couple of the images. The inline images are significantly compressed to a very low quality from their original form, so I doubt there is a real copyright concern, but I did obtain explicit permission from the images' authors to use the few images for which there was any question about it (see <filename>README.images</filename>). Still, just to be absolutely safe, I removed them from the standard distribution, and marked the download archive as being <quote>free for non-commercial use</quote>.
fr: L'auteur du catalogue téléchargeable NGC/IC l'a diffusé avec la restriction qu'il n'est pas possible de l'utiliser commercialement. Pour la plupart des utilisateurs de &kstars;, ce n'est pas un problème. Cependant, c'est techniquement incompatible avec la licence de &kstars; (<acronym>GPL</acronym>) de restreindre l'utilisation de cette manière. Nous avons retiré les images d'objets Messier de la distribution standard pour deux raisons : pour réduire la taille de &kstars; et du fait de problèmes de licence similaires sur certaines images. Les images en ligne sont plutôt compressées en basse qualité par rapport à l'original, et je doute donc qu'il y ait véritablement un problème de droits, mais je ai obtenu l'autorisation explicite des auteurs d'utiliser quelques images pour lesquelles se posaient des questions (voir <filename>README.images</filename>). Pour être absolument tranquille, je les ai retirées de la distribution standard et marqué l'archive à télécharger <quote>gratuite pour un usage non commercial</quote>.

source: I am really enjoying the beautiful images I have downloaded through &kstars;! I would like to share them with the world; can I publish a calendar featuring these images (or are there any usage restrictions on the images)?
fr: J'aime vraiment les belles images que j'ai téléchargé avec &kstars;. J'aimerais les partager avec le monde ; puis-je publier un calendrier montrant ces images (ou y a-t-il des restrictions à l'usage de ces images) ?

source: It depends on the image, but many of the images restrict against commercial usage. The Image Viewer's statusbar will usually contain information about the image's copyright holder, and what usage restrictions apply. As a rule of thumb: anything published by NASA is in the public domain (including all HST images). For everything else, you can pretty safely assume that the images may not be used commercially without permission. When in doubt, contact the image's copyright holder directly.
fr: Cela dépend de l'image, mais beaucoup d'images restreignent l'utilisation commerciale. La barre d'état de l'afficheur d'images contient habituellement des informations sur le détenteur des droits, et à quels usages les restrictions s'appliquent. En règle générale, tout ce qui est publié par la NASA est du domaine public (y compris les images du HST). Pour tout le reste, vous pouvez supposer que les images ne peuvent être utilisées commercialement sans permission. Quand vous êtes dans le doute, contactez directement le détenteur des droits.

source: Can I help contribute to future versions of &kstars;?
fr: Puis-je contribuer aux versions prochaines de &kstars; ?

source: Yes, definitely! Introduce yourself on our mailing list: <email>kstars-devel AT kde.org</email>. If you want to help with the coding, download the latest <ulink url="https://invent.kde.org/education/kstars">&kstars; &git;</ulink> version of the code and dive right in. There are several <filename>README</filename> files in the distribution that explain some of the code's subsystems. If you need ideas of what to work on, see the <filename>TODO</filename> file. You can submit patches to kstars-devel mailing list, and feel free to post any questions you have about the code there as well.
fr: Oui, certainement ! Faites-vous connaître sur notre liste de diffusion : <email>kstars-devel AT kde.org</email>. Si vous désirez aider la programmation, téléchargez le dernier code <ulink url="http://invent.kde.org/education/kstars">Git &kstars;</ulink> et plongez dedans. Il y a plusieurs fichiers <filename>README</filename> dans la distribution expliquant certains sous-systèmes du code. Si vous avez besoin d'idées sur quoi travailler, voyez le fichier <filename>TODO</filename>. Vous pouvez soumettre y des modificatifs à kstars-devel et vous sentir libre de poster toute question que vous avez sur le code.

source: If you are not into coding, we can still use your help with i18n, docs, AstroInfo articles, &URL; links, bug reports, and feature requests.
fr: Si vous n'êtes pas programmeur vous pouvez participer à l'effort d'internationalisation (i18n), à la documentation, aux articles sur AstroInfo, liens &URL;, aux rapports de bogues, et aux demandes spéciales d'amélioration.
