Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_quicktour.po
Languages: fr

source: A Quick Tour of the &kstars; Skymap
fr: Un survol de la carte du ciel de &kstars;

source: This chapter presents a guided tour of the &kstars; skymap, introducing many of its important features.
fr: Ce chapitre propose une visite guidée de la carte du ciel de &kstars; et introduit beaucoup de concepts et fonctionnalités importantes.

source: Here is a screenshot of the &kstars; main window:
fr: Voici une capture d'écran contenant la fenêtre principale de &kstars; :

source: Main Window
fr: Fenêtre principale

source: The above screenshot shows a typical view of the &kstars; program. You can see the sky display centered on Betelgeuse, the brightest star in the constellation Orion. Stars are displayed with <link linkend="ai-colorandtemp">realistic colors</link> and relative brightnesses. In three corners of the sky display, there are on-screen text labels displaying data on the current time (<quote>LT: 3:08:30 AM EEST Wednesday, July 6, 2016</quote>), the current Geographic Location (<quote>Bucharest, Romania</quote>), and the current object in the center of the display (<quote>Focused on: Betelgeuse (alpha Orionis)</quote>). Above the sky display, there are two toolbars. The main toolbar contains shortcuts for <link linkend="kstars-menus">menu functions</link>, as well as a time-step widget which controls how fast the simulation clock runs. The view toolbar contains buttons that toggle the display of different kinds of objects in the sky. At the bottom of the window, there is a status bar which displays the name of any object you click on, and the <link linkend="ai-skycoords">sky coordinates</link> (both Right Ascension/Declination and Azimuth/Altitude) of the mouse cursor.
fr: La capture d'écran ci-dessus affiche une vue typique du programme &kstars;. On peut voir l'affichage du ciel centré sur Bételgeuse, l'étoile la plus brillante dans la constellation d'Orion. Les étoiles sont présentées avec des <link linkend="ai-colorandtemp">couleurs réalistes</link> et une brillance relative. Dans trois coins de l'affichage du ciel, il y a des étiquettes affichant des informations sur l'heure actuelle (<quote>Heure locale : 20:16:20 h mercredi, 4 mai 2022</quote>), la position géographique actuelle (<quote>Pic du Midi (obs. du), Hautes-Pyrénées, France</quote>) et l'objet actuel au centre de l'affichage (<quote>Bételgeuse (α Orionis)</quote>). Au-dessus de l'affichage du ciel, se trouvent deux barres d'outils. La barre principale contient des raccourcis pour les <link linkend="kstars-menus">fonctions de menus</link>, ainsi qu'un composant graphique de pas temporel contrôlant la vitesse de l'horloge de simulation. La barre d'affichage contient des boutons qui activent l'affichage de différentes sortes d'objets dans le ciel. Au bas de la fenêtre se trouve une barre d'état affichant le nom de l'objet sur lequel vous avez cliqué et les <link linkend="ai-skycoords">coordonnées célestes</link> (à la fois l'ascension droite et la déclinaison ainsi que l'azimut et l'élévation) du pointeur de la souris.

source: The Setup Wizard
fr: L'assistant de configuration

source: Setup Wizard
fr: Assistant de configuration

source: The first time you run &kstars;, you will be presented with a Setup Wizard, which allows you to easily set your geographic location and download some extra data files. You can press the <guilabel>OK</guilabel> button at any time to exit the Setup Wizard.
fr: La première fois que vous lancez &kstars;, il vous sera présenté un assistant de configuration qui permet de spécifier facilement votre position géographique et de télécharger des fichiers de données supplémentaires. Vous pouvez cliquer sur le bouton <guilabel>Ok</guilabel> à tout moment pour quitter l'assistant de configuration.

source: The second page of the Setup Wizard allows you to choose the starting geographic location, by selecting from the list of the 3400+ known locations on the right side of the window. The list of locations can be filtered to match the text you enter in the <guilabel>City filter:</guilabel>, <guilabel>Province filter:</guilabel>, and <guilabel>Country filter:</guilabel> edit boxes. If your desired location is not present in the list, you can select a nearby city instead for now. Later on, you can add your precise location manually using the <link linkend="setgeo">Set Geographic Location tool</link>. Once you have selected a starting location, press the <guilabel>Next</guilabel> button.
fr: La deuxième page de l'assistant de configuration vous permet de choisir la position géographique de départ en la sélectionnant dans une liste de plus de 3400 positions. La liste des positions peut être filtrée pour correspondre au texte que vous avez saisi dans les zones de texte <guilabel>Ville</guilabel>, <guilabel>Province</guilabel> et <guilabel>Pays</guilabel>. Si votre position n'est pas présente dans la liste, choisissez une ville proche. Plus tard, vous pourrez ajouter votre position précise vous-même en utilisant l'outil <link linkend="setgeo">Déterminer la position géographique</link>. Une fois que vous avez sélectionné une position de démarrage, cliquez sur le bouton <guilabel>Suivant</guilabel>.

source: The last page of the Setup Wizard allows you to download extra data that are not included with the standard distribution of &kstars;. Simply press the <guilabel>Download Extra Data...</guilabel> button to open the <guilabel>Get New Stuff</guilabel> tool. When you are all done, press the <guilabel>OK</guilabel> button in the Setup Wizard to start exploring &kstars;.
fr: La dernière page de l'assistant de configuration vous permet de télécharger des données supplémentaires qui ne sont pas incluses dans la distribution standard de &kstars;. Cliquez sur le bouton <guilabel>Téléchargement de données supplémentaires…</guilabel> pour ouvrir l'outil <guilabel>Obtenir des nouvelles données</guilabel>. Lorsque ce sera fait, cliquez sur le bouton <guilabel>Ok</guilabel> dans l'assistant de configuration pour commencer à explorer &kstars;.

source: Have a Look Around
fr: Faites le tour de &kstars;

source: Navigation Controls
fr: Contrôles de navigation

source: Basics
fr: Bases

source: Now that we have the time and location set, let us have a look around. You can pan the display using the arrow keys. If you hold down the &Shift; key before panning, the scrolling speed is increased. The display can also be panned by clicking and dragging with the mouse. Note that while the display is scrolling, not all objects are displayed. This is done to cut down on the <acronym>CPU</acronym> load of recomputing object positions, which makes the scrolling smoother (you can configure what gets hidden while scrolling in the <link linkend="config">Configure - &kstars;</link> window). There are several ways to change the magnification (or <firstterm>Zoom level</firstterm>) of the display:
fr: Maintenant que votre position et votre heure sont ajustées, faisons le tour du propriétaire. Vous pouvez bouger l'image à l'aide des flèches sur votre clavier. L'image bougera deux fois plus vite si vous gardez enfoncée la touche &Maj;. Une autre façon de bouger l'image est de laisser enfoncé le bouton de la souris tout en la bougeant. Vous noterez que certains objets disparaissent temporairement lorsque l'image est bougée. Cela réduit la charge sur votre <acronym>processeur</acronym> et permet un défilement plus en douceur (vous pouvez configurer ce qui est caché pendant le déplacement dans la fenêtre de <link linkend="config">Configuration de &kstars;</link>). Il y a plusieurs manières de changer le grossissement (ou <firstterm>Niveau de zoom</firstterm>) de l'affichage :

source: Use the <keycap>+</keycap> and <keycap>-</keycap> keys.
fr: Utilisez les touches <keycap>+</keycap> et <keycap>-</keycap>.

source: Press the <guibutton>Zoom In</guibutton>/<guibutton>Zoom Out</guibutton> buttons in the toolbar.
fr: Actionnez les boutons <guibutton>zoom avant</guibutton>/<guibutton>zoom arrière</guibutton> dans la barre d'outils.

source: Select the <menuchoice><guimenu>View</guimenu> <guimenuitem>Zoom In / Zoom Out</guimenuitem></menuchoice> menu item.
fr: Sélectionnez le menu <menuchoice><guimenu>Affichage</guimenu> <guimenuitem>Zoom arrière/Zoom avant</guimenuitem></menuchoice>.

source: Select the <menuchoice><guimenu>View</guimenu> <guimenuitem>Zoom to Angular Size...</guimenuitem></menuchoice> menu item. This allows you to specify the field-of-view angle for the display, in degrees.
fr: Sélectionnez le menu <menuchoice><guimenu>Affichage</guimenu> <guimenuitem>Zoomer à la dimension angulaire…</guimenuitem></menuchoice>. Cela vous permet de spécifier l'angle (en degrés) du champ de vision pour l'affichage.

source: Use the scroll <mousebutton>wheel</mousebutton> on your mouse.
fr: Utilisez la <mousebutton>molette</mousebutton> de votre souris.

source: Drag the mouse up and down with the &MMB; pressed.
fr: Tirez la souris vers le haut et le bas avec le bouton central enfoncé.

source: Hold down &Ctrl; while dragging the mouse. This will allow you to define a rectangle in the map. When you release the mouse button, the display will zoom to match the rectangle.
fr: Maintenez enfoncé &Ctrl; en tirant la souris. Cela vous permet de définir un rectangle dans la carte. Quand vous relâchez le bouton de la souris, l'affichage zoomera pour correspondre au rectangle.

source: Notice that as you zoom in, you can see fainter stars than at lower zoom settings.
fr: Notez que lorsque vous zoomez vers l'avant, vous pouvez voir des étoiles plus pâles qu'en zoom arrière.

source: Zoom out until you can see a green curve; this represents your local <link linkend="ai-horizon">horizon</link>. If you have not adjusted the default &kstars; configuration, the display will be solid green below the horizon, representing the solid ground of the Earth. There is also a white curve, which represents the <link linkend="ai-cequator">celestial equator</link>, and a brown curve, which represents the <link linkend="ai-ecliptic">Ecliptic</link>, the path that the Sun appears to follow across the sky over the course of a year. The Sun is always found somewhere along the Ecliptic, and the planets are never far from it.
fr: Faites un zoom arrière jusqu'à ce que vous apercevez une courbe verte ; cette courbe représente votre <link linkend="ai-horizon">horizon</link> local. Si vous n'avez pas modifié la configuration par défaut de &kstars;, l'image sous l'horizon devrait être complètement verte, ce qui représente le sol terrestre. Vous apercevrez aussi une courbe blanche qui représente <link linkend="ai-cequator">l'équateur céleste</link> et une courbe marron, qui représente <link linkend="ai-ecliptic">l'écliptique</link>, c'est-à-dire la position que le Soleil semble suivre dans le ciel au cours d'une année. Le Soleil se trouve toujours quelque part le long de l'écliptique et les planètes n'en sont jamais bien loin.

source: You can configure &kstars; to draw or not the celestial equator and Ecliptic curves on the Sky Map using the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem></menuchoice> menu item. Select the <guimenu>Guides</guimenu> page and check/uncheck the <guilabel>Celestial equator</guilabel> and <guilabel>Ecliptic</guilabel> check boxes. You can also configure which colors &kstars; uses for drawing these curves, using the <guimenu>Colors</guimenu> page.
fr: Vous pouvez configurer &kstars; pour dessiner ou non l'équateur céleste et la courbe de l'écliptique sur la carte du ciel en utilisant <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Configurer &kstars;…</guimenuitem></menuchoice>. Sélectionnez la page <guimenu>Guides</guimenu> et cochez ou décochez <guilabel>Équateur céleste</guilabel> et <guilabel>Écliptique</guilabel>. Vous pouvez aussi choisir les couleurs utilisées par &kstars; pour dessiner ces courbes dans la page <guimenu>Couleurs</guimenu>.

source: Here is a screenshot of the &kstars; main window, focusing on horizon, celestial equator and Ecliptic curves:
fr: Voici une capture d'écran contenant la fenêtre principale de &kstars; en mettant l'accent sur l'horizon, l'équateur céleste et la courbe de l'écliptique :

source: &kstars; Window
fr: Fenêtre de &kstars;

source: <title>Objects in the Sky</title>
fr: <title>Objets célestes</title>

source: <primary>Objects in the Sky</primary>
fr: <primary>Objets célestes</primary>

source: Overview
fr: Survol

source: &kstars; displays thousands of celestial objects: stars, planets, comets, asteroids, clusters, nebulae and galaxies. You can interact with displayed objects to perform actions on them or obtain more information about them. Clicking on an object will identify it in the status bar, and simply hovering the mouse cursor on an object will label it temporarily in the map. Double-clicking will recenter the display on the object and begin tracking it (so that it will remain centered as time passes). <mousebutton>Right</mousebutton> clicking an object opens the object's popup menu, which provides more options.
fr: &kstars; affiche des milliers d'objets célestes : étoiles, planètes, comètes, astéroïdes, amas, nébuleuses et galaxies. Vous pouvez interagir avec les objets affichés et réaliser des actions sur eux ou obtenir plus d'informations à leur propos. En cliquant sur un objet, il s'identifie dans la barre d'état, et simplement en le survolant avec la souris, un libellé s'affichera temporairement sur la carte. En double-cliquant, l'affichage se recentrera sur l'objet et commencera un suivi (de telle manière qu'il restera centré quand le temps s'écoulera). Un clic du bouton <mousebutton>droit</mousebutton> sur un objet fera apparaître un menu contextuel qui proposera d'autres options.

source: The Popup Menu
fr: Le menu contextuel

source: <primary>Popup Menu</primary>
fr: <primary>Menu contextuel</primary>

source: Example
fr: Exemple

source: Here is an example of the <mousebutton>right</mousebutton> click popup menu, for the Uranus:
fr: Voici un exemple de menu contextuel obtenu d'un clic <mousebutton>droit</mousebutton> sur nébuleuse de Mairan ou M43 ou encore NGC 1982 :

source: <screeninfo>Popup Menu for Uranus</screeninfo>
fr: <screeninfo>Menu contextuel pour Uranus</screeninfo>

source: <phrase>Popup Menu for Uranus</phrase>
fr: <phrase>Menu contextuel pour Uranus</phrase>

source: The appearance of the popup menu depends somewhat on the kind of object you <mousebutton>right</mousebutton>-click on, but the basic structure is listed below. You can get <link linkend="popup-menu">more detailed information about the popup menu</link>.
fr: L'apparence du menu contextuel dépend du type d'objet sur lequel vous cliquez avec le bouton <mousebutton>droit</mousebutton>, mais la structure de base est expliquée ci-dessous. Vous pouvez obtenir <link linkend="popup-menu">plus d'informations détaillées sur le menu contextuel</link>.

source: The top section contains some lines of information which are not selectable: the object's names ("Uranus"), object type ("Solar system object"), and the constellation which contains the object ("Pisces"). The next three lines show the object's rise, set, and transit times. If the rise and set times say "circumpolar", it means that the object is always above the horizon for the present location.
fr: La section supérieure contient certaines lignes d'information que l'on ne peut pas sélectionner : le nom de l'objet (la nébuleuse de Mairan ou M43), son type (nébuleuse gazeuse) et la constellation qui contient l'objet (Orion). Les trois lignes suivantes affichent l'heure du lever, du coucher et les heures de transit. Si les heures de lever et de coucher indiquent <quote>circumpolaire</quote>, cela signifie que l'objet est toujours au-dessus de l'horizon pour la position actuelle.

source: The middle section contains actions which can be performed on the selected object, such as <guimenuitem>Center &amp; Track</guimenuitem>, <guimenuitem>Details</guimenuitem>, and <guimenuitem>Attach Label</guimenuitem>. See the <link linkend="popup-menu">popup menu description</link> for a full list and description of each action.
fr: La section centrale contient des actions qui peuvent être effectuées sur l'objet sélectionné, comme <guimenuitem>Centrer et Suivre</guimenuitem>, <guimenuitem>Détails</guimenuitem> et <guimenuitem>Attacher une étiquette</guimenuitem>. Consultez la <link linkend="popup-menu">description du menu contextuel</link> pour obtenir une liste complète et la description de chaque action.

source: Internet Links
fr: Liens internet

source: <seealso>Popup Menu</seealso>
fr: <seealso>Menu contextuel</seealso>

source: The bottom section contains links to images and/or informative webpages about the selected object. If you know of an additional &URL; with information or an image of the object, you can add a custom link to the object's popup menu. Use the <guimenuitem>Details</guimenuitem> item in the popup menu to open the <guilabel>Object Details</guilabel> dialog. On the <guilabel>Links</guilabel> tab use the <guibutton>Add Link...</guibutton> button.
fr: La section inférieure contient des liens vers des images et/ou des pages web contenant de l'information sur l'objet sélectionné. Si vous avez connaissance d'une &URL; supplémentaire présentant des informations ou une image de l'objet, vous pouvez ajouter un lien personnalisé au menu contextuel de l'objet. Utilisez l'élément <guimenuitem>Détails</guimenuitem> dans le menu contextuel pour ouvrir la boîte de dialogue <guilabel>Détails de l'objet</guilabel>. Sur l'onglet <guilabel>Liens</guilabel>, choisissez l'élément <guibutton>Ajouter un lien…</guibutton>.

source: Finding Objects
fr: Trouver des objets

source: Find Object Tool
fr: Outil de recherche d'objets

source: Finding by Name
fr: Recherche par nom

source: You can search for named objects using the <guilabel>Find Object</guilabel> tool, which can be opened by clicking on the <guiicon>search</guiicon> icon in the toolbar, by selecting <menuchoice><guimenu>Pointing</guimenu> <guimenuitem>Find Object...</guimenuitem></menuchoice> menu item, or by pressing <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>. The <guilabel>Find Object</guilabel> window is shown below:
fr: Vous pouvez chercher des objets en utilisant l'outil <guilabel>Chercher l'objet</guilabel>, que vous pouvez ouvrir en cliquant sur l'icône <guiicon>Recherche d'objet</guiicon> dans la barre d'outils, en sélectionnant le menu <menuchoice><guimenu>Pointage</guimenu> <guimenuitem>Chercher un objet…</guimenuitem></menuchoice> ou en actionnant <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo>. La fenêtre <guilabel>Chercher un objet</guilabel> est affichée ci-dessous :

source: <screeninfo>Find Object Window with search online feature</screeninfo>
fr: <screeninfo>Fenêtre de recherche d'objets avec fonctionnalité de recherche en ligne</screeninfo>

source: <phrase>Find Object Window with search online feature</phrase>
fr: <phrase>Fenêtre de recherche d'objets avec fonctionnalité de recherche en ligne</phrase>

source: The window contains a list of (almost, see <xref linkend="catalogs"/>) all the named objects that &kstars; is aware of. Many of the objects only have a numeric catalog name (for example, NGC 3077), but some objects have a common name as well (for example, Whirlpool Galaxy). You can filter the list by name and by object type. To filter by name, enter a string in the edit box at the top of the window; the list will then only contain names which start with that string. To filter by type, select a type from the combo box at the bottom of the window.
fr: La fenêtre contient la liste de (presque, voire <xref linkend="catalogs"/>) tous les objets dans &kstars; qui ont un nom. Beaucoup d'entre eux possèdent une dénomination seulement dans un catalogue (par exemple NGC 3077), et certains possèdent aussi un nom propre (la galaxie du Tourbillon). Vous pouvez filtrer la liste selon le nom ou le type d'objet. Pour filtrer par nom, saisissez une chaîne dans la zone de texte en haut de la fenêtre ; la liste ne contiendra alors que les noms qui commencent par cette chaîne. Pour filtrer par type, sélectionnez un type dans la liste déroulante combinée en bas de la fenêtre.

source: &kstars; provides another method for resolving the objects that are missing from any of its predefined catalogues, by using an internet connection. Thus, if you want to find an object that &kstars; is not aware of, you can easily do this by querying several professional astronomical databases as: SIMBAD, NED or VizieR. This can be done by entering the object's name and then press the <guibutton>or search the internet for <replaceable>ObjectName</replaceable></guibutton> button. After your object is found, you can use it exactly as any object that is already loaded into &kstars; (&ie; adding it to the Observing WishList). If the object was not found in the online databases, then a warning dialogue will pop-up. Once you resolve an object by using this method, it is stored in &kstars; database, so if you close &kstars; and open it again, your object will still be there.
fr: &kstars; fournit une autre méthode pour résoudre les objets qui sont absents des catalogues prédéfinis, qui est d'utiliser une recherche en ligne. Ainsi, si vous souhaitez trouver un objet que &kstars; ne connaît pas, vous pouvez le faire facilement en questionnant plusieurs bases de données astronomiques comme SIMBAD, NED ou encore VizieR. Cela peut être fait en indiquant le nom de l'objet et ensuite en cliquant sur le bouton <guibutton>Chercher <replaceable>ObjectName</replaceable> sur Internet</guibutton>. Une fois l'objet trouvé, vous pouvez l'utiliser de la même manière que n'importe quel autre objet déjà chargé dans &kstars; (c'est-à-dire l'ajouter dans votre liste de souhaits). Si l'objet n'a pas été trouvé dans les bases de données en ligne, un message d'avertissement apparaîtra. Une fois qu'un objet a été trouvé par cette méthode, il sera ajouté à la base de données de &kstars; pour pouvoir être utilisé ultérieurement.
