Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: To know whether the device driver supports backlash, check the <guilabel>Driver Backlash</guilabel> field. If it is enabled and you can set values then the driver supports Backlash. If the field is disabled then the driver does not support Backlash.
fr: Vous pouvez vérifier si le pilote gère la compensation dans le champ <guibutton>pilote du jeu du périphérique</guibutton>. S'il est activé et que vous pouvez modifier les valeurs, cela signifie que le pilote le gère. S'il est désactivé, il ne le gère pas.

source: <emphasis role="bold">AF Overscan</emphasis>: The Focus module can manage Backlash itself by over scanning outward motions by the value in the <guilabel>AF Overscan</guilabel> field. For example, if <guilabel>AF Overscan</guilabel> is set to 40 then whenever Focus moves the focuser outwards, it does this as a 2-step process. Firstly it moves the focuser 40 ticks past where it wants to end up; secondly it moves back in by 40 ticks.
fr: <emphasis role="bold">Balayage de mise au point automatique</emphasis> : le module de mise au point peut gérer le jeu lui-même en scannant les mouvements extérieurs de la valeur trouvée dans le champ <guibutton>Balayage de mise au point automatique</guibutton>. Par exemple, s'il est réglé à 40, à chaque fois que le moteur se déplace vers l'extérieur, il le fait par un processus à deux étapes. Il commence par dépasser de 40 pas la position calculée finale ; ensuite il recule de 40 pas.

source: The advantage of <guilabel>AF Overscan</guilabel> is that you do not need to know Backlash exactly, you just need to set the <guilabel>AF Overscan</guilabel> &gt;= backlash. So, for example, if you measure backlash as around 60 ticks then you could set <guilabel>AF Overscan</guilabel> to 80.
fr: L'avantage de <guilabel>Balayage de mise au point automatique</guilabel> est qu'il n'est pas nécessaire de connaître le jeu exactement, il suffit de le régler à une valeur supérieure ou égale au jeu. Ainsi par exemple, si vous mesurez un jeu de 60 pas, vous devriez le régler à 80.

source: <guilabel>AF Overscan</guilabel> is also useful where Backlash is not exactly predictable. For example, if Backlash measurements yield slightly different values, e.g. 61, 60, 59 ticks then by using <guilabel>AF Overscan</guilabel> this inconsistency can be effectively neutralised. Were you to use <guilabel>Focuser Backlash</guilabel> you would probably average the readings and set the value to 60. Sometimes this will correctly take up all the backlash; sometimes it will be a little short; and sometimes it will over correct.
fr: <guilabel>Balayage de mise au point automatique</guilabel> est également utile lorsque le jeu n'est pas exactement prévisible. Par exemple si l'on obtient de valeurs légèrement différentes, p. ex. 61, 60, 59 pas en utilisant cette fonctionnalité, cette inconstance peut être neutralisée. Si vous aviez utilisé <guilabel>Jeu du moteur de mise au point</guilabel>, vous auriez probablement fait une moyenne et réglez la valeur à 60. Parfois ce sera correct, parfois ce sera un peu court et parfois cela corrigera trop.

source: All focuser movements managed by Focus will have <guilabel>AF Overscan</guilabel> applied, including Step Out, Goto, Autofocus runs, Adaptive Focus movements, Adapt Start Pos movements and Take flats at the same position as lights.
fr: Tous les mouvements du moteur gérés par le module de mise au point auront le <guilabel>Balayage de mise au point</guilabel> appliqué, ce qui inclus le mouvement extérieur, la fonction Goto, les processus de mise au point automatique, les mouvements d'adaptation de la position initiale et l'acquisition de flats à la même position que les brutes.

source: <title>Adaptive Focus</title>
fr: <title>Mise au point adaptative</title>

source: <screeninfo>Adaptive Focus</screeninfo>
fr: <screeninfo>Mise au point adaptative</screeninfo>

source: <phrase>Adaptive Focus</phrase>
fr: <phrase>Mise au point adaptative</phrase>

source: Ekos supports the concept of Adaptive Focus (AF). Without AF, a typical imaging plan would start with an Autofocus run then a sequence of subframes, then an Autofocus run, etc. The Autofocus runs would be triggered by a number of factors such as time, filter change, temperature change, etc. So basically as a sequence runs subframes are being taken slightly away from optimum focus until a threshold (e.g. temperature change) triggers an Autofocus run.
fr: Ekos prend en charge le concept de mise au point adaptative (MaPA). Sans MaPA, une session typique d'imagerie débuterait avec une mise au point automatique, puis une séquence de poses, puis une autre mise au point automatique, etc. Les mises au point automatiques sont déclenchées par plusieurs facteurs tels que l'heure, un changement de filtre, un changement de température, etc. Ainsi, essentiellement, une séquence lance la prise de poses qui sont légèrement hors de la position optimale de mise au point jusqu'à ce que l'un de ces facteurs déclenchent une mise au point automatique.

source: The idea of AF is to adjust focus as environmental factors change to try to take each subframe as close as possible to optimum focus. Ideally, the effect of Adaptive Focus is like performing an Autofocus run before each subframe but without the overhead of actually doing the run.
fr: L'idée derrière la mise au point adaptative est d'ajuster la mise au point en tenant compte des changements de facteurs environnementaux pour essayer de prendre des poses le plus près possible de la position optimale. L'effet est similaire à une mise au point automatique mais sans la charge de la faire vraiment.

source: AF works as a complement to the various triggers for Autofocus that are available in Ekos now. So it is not necessary to change the Autofocus triggers when starting to use AF. Indeed, at the start, it is not recommended to relax Autofocus conditions when using AF. However, over time, as confidence grows in AF it would be possible to do less Autofocusing (and therefore more imaging). But either way, each subframe should be more in focus when using AF, providing it is setup correctly.
fr: La MaPA est complémentaire aux différents déclencheurs de mise au point automatique qui sont disponibles dans Ekos. Il est ainsi inutile de les modifier pour utiliser la MaPA. D'ailleurs il n'est pas recommandé d'assouplir les conditions de mise au point automatique quand on veut utiliser la MaPA. Toutefois, au fil du temps et de la confiance grandissante en cette méthode, il sera possible de faire moins de mise au point automatique (et ainsi plus d'imagerie). Quoiqu'il en soit, chaque image devrait être plus nette en utilisant la MaPA si la configuration est correcte.

source: So how do you know if AF would be useful for your setup or not? Perhaps the simplest way would be to examine subframes just after an Autofocus and compare them with subframes just before the next Autofocus. Can you see a difference in focus? If you have a setup where the focus point is tolerant of environmental changes between Autofocus runs then AF may not add anything to your images; if however you have a setup that is sensitive to environmental changes and the frequency of Autofocus runs is a compromise between quality and imaging time then AF ought to improve the quality of your subframes.
fr: Mais comment savoir si la MaPA est utile avec son équipement ? Peut-être que la méthode la plus simple est d'étudier les images prises juste après une mise au point automatique et de les comparer avec des images prises juste avant la prochaine mise au point automatique. Pouvez-vous voir une différence de netteté ? Si vous possédez un équipement dont le point focal est tolérant aux changements environnementaux entre des mises au point automatiques, alors la MaPA ne va probablement rien vous apporter de substantiel ; dans le cas contraire où la fréquence de mise au point automatique est un compromis entre la qualité des images et le temps d'imagerie, alors il se peut bien que la MaPA va améliorer la qualité des images.

source: AF currently supports two environmental dimensions: Temperature and Altitude (of the imaged target):
fr: La MaPA permet actuellement de prendre en compte deux variables environnementales : la température et l'altitude de la cible :

source: Temperature. All the components of the imaging system will be affected by changes in ambient temperature. The most obvious will be the telescope tube. Typically this will expand as temperature increases and contract as it decreases. This will affect the focus point. But also the optical path the light from the imaged target takes through the atmosphere and through the imaging components of the telescope will be affected by temperature and therefore will affect the focus point.
fr: Température. Tous les composants du système d'imagerie seront touchés par un changement de la température ambiante. Le plus évident concerne le tube du télescope. Il va se dilater avec une augmentation de température et se contracter avec une diminution, ce qui va modifier la position du point focal. Mais l'atmosphère traversée entre la cible et les composants du télescope seront également modifiés et impacteront la position du point focal.

source: It is necessary to have a reliable source of temperature information available to the focus module in order to use the temperature feature of AF.
fr: Il est essentiel d'avoir une bonne source de température disponible pour le module de mise au point afin d'utiliser la fonctionnalité de température de MaPA.

source: Where the temperature source is located is, of course, up to the user. Given the changes in temperature effect many components it is not obvious where the best location would be. Some experimentation may be required to get the best results but as a guide, the source should be near the imaging train but not near any heating effect of electrical equipment that would say, heat the temperature source but not the optical train. Consistency of location is likely to be important.
fr: La position de la source de température est laissée au choix de l'opérateur. Mais comme le changement de température a un effet sur plusieurs composants, il n'est de loin pas évident de trouver le meilleur endroit. Il peut s'avérer utile de tester plusieurs endroits pour trouver le meilleur, mais l'idée est de positionner la sonde de température plutôt près du train optique et surtout pas près d'un équipement électronique qui chaufferait la sonde mais pas le tube du télescope. La constance de la position est également importante.

source: Altitude. Some users have reported that the focus point changes with the altitude of the target. This effect is likely to be smaller than the temperature effect and may be negligible for some setups.
fr: Altitude. Quelques opérateurs rapportent que la position du point focal dépend de l'altitude de la cible. Cet effet est vraisemblablement plus ténu que l'effet dû au changement de température et peut, dans certains cas, être négligé.

source: To use AF you need to work out firstly whether you want to adapt for Temperature, Altitude or both. If you are new to AF it is recommended to start with Temperature and once you have that working, determine whether your setup would benefit from adding Altitude.
fr: Pour utiliser la MaPA, vous devez d'abord choisir si vous souhaitez une adaptation par rapport à la température, l'altitude ou les deux. Si vous débutez avec la MaPA, il est recommandé de commencer avec la température et une fois que ça fonctionne, déterminer si votre équipement bénéficierait d'utiliser l'altitude également.

source: The first step is to workout the <guilabel>Ticks / °C</guilabel> and/or <guilabel>Ticks / °Alt</guilabel> for your equipment. To do this there is an existing utility in Ekos whereby when Focus logging is enabled, in addition to adding focus messages to the debug log, every time an Autofocus run completes, information is written to a text file in a directory called focuslogs located in the same place as the debug logs directory. The files are called “autofocus-(datetime).txt”. The data written are: date, time, position, temperature, filter, HFR, altitude. This data will need to be analysed outside of Ekos to determine the <guilabel>Ticks / °C</guilabel> and if required the <guilabel>Ticks / °Alt</guilabel>.
fr: La première étape est de déterminer les valeurs de <guilabel>Pas / °C</guilabel> et/ou <guilabel>Pas / °Alt</guilabel> de votre équipement. Pour ce faire il existe un utilitaire dans Ekos qui permet d'enregistrer les données de mises au point et les messages liés pour chaque processus de mise au point automatique. Cette information est écrite dans un fichier texte qui se trouve dans un dossier nommé focuslogs au même emplacement que le dossier des fichiers journaux de débogage. Ces fichiers sont nommés autofocus-(datetime).txt. Les données écrites sont la date, l'heure, la position, la température, le filtre, le HFR et l'altitude. Ces données devront être analysées séparément de Ekos afin de déterminer la valeur de <guilabel>Pas / °C</guilabel> et si requis celle de <guilabel>Pas / °Alt</guilabel>.

source: Here is an example of a “autofocus-(datetime).txt” file:
fr: Voici un exemple d'un fichier autofocus-(datetime).txt :

source: <screeninfo>Focus Autofocus Log</screeninfo>
fr: <screeninfo>Fichier journal de mise au point automatique</screeninfo>

source: <phrase>Focus Autofocus Log</phrase>
fr: <phrase>Fichier journal de mise au point automatique</phrase>

source: Currently Ekos supports a simple linear relationship between temperature, or altitude, and ticks. In the future, if there is demand, more sophisticated relationships could be supported. A linear relationship will deliver the majority of the benefit of AF and is fairly straight-forward to administer. More complex relationships could be more accurate but come with more complex administration. Note also that more complex focus point vs temperature relationships will likely be more or less linear for small changes in temperature.
fr: Actuellement Ekos utilise une simple relation linéaire entre la température ou l'altitude et le nombre de pas. Dans le futur et s'il y a de la demande, on pourrait voir des relations plus sophistiquées. Une relation linéaire fournit la majeure partie des bénéfices de la MaPA et est facile à utiliser. Il existe des relations bien plus complexes qui fournissent des résultats plus précis mais sont bien moins faciles à utiliser. Veuillez noter que les relations plus complexes entre la position de mise au point et la température se comportent de manière plus ou moins linéaire pour les petits changements de température.

source: A way to get a value for <guilabel>Ticks / °C</guilabel> would be to take the data from the autofocus-(datetime).txt files from a few nights of observing into a spreadsheet and graph focus position against temperature for each filter. Review the data and remove any outliers and plot a line of best fit. Use the line to get <guilabel>Ticks / °C</guilabel>. If you intend to adapt for altitude as well as temperature, then it would be better to use a set of data at similar altitude when calibrating temperature. Then it's possible to calculate the effect of Temperature and remove this from the data when calculating the effect of Altitude.
fr: Une manière d'obtenir ces valeurs est de saisir ces données prises sur plusieurs nuits dans un tableur et de dessiner le graphique de la position de mise au point en fonction de la température et cela pour chaque filtre. Passez en revue les données et éliminez les valeurs aberrantes puis faites une régression linéaire sur ces données. Elle vous donnera la valeur de <guilabel>Pas / °C</guilabel>. Si votre intention est de faire pareil pour l'altitude, il sera probablement plus efficace d'utiliser un ensemble de données d'altitudes similaires pour la calibration de la température. Il sera ainsi possible de calculer l'effet dû à la température et de la soustraire des données pour le calcul de l'effet dû à l'altitude.

source: You will need to ensure that your focus position is repeatable at the same temperature and altitude and that there is no slipping of the focuser or uncompensated backlash. In addition, when calibrating it is better to avoid changing the optical train in a way that could change the focus position. If this is unavoidable and if the change affected the focus position then you will need to appropriately adjust the historical focus data so they can be compared.
fr: Vous devrez vous assurer que la position de mise au point est reproductible pour une même température et altitude et qu'il n'y a pas de glissement du moteur de mise au point et de jeu non compensé. De plus, pour la calibration, il est préférable d'éviter de changer de train optique qui pourrait modifier la position de mise au point. Si cela n'est pas évitable et le changement a un effet sur la position de mise au point, il faudra ajuster de manière appropriée les données de mise au point afin qu'elles puissent être comparables.

source: A simple approach is to start with a small amount of data, say 1 night and use this to calculate, say the Ticks / degree C. Run with this and adjust it over time as you collect more data. A way to check how well AF is performing would be to use Analyze to review how AF had moved the focus over 1 hour. If things are spot on, then where ever AF had positioned the focuser after 1 hour would match the Autofocus result. Where there is a discrepancy, it will be because of randomness in the Autofocus result and miscalibration in the AF <guilabel>Ticks / °C</guilabel>. By doing this regularly you will build knowledge of your equipment and be able to fine tune AF. Below is a screenshot of Analyze configured for Focus where you can see how Focus position changes throughout the imaging session:
fr: Une approche simple est de commencer avec peu de données, disons une nuit, et les utiliser pour calculer la valeur de <guilabel>Pas / °C</guilabel>. Ensuite utilisez cette valeur pour vos sessions d'observations et ajustez-là au fur et à mesure que vous accumulez plus de données. Une manière de vérifier si la MaPA se comporte bien est d'utiliser le module Analyse pour étudier comment la MaPA a déplacé la position de mise au point sur une heure. Si tout se passe bien, alors la position de MaPA après une heure doit correspondre au résultat d'une mise au point automatique. S'il y a une différence, elle proviendra d'aléas de la mise au point automatique et d'une mauvaise calibration de la valeur de <guilabel>Pas / °C</guilabel>. En faisant cela régulièrement, vous développerez la connaissance de votre équipement et pourrez affiner la MaPA. Dans la capture d'écran ci-dessous, vous pouvez voir la configuration du module Analyse pour la mise au point et voir comment la position de mise au point change au cours de la session d'imagerie :

source: <screeninfo>Focus Analyze</screeninfo>
fr: <screeninfo>Analyse de la mise au point</screeninfo>

source: <phrase>Focus Analyze</phrase>
fr: <phrase>Analyse de la mise au point</phrase>

source: Once you have your data you can configure it in the <link linkend="focus-filter-settings">Filter Settings</link> popup. Then in Focus, switch on Adaptive Focus in <link linkend="focus-settings">Focus Settings</link>. At this point, when you run a sequence, Ekos will check after each subframe whether it needs to adapt the focuser position. If so, Focus will do that and then Capture will continue with the next Subframe.
fr: Une fois votre valeur obtenue, vous pouvez la configurer dans la fenêtre de dialogue des <link linkend="focus-filter-settings">Réglages de filtres</link>. Ensuite, dans le module de mise au point, activez la MaPA dans l'onglet <link linkend="focus-settings">Réglages de la mise au point</link>. Dès lors que vous exécutez une séquence, Ekos va vérifier après chaque pose si une MaPA est nécessaire pour adapter la position de mise au point. Si c'est le cas, le module de mise au point le fera et ensuite le module d'acquisition poursuivra les poses.

source: The screenshot at the top of this section shows an example. <guilabel>Ticks / °C</guilabel> is set to 9. Autofocus ran and it solved at 36580 at 10C. Then a simple sequence of 5 subframes was run. The temperature was firstly set to 9C then to 8C. After each subframe completed, Ekos performed an adaptive focus run and where there was a temperature change it calculates the number of ticks to move the focuser. In this example, the focuser was moved inward by 9 ticks on 2 separate occasions, starting at 36580, before moving to 36571 and then to 36562 as shown on the Focus Tab in the Current Position widget and in the message box.
fr: La capture d'écran au haut de cette section illustre un exemple. La valeur <guilabel>Pas / °C</guilabel> est réglée à 9. La mise au point automatique a été exécutée et la résolution s'est faite à la position 36580 à la température de 10 °C. Ensuite une simple séquence de 5 poses a été lancée. La température était d'abord réglée à 9 °C puis à 8 °C. À la fin de chaque pose Ekos a réalisé une MaPA et quand il y avait un changement de température, il a calculé le nombre de pas de déplacement du moteur de mise au point. Ici le moteur s'est déplacé vers l'intérieur de 0 pas à deux occasions, commençant à la position 36580, avant de se déplacer à la position 36571 puis 36562 comme montré dans l'onglet de mise au point dans le composant graphique de la position actuelle et dans la boîte de messages.

source: The Adaptive Focus concept has been built into the <link linkend="build-filter-offsets">Build Offsets</link> tool.
fr: Le concept de la mise au point adaptative a été implémenté dans l'outil de <link linkend="build-filter-offsets">Construction des décalages</link>.

source: Coefficient of Determination, R²
fr: Coefficient de détermination R²

source: The Coefficient of Determination, or R², is calculated in order to give a measure of how well the fitted curve matches the datapoints. More information is available <ulink url="https://en.wikipedia.org/wiki/Coefficient_of_determination">here</ulink>. This feature that is available for the Linear 1 Pass focus algorithm. In essence, R² gives a value between 0 and 1, with 1 meaning a perfect fit where all datapoints sit on the curve, and 0 meaning that there is no correlation between the datapoints and the curve. The user should experiment with their equipment to see what values they can obtain, but as a guide, a value above, say 0.9 would be a good fit.
fr: Le coefficient de détermination, ou R², est un indicateur utilisé pour juger de la qualité de la régression. Davantage d'information est disponible <ulink url="https://fr.wikipedia.org/wiki/Coefficient_de_d%C3%A9termination">ici</ulink>. Cette fonctionnalité est disponible pour l'algorithme linéaire à 1 passe. En substance, ce coefficient R² est un nombre entre 0 et 1, avec 1 signifiant que tous les points se trouvent sur la courbe et 0 signifiant qu'il n'y a pas de corrélation entre les points et la courbe. L'utilisateur devrait expérimenter avec son matériel pour sentir quelle valeur peut être obtenue, mais toute valeur au-dessus d'environ 0,9 traduit une bonne régression.

source: There is an option to set an “R² Limit” in <link linkend="focus-settings">Focus Settings</link> that is compared to the calculated R² after the auto focus run has completed. If the limit value has not been achieved, then the auto focus is rerun.
fr: Il y a une option pour régler la « limite R² » dans les <link linkend="focus-settings">réglages de mise au point</link> qui est comparée au R² calculé après le processus de mise au point. Si cette limite n'a pas été atteinte, le processus est relancé.
