Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: In order to use this feature it is necessary to work out the relative focus position between all filters that you wish to use this functionality for. For example, if Lum and Red have the same focus position (they are parfocal) but Green focuses 300 ticks further out than Lum (or Red) then setup Offsets for Lum, Red and Green as 0, 0, 300 as shown above. If a sequence is created to take 10 subframes of Lum, then 10 Red, then 10 Green, then at the start, since Lum has <guilabel>Auto Focus</guilabel> checked, an Autofocus will be run on Lum and the 10 subs taken. Capture will then switch filters to Red. Since Red has <guilabel>Auto Focus</guilabel> unchecked no Autofocus will happen and Ekos will look to the Offsets between Red and Lum. In this case 0 - 0 = 0. So the focuser will not be moved and Capture will take 10 subs of Red. Then Capture will swap from Red to Green. Again, Green has <guilabel>Auto Focus</guilabel> unchecked no Autofocus will happen and Ekos will look to the Offsets between Green and Red. In this case 300 - 0 = 300. So Focus will adjust the focus position by +300 (move the focuser out by 300 ticks). Capture will then take the 10 Green subs.
fr: Pour utiliser cette fonctionnalité, il est nécessaire de déterminer les positions relatives de mise au point entre chaque filtre que vous souhaitez utiliser. Par exemple si les filtres de luminance et rouge ont la même position de mise au point (ils sont parfocales) mais que la position de mise au point du filtre vert se trouve 300 pas plus loin que le filtre de luminance (ou rouge), alors les décalages seront respectivement de 0, 0 et 300. Si une séquence est créée pour prendre 10 poses de luminance, puis 10 de rouge et 10 de vert, alors au départ (puisque <guilabel>Mise au point automatique</guilabel> est cochée) sera exécutée une mise au point automatique avec le filtre de luminance et ensuite 10 poses seront prises. Le module Acquisition changera ensuite de filtre pour le rouge. Comme ce filtre n'a pas la case <guilabel>Mise au point automatique</guilabel> cochée, il n'y aura pas de mise au point automatique et Ekos va vérifier le décalage entre le rouge et la luminance. Dans ce cas, on aura 0 - 0 = 0. Par conséquent le moteur de mise au point ne se déplacera pas et 10 poses de rouge seront prises. Puis le filtre passera du rouge au vert. Comme l'option n'est pas non plus cochée, il n'y aura pas de mise au point automatique et Ekos vérifiera le décalage entre le vert et le rouge. Maintenant, 300 - 0 = 300. Le moteur de mise au point se déplacera de 300 pas vers l'extérieur et 10 poses de vert seront prises.

source: To use a filter in this way, uncheck <guilabel>Auto Focus</guilabel> and make sure that the Offsets for this filter and all other filters that can precede this filter in a sequence are set.
fr: Pour utiliser un filtre de cette manière, décochez <guilabel>Mise au point</guilabel> et veillez à ce que les décalages de tous les filtres de la séquence sont bien réglés.

source: The Offsets can either be worked out by running Autofocus with different filters and manually calculating the relative offsets and entering them into the table or by using the <link linkend="build-filter-offsets">Build Offsets</link> tool.
fr: Les décalages peuvent être soit déterminés en exécutant la procédure de mise au point automatique avec différents filtres et en calculant manuellement les décalages relatifs et en les saisissant dans la table, soit en utilisant l'outil <link linkend="build-filter-offsets">Détermination des décalages</link>.

source: Configure settings for each filter in the table:
fr: Configurer les réglages de chaque filtre dans la table :

source: <guilabel>Filter</guilabel>: Filter Name.
fr: <guilabel>Filtre</guilabel> : nom du filtre

source: <guilabel>Exposure</guilabel>: Set exposure time (in seconds) to be used when performing Autofocus on this filter. By default, it is set to 1 second.
fr: <guilabel>Durée d'exposition</guilabel> : réglage de la durée d'exposition (en secondes) à utiliser lors d'une mise au point automatique avec ce filtre. La valeur par défaut est 1.

source: <guilabel>Offset</guilabel>: Set relative offsets. Ekos will command a focus offset change if there is a difference between the current and target filter offsets. For example, given the values in the example image, if the current filter is set to <emphasis>Red</emphasis> and next filter is <emphasis>Green</emphasis>, then Ekos shall command the focuser to Focus In by +300 ticks. Relative positive focus offsets denote Focus Out while negative values denote Focus In.
fr: <guilabel>Décalage</guilabel> : réglage des décalages relatifs. Ekos modifiera le décalage de position de mise au point s'il y a une différence entre le filtre actuel et le filtre cible. Par exemple et étant donné les valeurs dans l'image d'exemple, si le filtre actuel est <emphasis>Rouge</emphasis> et le prochain filtre est le <emphasis>Vert</emphasis>, alors Ekos indiquera au moteur de mise au point de se déplacer de +300 pas. Les valeurs positives représentent un déplacement vers l'extérieur alors que les négatives représentent pour un déplacement vers l'intérieur.

source: <guilabel>Auto Focus</guilabel>: Check this option to perform AutoFocus whenever the filter is changed to this filter.
fr: <guilabel>Mise au point automatique</guilabel> : cochez cette option pour réaliser une mise au point automatique à chaque changement de filtre.

source: <guilabel>Lock Filter</guilabel>: Set which filter should be set and <emphasis>locked</emphasis> when performing autofocus for this filter. "--" indicates no Lock Filter. It is not allowed to next filters more than 1 deep, i.e. Red cannot be locked to Blue which is itself locked to Green. A filter cannot be locked to itself.
fr: <guilabel>Filtre verrouillé</guilabel> : indique quel filtre devrait être choisi et <emphasis>verrouillé</emphasis> lors d'une mise au point automatique. "--" indique qu'aucun filtre n'est verrouillé. Il n'est pas autorisé de verrouiller plus d'un filtre et un filtre ne peut pas être verrouillé à lui-même.

source: <guilabel>Last AF Solution</guilabel>: The last successful Autofocus position. Under normal operation Ekos will automatically update this field.
fr: <guilabel>Dernière solution de mise au point</guilabel> : la position de la dernière mise au point automatique effectuée avec succès. Ekos actualise ce champ automatiquement.

source: <guilabel>Last AF Temp (°C)</guilabel>: The temperature of the <guilabel>Last AF Solution</guilabel>. Under normal operation Ekos will automatically update this field.
fr: <guilabel>Dernière température de mise au point (°C)</guilabel> : la température de la <guilabel>Dernière solution de mise au point</guilabel>. Ekos actualise ce champ automatiquement.

source: <guilabel>Last AF Alt (°Alt)</guilabel>: The altitude of the <guilabel>Last AF Solution</guilabel>. Under normal operation Ekos will automatically update this field.
fr: <guilabel>Dernière altitude de mise au point (°Alt)</guilabel> : l'altitude de la <guilabel>Dernière solution de mise au point</guilabel>. Ekos actualise ce champ automatiquement.

source: <guilabel>Ticks / °C</guilabel>: The number of ticks to move the focuser when the temperature changes by 1°C. For example, if focus moves out by 5 ticks when temperature increases by 1°C, set this field to 5. If focus moves in by 5 ticks when temperature increases by 1°C, set this field to -5.
fr: <guilabel>Pas / °C</guilabel> : le nombre de pas de déplacement du moteur de mise au point quand la température change de 1°C. Par exemple, s'il doit se déplacer de 5 pas pour une augmentation de 1°C, cette valeur vaudra 5. Si la mise au point se fait vers l'intérieur de 5 pas pour une augmentation de 1°C, ce champ vaudra -5.

source: <guilabel>Ticks / °Alt</guilabel>: The number of ticks to move the focuser when the altitude changes by 1°Alt. For example, if focus moves out by 0.5 tick when altitude increases by 1°Alt, set this field to 0.5. If focus moves in by 0.5 tick when altitude increases by 1°Alt, set this field to -0.5.
fr: <guilabel>Pas / °Alt</guilabel> : le nombre de pas de déplacement du moteur de mise au point quand l'altitude change de 1°. Par exemple, s'il se déplace vers l'extérieur de 0.5 pas quand l'altitude augmente de 1°Alt, cette valeur vaudra 0.5. Si la mise au point se fait vers l'intérieur de 0.5 quand l'altitude augmente de 1°, ce vaudra -0.5

source: <guilabel>Wavelength</guilabel>: The center of the passband of the filter in nanometers. This is used in some Critical Focus Zone (CFZ) calculations in Focus.
fr: <guilabel>Longueur d'onde</guilabel> : le centre de la bande de passage du filtre en nanomètres. Cette grandeur est utilisée dans certains calculs de la CFZ du module de Mise au point.

source: In addition to the data table, the following controls are available at the bottom of the popup:
fr: En supplément de la table de données, les contrôles suivants sont disponibles au bas de la fenêtre :

source: <guilabel>Build Offsets</guilabel>: Press the <guibutton>Build Offsets</guibutton> button to launch the <link linkend="build-filter-offsets">Build Offsets</link> popup.
fr: <guilabel>Construction des décalages</guilabel> : cliquez sur le bouton <guilabel>Construction des décalages</guilabel> pour lancer la boîte de dialogue <link linkend="build-filter-offsets">Construction des décalages</link>.

source: <guilabel>Capture flats at the same focus as lights</guilabel>: When checked, flats will be taken at the <guilabel>Last AF Solution</guilabel> focuser position.
fr: <guilabel>Acquisition des flats à la même mise au point que les brutes</guilabel> : en cochant cette case, les flats seront acquis à la position du moteur de mise au point de la <guilabel>Dernière solution de mise au point automatique</guilabel>.

source: Let's take an example. If we have a capture sequence starting with Lum -> Red -> Green -> Blue -> Sii -> Ha -> Oiii using the setup in the Filter Settings popup:
fr: Prenons un exemple. Si nous avons une séquence d'acquisition débutant avec Lum -> Rouge -> Vert -> Bleu -> Sii -> Ha -> Oiii qui utilise les réglages de la boîte de dialogue des réglages de filtres :

source: Lum: The Lum filter is configured to Autofocus initially so an Autofocus run is performed, then the Lum sequence runs.
fr: Lum : le filtre Lum est configuré pour exécuter une mise au point automatique, ce qui est fait, puis la séquence Lum démarre.

source: Red: The Red filter is not configured for Autofocus and has an Offset of 0. So when the Red sequence starts, there is no Autofocus run and the relative Offset between Lum and Red is 0, so the focuser is not moved.
fr: Rouge : le filtre rouge n'est pas configuré pour exécuter une mise au point automatique et possède un décalage de 0. Ainsi quand la séquence Rouge démarre, il n'y aura pas de mise à jour automatique et comme le décalage vaut 0, le moteur de mise au point ne bougera pas.

source: Green: The Green filter is not configured for Autofocus and has an Offset of 300. So when the Green sequence starts, there is no Autofocus run and the relative Offset between Red and Green is 300 - 0 = +300, so the focuser moves out by 300.
fr: Vert : le filtre vert n'est pas configuré pour exécuter une mise au point automatique et possède un décalage de 300. Ainsi quand la séquence vert démarre, il n'y aura pas de mise au point automatique et comme le décalage relatif entre le Rouge et le Vert vaut 300 - 0 = 300, le moteur se déplacera de 300 pas vers l'extérieur.

source: Blue: The Blue filter is not configured for Autofocus and has an Offset of 0. So when the Blue sequence starts, there is no Autofocus run and the relative Offset between Green and Blue is 0 - 300 = -300, so the focuser moves in by 300.
fr: Bleu : le filtre bleu n'est pas configuré pour exécuter une mise au point automatique et le décalage vaut 0. Ainsi quand la séquence bleu démarre, il n'y aura pas de mise au point automatique et comme le décalage relatif entre le Vert et le Bleu vaut 0 - 300 = -300, le moteur se déplacera de 300 pas vers l'intérieur.

source: Sii: The Sii filter is configured for Autofocus, is locked to Lum and has an Offset of 0. So when the Sii sequence starts, there is an Autofocus run on Lum and the relative Offset between Lum and Sii is 0 - 0 = 0, so the focuser moves to the Lum Autofocus run solution.
fr: Sii : le filtre Sii est configuré pour exécuter une mise au point automatique, est bloqué sur Lum et possède un décalage de 0. Ainsi quand la séquence Sii démarre, il y aura une mise au point automatique sur le filtre Lum et comme le décalage relatif entre Lum et Sii vaut 0 - 0 = 0, le moteur se déplacera vers la position de la solution de la mise au point automatique de Lum.

source: Ha: The Ha filter is configured for Autofocus, is locked to Lum and has an Offset of 100. So when the Ha sequence starts, there is an Autofocus run on Lum and the relative Offset between Lum and Ha is 100 - 0 = +100, so the focuser moves to the Lum Autofocus run solution then out by 100.
fr: Ha : le filtre Ha est configuré pour exécuter une mise au point automatique, est bloqué sur Lum et possède un décalage de 100. Ainsi quand la séquence Ha démarre, il y aura une mise au point automatique sur le filtre Lum et comme le décalage relatif entre Lum et Ha vaut 100 - 0 = 100, le moteur se déplacera vers la position de la solution de la mise au point automatique de Lum, puis se déplacera de 100 pas vers l'extérieur.

source: Oiii: The Oiii filter is configured for Autofocus, is locked to Lum and has an Offset of -100. So when the Oiii sequence starts, there is an Autofocus run on Lum and the relative Offset between Lum and Oiii is -100 - 0 = -100, so the focuser moves to the Lum Autofocus run solution then in by 100.
fr: Oiii : le filtre Oiii est configuré pour exécuter une mise au point automatique, est bloqué sur le filtre Lum et possède un décalage de -100. Ainsi quand la séquence Oiii démarre, il y aura une mise au point automatique sur le filtre Lum et comme le décalage relatif entre Lum et Oiii vaut -100 - 0 = -100, le moteur se déplacera vers la solution de mise au point de Lum, puis se déplacera vers l'intérieur de 100 pas.

source: Build Offsets
fr: Construction des décalages

source: <screeninfo>Build Filter Offsets</screeninfo>
fr: <screeninfo>Construction des décalages des filtres</screeninfo>

source: <phrase>Build Filter Offsets</phrase>
fr: <phrase>Construction des décalages des filtres</phrase>

source: Click the <guilabel>Build Offsets</guilabel> button on the <link linkend="focus-filter-settings">Filter Settings</link> popup to launch the Build Offsets tool. Filter Offsets can either be entered manually into the table in the Filter Settings popup or this tool can be used to assist in creating them.
fr: Cliquez sur le bouton <guilabel>Construction des décalages</guilabel> dans la boîte de dialogue <link linkend="focus-filter-settings">Réglages des filtres</link> pour lancer l'outil de construction des filtres. Les décalages des filtres peuvent être soit saisis manuellement dans la table de la boîte de dialogue des réglages de filtres soit cet outil peut être utilisé comme assistant à leur création.

source: Note: This utility should not be run during an imaging session as it takes exclusive control of the Focus process whilst it is running.
fr: Remarque : cet utilitaire ne devrait pas être exécuté pendant une session d'acquisition car il prend le contrôle exclusif du processus de mise au point pendant son exécution.

source: To start with, configure settings for each filter in the table in the Filter Settings popup and then launch Build Filter Offsets. The popup is launched with a table of data with the following columns.
fr: Pour commencer, configurer les réglages pour chaque filtre dans la table de la boîte de dialogue des réglages de filtres, puis lancer l'outil. La boîte de dialogue apparaît avec une table de filtres avec les colonnes suivantes :

source: <guilabel>Filter</guilabel>: Filter Name. The first filter has an "*" after the filter name, "Lum *" in the above example. This means that Lum is the reference filter against which offsets for other filters will be measured. Double click another Filter Name to make that filter the reference filter.
fr: <guilabel>Filtre</guilabel> : le nom du filtre. Le premier filtre a un « * » après son nom, « Lum * » dans l'exemple ci-dessus. Cela signifie que Lum est le filtre de référence par rapport auquel les décalages pour les autres filtres seront mesurés. Double-cliquez sur un autre nom de filtre pour qu'il devienne le filtre de référence.

source: <guilabel>Offset</guilabel>: The current offset.
fr: <guilabel>Décalage</guilabel> : le décalage actuel.

source: <guilabel>Lock Filter</guilabel>: The current Lock filter.
fr: <guilabel>Verrouiller le filtre</guilabel> : le filtre verrouillé actuel.

source: <guilabel># Focus Runs</guilabel>: The number of focus runs for this filter. The default is 5. To exclude a filter from the process set this field to zero. Note, the reference filter must have at least 1 run.
fr: <guilabel># de passes de mise au point</guilabel> : le nombre de passes de mise au point pour ce filtre. La valeur par défaut est de 5. Pour exclure un filtre de ce processus, mettez 0. Remarque : le filtre de référence doit avoir au moins une passe.

source: When the <guilabel># Focus Runs</guilabel> have been configured press the <guilabel>Run</guilabel> button to start the automated process.
fr: Quand le <guilabel># d'exécution de mise au point</guilabel> a été configuré, cliquez sur le bouton <guilabel>Exécuter</guilabel> pour démarrer le processus.

source: Press the <guilabel>Stop</guilabel> button to stop the process at any time.
fr: Cliquez sur le bouton <guilabel>Arrêter</guilabel> pour arrêter le processus à tout moment.

source: Toggle the <guilabel>Adapt Focus</guilabel> checkbox at any point in the processing to switch between measured Autofocus results and results after Adaptive Focus adjustments have been applied. See the <link linkend="focus-adaptive">Adaptive Focus</link> section for more details on what Adaptive Focus is.
fr: Vous pouvez inverser la case à cocher <guilabel>Mise au point adaptative</guilabel> à tout moment du processus pour basculer entre les résultats de la mise au point automatique et les résultats après que les ajustements de la mise au point adaptative aient été appliqués. Voyez la section de la <link linkend="focus-adaptive">Mise au point adaptative</link> pour davantage d'explications sur cette thématique.

source: Let's take an example where we have 7 filters: Lum, Red, Green, Blue, Sii, Ha and Oiii. The 8th slot in the filter wheel is marked as Blank. The process has completed 5 runs for all filters, 0 for Blank (effectively excluding Blank from the process). In this case 8 extra columns have been created in the table.
fr: Prenons un exemple où nous avons 7 filtres : Lum, Rouge, Vert, Bleu, Sii, Ha et Oiii. La 8e position de la roue à filtre est marquée Vide. Nous avons lancé le processus 5 fois pour tous les filtres et 0 fois pour Vide (ce qui exclut ce filtre du processus). Dans ce cas, 8 colonnes supplémentaires ont été créées dans la table.

source: AF Run 1-5: The maximum <guilabel># Focus Runs</guilabel> selected by the user is 5, so 5 columns have been created, 1 for each AF run solution.
fr: Exécution de la mise au point 1-5 : le maximum de <guilabel># d'exécution de mise au point</guilabel> choisi par l'opérateur est de 5, donc 5 colonnes ont été créées, 1 pour chaque solution de mise au point automatique.

source: Average: The average (mean) of the AF solutions.
fr: Moyenne : la moyenne des solutions des mises au point automatiques.

source: New Offset: The offset calculated from the Lum filter. E.g. for Sii 36731 - 36743 = -12
fr: Nouveau décalage : le décalage calculé pour le filtre Lum, e.g. pour le filtre Sii, il vaut 36731 - 36743 = -12

source: Save: Check to save the offset for this filter when the <guilabel>Save</guilabel> button is pressed. The default is to check these boxes but unchecking allows a value to be ignored whilst saving other filters.
fr: Enregistrer : cochez pour enregistrer le décalage pour ce filtre quand le bouton <guilabel>Enregistrer</guilabel> est cliqué.

source: At this stage, it is recommended to review the AF runs to make sure they are all good. For example, lets assume we are unhappy with the 2nd AF run on Oiii. In this case we could either:
fr: À ce stade il est recommandé de passer en revue les mises au point automatiques pour s'assurer qu'elles sont toutes bonnes. Par exemple faisons l'hypothèse que nous ne sommes pas satisfaits par la 2e mise au point automatique pour le filtre Oiii. Dans ce cas, on pourrait soit :

source: Edit AF Run 2 and set the value to whatever value we want.
fr: Modifier cette 2e passe pour indiquer une valeur attendue.

source: Edit the New Offset column and set the value directly (bypassing the logic to calculate it).
fr: Modifier la colonne du nouveau décalage pour y mettre directement la bonne valeur (en contournant ainsi la logique utilisée pour la calculer).

source: Discard the AF Run 2 by setting the value to 0 (see below). In this case, the Average and New Offset for Oiii is recalculated based on AF Runs 1, 3, 4, 5. In the example below the new Average and New Offsets are calculated and displayed.
fr: Supprimer cette 2e passe en mettant la valeur à 0 (voir ci-dessous). Dans ce cas, la moyenne et le nouveau décalage pour le filtre Oiii seront recalculées basées sur les passes 1, 3, 4 et 5, ce qui est affiché dans l'exemple ci-dessous.

source: After reviewing the results, the user can press:
fr: Après avoir revu les résultats, l'opérateur peut cliquer sur :

source: Save: All filters where the <guilabel>Save</guilabel> checkbox is checked will have the New Offset value saved in Filter Offsets for use during the next imaging session.
fr: Enregistrer : tous les filtres pour lesquels la case <guilabel>Enregistrer</guilabel> est cochée auront la valeur du nouveau décalage enregistrée pour pouvoir être utilisée lors de la prochain session d'imagerie.

source: Close: The Build Filter Offsets tool is closed without saving any data.
fr: Fermer : l'outil de construction de décalage de filtre sera fermé SANS enregistrer les données.

source: If the <guilabel>Adapt Focus</guilabel> box is checked, the AF Runs are updated for Adaptive Focus. See the <link linkend="focus-adaptive">Adaptive Focus</link> section for more details on the theory of Adaptive Focus. The first AF run (in this example AF Run 1 on Lum) is the basis for the Adaptations. So the temperature and altitude of AF Run 1 on Lum is used as the basis for all the other AF Runs and the data is adapted back to what the AF solution would have been, had it been run at the temperature and altitude of AF Run 1 on Lum.
fr: Si la case à cocher <guilabel>Mise au point adaptative</guilabel> a été cochée, les passes de mises au point automatiques sont mises à jour pour la mise au point adaptative. Voyez la section de la <link linkend="focus-adaptive">Mise au point adaptative</link> pour davantage d'explications sur cette thématique. La première passe de mise au point automatique (dans cet exemple, celle sur la Lum) est la base pour les ajustements. Ainsi la température et l'altitude de cette passe forment la base pour toutes les autres passes et les données sont adaptées en retour aux mises au point automatiques suivantes comme si elles avaient eu lieu aux mêmes conditions de température et d'altitude que cette première passe.
