Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-align.po
Languages: fr

source: <title>Align</title>
fr: <title>Alignement</title>

source: Tools
fr: Outils

source: <tertiary>Align</tertiary>
fr: <tertiary>Aligner</tertiary>

source: <screeninfo>Ekos Align Module</screeninfo>
fr: <screeninfo>Module d'alignement d'Ekos</screeninfo>

source: <phrase>Ekos Align Module</phrase>
fr: <phrase>Module d'alignement d'Ekos</phrase>

source: The Ekos Alignment Module enables highly accurate GOTOs and can measure and correct polar alignment errors. This is possible thanks to third-party plate-solving technology. The main plate-solving software used is the StellarSolver package, which itself makes use of the offline (and online) astrometry.net, ASTAP and Watney solvers. Ekos begins by capturing an image of a star field, feeding that image to the chosen solver (e.g. see <ulink url="https://astrometry.net">astrometry.net</ulink>, <ulink url="https://github.com/rlancaste/stellarsolver">StellarSolver</ulink> or <ulink url="https://www.hnsky.org/astap">ASTAP</ulink>), and gets in return the central coordinates (RA, DEC), scale, and orientation of the image. The solver essentially performs pattern recognition against a catalog of millions of stars. Once the coordinates are determined, the true pointing of the telescope is known.
fr: Le module d'alignement d'Ekos permet des GOTO hautement précis et peut mesurer et corriger les erreurs d'alignement polaire. Cela est possible grâce aux technologies tierce de résolution. L'application principale de résolution utilisée est StellarSolver qui utilise elle-même la version hors ligne (et en ligne) de astrometry.net, ASTAP et les résolveurs Watney. Ekos commence par acquérir une image d'un champ d'étoiles qui est ensuite transmise au résolveur choisi (voir p. ex. <ulink url="https://astrometry.net">astrometry.net</ulink>, <ulink url="https://github.com/rlancaste/stellarsolver">StellarSolver</ulink> ou <ulink url="https://www.hnsky.org/astap">ASTAP</ulink>) et obtiendra les coordonnées centrales (AD et DEC), l'échelle et l'orientation de l'image. Le résolveur réalise essentiellement une reconnaissance de motifs à l'aide d'un catalogue de millions d'étoiles. Une fois que ces coordonnées sont déterminées, le vrai pointage du télescope est connu.

source: Often, there is a discrepancy between where the telescope thinks it is looking at and where it is truly pointing. The magnitude of this discrepancy can range from a few arcminutes to a couple of degrees. Ekos can correct the discrepancy by syncing to the new coordinates, and then slewing the mount to the desired target originally requested.
fr: Il y a souvent une différence entre l'endroit où le télescope croit pointer et où il pointe vraiment. L'importance de cette différence peut varier de quelques minutes d'arc à quelques degrés. Ekos peut corriger cette différence en synchronisant aux nouvelles coordonnées et ensuite en pivotant vers la cible demandée à l'origine.

source: Ekos also provides a Polar Alignment Assistant Tool to correct polar alignment errors. It takes three images, slewing between the images, and calculates the offset between the mount axis and polar axis. It feeds back to the user the altitude and azimuth adjustments needed to align these axes. These images are typically taken near the celestial pole (close to Polaris for Northern Hemisphere) but can work well taken from anywhere, usually starting near the meridian and slewing either East or West.
fr: De plus, Ekos fournit un outil d'assistant d'alignement polaire pour corriger les erreurs d'alignement polaire. Il prend trois images, se déplace entre elles et calcule le décalage entre l'axe de la monture et l'axe polaire. Il renvoie ensuite à l'opérateur les ajustements en altitude et en azimut nécessaires pour aligner ces axes. Ces images sont typiquement prises près du pôle céleste (près de l'étoile polaire dans l'hémisphère nord) mais elles peuvent être également prises ailleurs, généralement près du méridien et bougeant vers l'est ou l'ouest.

source: At a minimum, you need a CCD/Webcam and a telescope that supports Slew &amp; Sync commands. Most popular commercial telescope nowadays support such commands.
fr: Vous avez besoin au minimum d'une caméra CCD ou d'une webcam et d'un télescope qui gère les commandes de pointage et de synchronisation. La plupart de télescopes trouvés dans le commerce aujourd'hui gère ces commandes.

source: Typical use
fr: Utilisation typique

source: Using Ekos Alignment Module, aligning your mount using the controller's 1, 2, or 3 star alignment is <emphasis>not</emphasis> strictly necessary, though for some mounts it is recommended to perform a rough 1 or 2 star alignment before using Ekos alignment module. If you are using EQMod, you can start using Ekos alignment module right away. A typical workflow for GOTO alignment involves the following steps:
fr: Avec le module d'alignement d'Ekos, l'alignement de la monture sur une, deux ou trois étoiles avec la commande de la monture n'est <emphasis>pas</emphasis> strictement nécessaire, mais pour certaines montures, il peut être recommandé de réaliser un alignement sommaire sur une ou deux étoiles avant d'utiliser le module d'alignement de Ekos. Mais si vous utiliser « EQMod », vous pouvez commencer d'utiliser tout de suite le module d'alignement. Une marche à suivre typique pour les alignement GOTO implique les étapes suivantes :

source: Start KStars and Ekos and connect to INDI.
fr: Démarrez KStars et Ekos et établir la connexion avec INDI.

source: Unpark your mount from its home position (usually the NCP for equatorial mounts).
fr: Dé-parquez votre monture de sa position initiale (généralement pointée vers le pôle céleste nord pour les montures équatoriales).

source: Slew to a nearby bright star using the slew telescope command in the SkyMap using the <guilabel>Slew the telescope to the mouse-pointer position</guilabel> command.
fr: Pivotez vers une étoile brillante en utilisant la commande de pivotage du télescope de la carte du ciel avec la commande <guilabel>Pivoter le télescope vers la position de la souris</guilabel>.

source: Select <guilabel>Slew to Target</guilabel> in the <guilabel>Solver Action</guilabel> on the Align page.
fr: Sélectionnez <guilabel>Pivoter vers cible</guilabel> pour l'option <guilabel>Action du résolveur</guilabel> du module Alignement.

source: After slew is complete, click <guibutton>Capture &amp; Solve</guibutton> on the Align page.
fr: Après que le pivotage soit terminé, cliquez sur le bouton <guibutton>Acquisition &amp; Résolution</guibutton> du module Alignement.

source: Align will capture an image and try to solve it. If the solver is successful, Ekos will send a sync command to the mount and then slew to the star. The results are displayed in the <guilabel>Solution Results</guilabel> tab along with a bullseye diagram that shows the offset the reported telescope coordinates (&ie; where the telescope <emphasis>thinks</emphasis> it is looking vs. its actual pointing position in the sky as determined by the solver). Align will stop if it is within the desired error tolerance, otherwise it will repeat the Slew/Capture/Solve/Sync process until it is within tolerance.
fr: Le module Alignement procédera à l'acquisition d'une image et essaiera de la résoudre. Si la résolution est un succès, Ekos va se synchroniser et ensuite pivoter vers l'étoile. Les résultats sont affichés dans l'onglet <guilabel>Résultats de la solution</guilabel> ainsi que dans un diagramme qui montre le décalage entre les coordonnées rapportées du télescope (c'est-à-dire où le télescope <emphasis>croit</emphasis> qu'il pointe) et la position actuelle dans le ciel déterminée par le résolveur. L'alignement s'arrêtera s'il se trouve dans la tolérance désirée, sinon la procédure répétera les opérations de pivotage/acquisition/résolution/synchronisation jusqu'à se trouver dans la tolérance désirée.

source: Each time the solver is executed and returns successful results, Ekos can run on the following actions:
fr: Chaque fois que la résolution s'est terminée avec succès, Ekos peut exécuter les actions suivantes :

source: <guilabel>Sync</guilabel>: Syncs the telescope coordinates to the solution coordinates.
fr: <guilabel>Synchroniser</guilabel> : synchronise les coordonnées du télescope avec les coordonnées de la solution.

source: <guilabel>Slew to Target</guilabel>: Syncs the telescope coordinates to the solution coordinates and then slew to the target.
fr: <guilabel>Pivoter vers la cible</guilabel> : synchronise les coordonnées du télescope avec les coordonnées de la solution puis pivote vers la cible.

source: <guilabel>Nothing</guilabel>: Just solve the image and display the solution coordinates.
fr: <guilabel>Rien</guilabel> : résolution de l'image et affichage des coordonnées de la solution.

source: Configure StellarSolver Options
fr: Configuration des options du résolveur

source: <screeninfo>StellarSolver Options</screeninfo>
fr: <screeninfo>Options du résolveur</screeninfo>

source: <phrase>StellarSolver Options</phrase>
fr: <phrase>Options du résolveur</phrase>

source: To use the solvers, you must first configure the StellarSolver options. The above page is displayed when clicking on the <guilabel>Options</guilabel> button on the lower right of the Align page, then selecting the <guilabel>StellarSolver Options</guilabel> tab. Start with the <guilabel>Builtin method for solver</guilabel> <guilabel>Source Extraction method</guilabel> so that each solver uses its preferred star-extraction code. For <guilabel>Solving Method</guilabel> we recommend choosing <guilabel>Internal Solver</guilabel> to use StellarSolver's copy of the Astrometry.net code, or choose <guilabel>Local ASTAP</guilabel> if you prefer that. The online astrometry solver is accurate, but can take a long time to solve because of all the data transfer required. For <guilabel>Options Profile</guilabel>, start with the <guilabel>1-Default</guilabel> profile.
fr: Pour utiliser les résolveurs, il faut d'abord configurer les options de StellarSolver. La page ci-dessus est affichée en cliquant sur le bouton <guilabel>Options</guilabel> situé en bas à droite du module Alignement, puis en sélectionnant l'onglet <guilabel>Options de StellarSolver</guilabel>. Commencez avec la méthode interne du résolveur nommé <guilabel>Méthode d'extraction des sources</guilabel> afin que chaque résolveur puisse utiliser son code préféré d'extraction d'étoiles. Pour <guilabel>Méthode d'extraction</guilabel>, nous recommandons de choisir <guilabel>Résolveur internet</guilabel> pour utiliser le code de Astrometry.net dédié à StellarSolver ou choisissez <guilabel>ASTAP local</guilabel> si vous préférez utiliser cela. Le résolveur en ligne est précis mais prend du temps puisqu'il faut télécharger toutes les données. Pour <guilabel>Options du profil</guilabel>, démarrez avec le profil <guilabel>1-Défaut</guilabel>.

source: There are two other minor options. <guilabel>WCS</guilabel> or World-Coordinate-System is a system for embedding equatorial coordinate information within the image. When you view a solved image, you can hover it and view the coordinate for each pixel. You can also click anywhere in the image and command to the telescope to slew there. It is highly recommended to keep this option on. <guilabel>Overlay</guilabel> overlays captured images unto the sky map of &kstars;.
fr: Il existe deux autres options mineures. <guilabel>WCS</guilabel> : le système de coordonnées mondiales (World-Coordinate-System) est un mécanisme permettant d'intégrer les coordonnées équatoriales à une image. Ainsi, lors de l'affichage d'une image, un survol affiche les coordonnées de chaque pixel. Vous pouvez également cliquer n'importe où dans l'image et ordonner au télescope de pivoter vers ce point. Il est hautement recommandé de conserver cette option activée. L'option <guilabel>Superposition</guilabel> permet de superposer les images acquises sur la carte du ciel de &kstars;.

source: Configure StellarSolver External Programs
fr: Configuration des programmes externes de StellarSolver

source: <screeninfo>StellarSolver External Programs</screeninfo>
fr: <screeninfo>Programmes externes de StellarSolver</screeninfo>

source: <phrase>StellarSolver External Programs</phrase>
fr: <phrase>Programmes externes de StellarSolver</phrase>

source: This is only required if you choose one of the external programs for your <guilabel>Solving Method</guilabel>. If you choose <guilabel>Internal Solver</guilabel>, then it is not necessary.
fr: Cela n'est obligatoire que si vous choisissez des programmes externes pour votre <guilabel>Méthode de résolution</guilabel>. Si vous choisissez <guilabel>Résolveur interne</guilabel>, cela n'est pas nécessaire.

source: You will need to make sure the paths are correct for the solver you choose. The top menu item <guilabel>select to load one of the default sets</guilabel> usually configures the boxes correctly.
fr: Il faudra vous assurer que les chemins sont corrects pour le résolveur que vous avez choisi. L'option du menu du haut <guilabel>Sélectionner pour charger un des ensembles par défaut</guilabel> configure généralement les boîtes correctement.

source: Configure StellarSolver Scale and Position
fr: Configurer l'échelle et la position pour StellarSolver

source: <screeninfo>StellarSolver Scale and Position</screeninfo>
fr: <screeninfo>Échelle et position pour StellarSolver</screeninfo>

source: <phrase>StellarSolver Scale and Position</phrase>
fr: <phrase>Échelle et position pour StellarSolver</phrase>

source: This page tells Ekos whether you want to constrain your plate-solving search by scale or position.
fr: Cette page indique à Ekos si vous souhaitez contraindre la résolution en tenant compte de l'échelle et de la position.

source: Scale can be the image width in degrees (<guilabel>dw</guilabel>), the image width in arc-minutes (<guilabel>aw</guilabel>), or the pixel width in arc-seconds (<guilabel>app</guilabel>). All should work, but arc-seconds per pixel is recommended. Typically you want to use this constraint for faster solving, so we recommend you check this box. The system doesn't require that the scale be exactly right--it allows deviations of 10-20%. However, frequently issues related to solving are due to an inaccurate scale being used. Therefore, if you have plate-solving problems, you may want to uncheck <guilabel>Use Scale</guilabel> until those issues are resolved. This will likely result in longer solving times. <guilabel>Auto-update</guilabel> will automatically fill the scale box with the scale found in the most-recent successful solve.
fr: L'échelle peut être la largeur de l'image en degrés (<guilabel>dw</guilabel>), en minutes d'arc (<guilabel>aw</guilabel>) ou en pixels en secondes d'arc (<guilabel>app</guilabel>). Toutes devraient fonctionner mais secondes d'arc par pixel est recommandée. Vous souhaitez typiquement utiliser cette contrainte pour accélérer la résolution, ainsi nous vous recommandons de cocher cette case. Le système ne requiert pas l'échelle d'être parfaitement correcte, il permet une déviation de 10 à 20 %. Toutefois, les problèmes de résolution sont souvent liés à l'utilisation d'une échelle imprécise. Par conséquent, si vous rencontrez des problèmes de résolution, vous pouvez décocher cette case jusqu'à avoir résolu ces problèmes. Le résultat sera un allongement du temps de résolution. <guilabel>Mise à jour automatique</guilabel> mettra à jour l'échelle avec la valeur de la résolution réussie la plus récente.

source: The RA and DEC positions are usually filled in from the position the telescope thinks it is pointing. Naturally, the system doesn't require an exactly correct positional constraint--afterall the purpose of plate-solving is to find that position. The maximum distance in degrees from the specified position to the actual position is given by the <guilabel>Radius</guilabel> field. Plate-solving will fail if the specified position is further away. Typically you want to enable <guilabel>Use Position</guilabel> for faster solving, so we recommend you check this box. However, frequently issues related to solving are due to using a poor positional estimate (e.g. the telescope is significantly misaligned). Therefore, if you have plate-solving problems, you may want to uncheck <guilabel>Use Position</guilabel> until those issues are resolved. As mentioned, this will result in longer solving times. <guilabel>Auto-update</guilabel> will fill the position box with the position found in the most-recent successful solve. However, a slew will update the position to the position where the telescope thinks it is pointing after the slew.
fr: Les positions en AD et DEC sont généralement prises de la position vers laquelle le télescope croit qu'il pointe. Comme la raison première de la résolution est de trouver l'exacte position, le système n'a évidemment pas besoin d'une position exacte pour la résolution. La distance maximale en degrés de la position spécifiée et la position actuelle est indiqué dans le champ <guilabel>Rayon</guilabel>. La résolution échouera si la position spécifiée est plus loin. Vous souhaitez typiquement activer <guilabel>Utiliser position</guilabel> pour accélérer la résolution, et nous vous recommandons de le faire. Toutefois, de fréquents problèmes de résolution sont liés à une estimation très imprécise de la position (le télescope est très mal aligné). Ainsi, si vous rencontrez des problèmes de résolution, vous pouvez décocher cette case jusqu'à avoir résolu ces problèmes. Comme déjà mentionné, cela va allonger la durée de résolution. <guilabel>Mise à jour automatique</guilabel> mettra à jour la position avec la position de la résolution réussie la plus récente. Mais un pivotage déclenchera une mise à jour de la position où le télescope pense qu'il pointe.

source: Configure StellarSolver Profiles
fr: Configuration des profils pour StellarSolver

source: <screeninfo>StellarSolver Profiles</screeninfo>
fr: <screeninfo>Profils pour StellarSolver</screeninfo>

source: <phrase>StellarSolver Profiles</phrase>
fr: <phrase>Profils pour StellarSolver</phrase>

source: This applies if you are using the (recommended) <guilabel>Internal Solver</guilabel> <guilabel>Solving Method</guilabel>.
fr: Cela s'applique si vous utilisez la <guilabel>Méthode de résolution</guilabel> (recommandée) du <guilabel>Résolveur interne</guilabel>.

source: You can choose an <guilabel>Options Profile</guilabel> on the <guilabel>StellarSolver Options</guilabel> tab. Profiles are simply collections of parameters to configure the performance of the star-extraction and plate-solving system inside of StellarSolver. The <guilabel>1-Default</guilabel> profile is the recommended one to start with. There are a few other possible profiles such as <guilabel>Large Scale Solving</guilabel>, <guilabel>Small Scale Solving</guilabel>, and <guilabel>Single Thread Solving</guilabel>.
fr: Vous pouvez choisir les <guilabel>Options de profil</guilabel> dans l'onglet <guilabel>Options de StellarSolver</guilabel>. Les profils sont simplement une collection de paramètres pour la configuration de l'extraction d'étoiles et leur résolution du système « StellarSolver ». Le profil <guilabel>1-Défaut</guilabel> est celui recommandé pour démarrer. Il en existe d'autres comme <guilabel>Résolution à grande échelle</guilabel>, <guilabel>Résolution à échelle réduite</guilabel> et <guilabel>Résolution en mono-processus</guilabel>.

source: In the <guilabel>Align Options Profile Editor</guilabel> tab you can view and edit profiles. There are many parameters, most of which you need not change to solve issues. There are 3 types of parameters.
fr: Les <guilabel>Options d'alignement du modificateur de profils</guilabel> permettent de visualiser et modifier les profils. Il existe de nombreux paramètres dont la plupart n'ont pas besoin d'être modifié pour résoudre les problèmes. Il y a trois types de paramètres.

source: The top section labelled <guilabel>Sextractor Parameters</guilabel> (with column headings <guilabel>Extraction Parameters</guilabel>, <guilabel>Deblending Params</guilabel>, and <guilabel>Photometry Params</guilabel>) are star extraction parameters--that is those that help find stars in your image.
fr: La partie supérieure intitulée <guilabel>Paramètres Sextractor</guilabel> (avec les colonnes <guilabel>Paramètres d'extraction</guilabel>, <guilabel>Paramètres de dissociation</guilabel> et <guilabel>Paramètres de photométrie</guilabel>) gère la phase d'extraction - celle qui permet de trouver les étoiles dans une image.

source: The second section labelled <guilabel>Star Filtering Parameters</guilabel> filters/reduces the number of stars extracted before sending the list to either the plate-solver (when aligning or polar-aligning), or to autofocus or the internal guider (when just a list of stars is needed).
fr: La deuxième partie intitulée <guilabel>Paramètres de filtrage d'étoiles</guilabel> gère le filtrage ou la réduction du nombre d'étoiles extraites avant d'envoyer cette liste soit au résolveur (lors d'un alignement ou d'un alignement sur la Polaire) soit à la mise au point automatique ou encore au guidage interne (quand seule une liste d'étoiles est nécessaire).

source: The third section labelled Astrometry Parameters adjusts the performance of plate solving.
fr: La troisième et dernière partie intitulée <guilabel>Paramètres d'astrométrie</guilabel> permet d'ajuster la qualité de la résolution.

source: All the input fields have tooltips that are displayed if you hover your mouse over the input box.
fr: Tous les champs affichent des infobulles quand le curseur de la souris passe par-dessus.

source: You can make changes to the values and save the profile if you like, or restore the profile's original values.
fr: Vous pouvez modifier les valeurs et enregistrer le profil à votre convenance ou rétablir les valeurs par défaut du profil.

source: Star-Extraction Parameters
fr: Paramètres de l'extraction d'étoiles

source: The column headings are links to the Sextractor manual which is the main source for these parameters. View those links to find details on all the parameters. We will touch upon some of the parameters you might consider adjusting. However, it's probably best not to get into the weeds of modifying most of these values.
fr: Les intitulés des colonnes sont des liens vers le manuel de Sextractor qui est la source d'information principale pour ces paramètres. Visitez ces liens pour obtenir davantage de détails sur ces paramètres. Nous allons aborder quelques uns de ces paramètres qu'il pourrait être intéressant d'ajuster. Toutefois, il est probablement judicieux de garder les valeurs par défaut de la plupart de ces paramètres.
