Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_config.po
Languages: fr

source: The <guilabel>Use animated slewing</guilabel> checkbox controls how the display changes when a new focus position is selected in the map. By default, you will see the sky drift or <quote>slew</quote> to the new position; if you uncheck this option, then the display will instead <quote>snap</quote> immediately to the new focus position.
fr: La case à cocher <guilabel>Utiliser la rotation animée</guilabel> contrôle comment l'affichage change lorsqu'une nouvelle position de la mise au point est sélectionnée dans la carte. Par défaut, vous verrez le ciel bouger ou <quote>tourner</quote> vers la nouvelle position ; si vous décochez cette option, l'affichage <quote>sautera</quote> immédiatement vers la nouvelle position de la mise au point.

source: Objects in the Sky
fr: Objets dans le ciel

source: Labeling
fr: Étiquetage

source: Automatic
fr: Automatique

source: If the <guilabel>Attach label to centered object</guilabel> checkbox is selected, then a name label will automatically be attached to an object when it is being tracked by the program. The label will be removed when the object is no longer being tracked. Note that you can also manually attach a persistent name label to any object with its <link linkend="popup-menu">popup menu</link>.
fr: Si la case à cocher <guilabel>Attacher une étiquette à l'objet centré</guilabel> est cochée, une étiquette de nom sera automatiquement attachée à un objet lorsqu'il est suivi par le programme. L'étiquette sera supprimée lorsque l'objet n'est plus suivi. Notez que vous pouvez aussi attacher à la main un nom persistant à n'importe quel objet avec son <link linkend="popup-menu">menu contextuel</link>.

source: Hiding
fr: Masquage

source: There are three situations when &kstars; must redraw the sky display very rapidly: when a new focus position is selected (and <guilabel>Use animated slewing</guilabel> is checked), when the sky is dragged with the mouse, and when the time step is large. In these situations, the positions of all objects must be recomputed as rapidly as possible, which can put a large load on the <abbrev>CPU</abbrev>. If the <abbrev>CPU</abbrev> cannot keep up with the demand, then the display will seem sluggish or jerky. To mitigate this, &kstars; will hide certain objects during these rapid-redraw situations, as long as the <guilabel>Hide objects while moving</guilabel> checkbox is selected. The timestep threshold above which objects will be hidden is determined by the <guilabel>Also hide if time step larger than:</guilabel> timestep-spinbox. You can specify the objects that should be hidden in the <guilabel>Configure Hidden Objects</guilabel> section.
fr: Il y a trois situations dans lesquelles &kstars; doit redessiner le ciel très vite : quand il est demandé une nouvelle position de mise au point (et <guilabel>Utiliser la rotation animée</guilabel> est coché), quand le ciel est tiré avec la souris et quand le pas temporel est grand. Dans ces situations, la position de tous les objets doit être recalculée aussi vite que possible, ce qui peut demander une grosse charge processeur. Si le processeur ne peut suivre la demande, l'affichage semblera instable. Pour tempérer ceci, &kstars; cachera certains objets pendant ces situations de rafraîchissement rapide, tant que la case <guilabel>Cacher les objets pendant le déplacement</guilabel> est cochée. Le seuil de temps élémentaire au-dessus duquel les objets seront cachés est déterminé par le compteur <guilabel>Cacher également si le pas temporel est supérieur à</guilabel>. Vous pouvez spécifier les objets que vous souhaitez cacher dans la section <guilabel>Configurer les objets cachés</guilabel>.

source: Developer
fr: Développeurs

source: <screeninfo>Developer Window</screeninfo>
fr: <screeninfo>Fenêtre pour développeurs</screeninfo>

source: <phrase>Developer Window</phrase>
fr: <phrase>Fenêtre pour développeurs</phrase>

source: Developer page
fr: Pages développeurs

source: The <guilabel>Developer</guilabel> page provides a few checkboxes that can help debug issues with &kstars;. There are checkboxes for saving images in logging directories that might help debug issues. Of course, saving images can take up disk space and should be used judiciously.
fr: La page <guilabel>Développeurs</guilabel> fournit quelques cases à cocher qui peuvent aider à déboguer les problèmes avec &kstars;. Il y a des cases à cocher pour enregistrer les images dans le dossier des fichiers journaux qui aideront à débusquer les problèmes. Bien sûr ces images prendront de la place et cette fonctionnalité devrait être utilisée judicieusement.

source: The images that can be saved are
fr: Les images qui peuvent être enregistrées sont

source: all focus images,
fr: toutes les images de mise au point,

source: all guider images,
fr: toutes les images de guidage,

source: all align images, and
fr: toutes les images d'alignement,

source: align images where the plate-solving failed.
fr: toutes les images qui ont échoué à la résolution.

source: The images are all saved in folders parallel to the main logging directory. They are in folders named guide, autofocus, align, and align/failed.
fr: Ces images sont enregistrées dans des dossiers situés au même niveau que le dossier des fichiers journaux. Leurs noms sont guide, autofocus, align et align / failed.

source: Customizing the Display
fr: Personnaliser l'affichage

source: There are several ways to modify the display to your liking.
fr: Il y a plusieurs manières de modifier l'affichage à votre convenance.

source: Info Boxes
fr: Zones d'information

source: Shading
fr: Masquage

source: Toggle whether the Info Boxes are drawn in the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Info Boxes</guisubmenu></menuchoice> submenu. In addition, you can manipulate the three Info Boxes with the mouse. Each box has additional lines of data that are hidden by default. You can toggle whether these additional lines are visible by double-clicking a box to <quote>shade</quote> it. Also, you can reposition a box by dragging it with the mouse. When a box hits a window edge, it will <quote>stick</quote> to the edge when the window is resized.
fr: Vous pouvez (dés)activer l'affichage des boîtes d'informations dans le menu <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Boîtes d'informations</guimenuitem></menuchoice>. De plus, vous pouvez manipuler les trois boîtes d'informations avec la souris. Chaque boîte possède des lignes additionnelles de données qui sont cachées par défaut. Vous pouvez (dés)activer le mode d'affichage complet en double-cliquant sur la boîte pour l'<quote>enrouler</quote>. De plus, vous pouvez repositionner une boîte en la tirant avec la souris. Quand une boîte heurte un bord de fenêtre, elle s'y <quote>colle</quote> lorsque la fenêtre est redimensionnée.

source: Toolbars
fr: Barres d'outils

source: Toggle whether the Toolbars are drawn in the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu></menuchoice> submenu. Like most &kde; toolbars, they can also be dragged around and anchored on any window edge, or even detached from the window completely if they are unlocked.
fr: (Dés)active la présence des barres d'outils dans le menu <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Barres d'outils</guimenuitem></menuchoice>. Comme la plupart des barres d'outils de &kde;, elles peuvent aussi être déplacées et ancrées à n'importe quel côté de la fenêtre, ou même complètement détachées de la fenêtre.

source: Selecting
fr: Sélection

source: Select a different color scheme in the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Color Schemes</guisubmenu></menuchoice> submenu. There are four predefined color schemes, and you can define your own in the <link linkend="config"><guilabel>Configure - &kstars;</guilabel></link> window.
fr: Choisissez un modèle de couleurs différent dans le menu <menuchoice><guimenu>Configuration</guimenu> <guisubmenu>Modèles de couleurs</guisubmenu></menuchoice>. Il y a quatre modèles de couleurs prédéfinis, et vous pouvez définir le vôtre dans la fenêtre <link linkend="config"><guilabel>Configurer &kstars;</guilabel></link>.

source: Field-of-View Symbols
fr: Indicateurs de champ de vision

source: Choose an <quote>FOV Symbol</quote> using the <menuchoice><guimenu>Settings</guimenu><guisubmenu>FOV Symbols</guisubmenu></menuchoice> submenu. <firstterm>FOV</firstterm> is an acronym for <quote>field-of-view</quote>. An FOV symbol is drawn at the center of the window to indicate where the display is pointing. Different symbols have different angular sizes; you can use a symbol to show what the view through a particular telescope would look like. For example, if you choose the <quote>7x35 Binoculars</quote> FOV symbol, then a circle is drawn on the display that is 9.2 degrees in diameter; this is the field-of-view for 7x35 binoculars.
fr: Choisissez un <quote>Indicateur de champ de vision (FOV)</quote> en utilisant le menu <menuchoice><guimenu>configuration</guimenu> <guisubmenu>Indicateurs de champ de vision</guisubmenu></menuchoice>. <firstterm>FOV</firstterm> est un acronyme pour <quote>Field Of View</quote> (champ de vision = CdV). Un indicateur de champ de vision est dessiné au centre de la fenêtre pour indiquer où l'affichage pointe. Les indicateurs correspondant à différentes tailles angulaires ; vous pouvez utiliser un indicateur pour voir à quoi la vue ressemblerait à travers un certain télescope. Par exemple, si vous choisissez l'indicateur <quote>Jumelles 7x35</quote>, un cercle de 9,2 degrés de diamètre sera dessiné sur l'écran ; c'est le champ de vision d'une paire de jumelles 7x35.

source: You can define your own FOV symbols (or modify the existing symbols) using the <guimenuitem>Edit FOV Symbols...</guimenuitem> menu item, which launches the FOV Editor:
fr: Vous pouvez définir vos propres indicateurs de champ de vision (ou modifier les indicateurs existants) en utilisant l'élément de menu <guimenuitem>Modifier les indicateurs de champ de vision…</guimenuitem>, ce qui lance l'éditeur de champ de vision :

source: Field-of-View Symbols Editor
fr: Éditeur d'indicateurs de champ de vision

source: FOV Symbol Editor
fr: Éditeur d'indicateurs de champ de vision

source: The list of defined FOV symbols is displayed on the left. On the right are buttons for adding a new symbol, editing the highlighted symbol's properties, and removing the highlighted symbol from the list. Note that you can even modify or remove the four predefined symbols (if you remove all symbols, the four defaults will be restored the next time you start &kstars;). Below these three buttons is a graphical preview display showing the highlighted symbol from the list. When the <guibutton>New...</guibutton> or <guibutton>Edit...</guibutton> button is pressed, the <guilabel>New FOV Indicator</guilabel> window is opened:
fr: La liste des indicateurs de champ de vision prédéfinis est affichée à gauche. Sur la droite se trouvent des boutons pour ajouter un nouvel indicateur, modifier les propriétés de l'indicateur surligné et supprimer l'indicateur surligné de la liste. Notez que vous pouvez même modifier ou supprimer les quatre indicateurs prédéfinis (si vous supprimez tous les indicateurs, les quatre indicateurs par défaut seront restaurés au prochain démarrage de &kstars;). Sous ces trois boutons se trouve un aperçu graphique montrant les indicateurs surlignés de la liste. Quand le bouton <guibutton>Nouveau…</guibutton> ou <guibutton>Modifier…</guibutton> est actionné, la fenêtre <guilabel>Nouvel indicateur de champ de vision</guilabel> s'ouvre :

source: New Field-of-View Symbol
fr: Nouvel indicateur de champ de vision

source: New FOV Symbol
fr: Nouvel indicateur de champ de vision

source: Defining New
fr: Définir un nouveau

source: This window lets you modify the four properties that define a FOV symbol: name, size, shape, and color. The angular size for the symbol can either be entered directly in the <guilabel>Field of View</guilabel> edit box, or you can use the Eyepiece/Camera Tabs to calculate the field-of-view angle, given parameters of your telescope/eyepiece or telescope/camera setup. The five available shapes are: Square, Circle, Crosshairs, Bullseye and Semitransparent circle. Once you have specified all four parameters, press <guibutton>Ok</guibutton>, and the symbol will appear in the list of defined symbols. It will also be available from the <menuchoice><guimenu>Settings</guimenu><guisubmenu>FOV Symbols</guisubmenu></menuchoice> submenu.
fr: Cette fenêtre vous permet de modifier les quatre propriétés qui définissent un indicateur de champ de vision : le nom, la taille, la forme et la couleur. La taille angulaire pour l'indicateur peut être soit donnée directement dans la zone de saisie <guilabel>Champ de vision</guilabel>, soit utiliser l'onglet Appareil photo pour calculer l'angle de champ de vision, étant donné les paramètres de votre réglage de télescope/Viseur ou télescope/appareil photo. Les cinq formes disponibles sont : cercle, carré, croix, cible et semi-transparent. Une fois que vous avez spécifié les quatre paramètres, actionnez <guibutton>Ok</guibutton>, et l'indicateur apparaîtra dans la liste des indicateurs définis. Il sera aussi disponible dans le menu <menuchoice><guimenu>Configuration</guimenu> <guisubmenu>Indicateur de champ de vision</guisubmenu></menuchoice>.

source: Adjusting orientation of the sky map
fr: Ajustement de l'orientation de la carte du ciel

source: You can tweak various settings to make the orientation of the sky map match the view through your optical instrument.
fr: Vous pouvez ajuster différents réglages pour que l'orientation de la carte du ciel soit la même que la vue à travers votre instrument optique.

source: First, pick the coordinate system that matches your mount. For an equatorially mounted instrument, switch to the Equatorial Coordinate mode in the <guimenu>View</guimenu> menu. The option to toggle the coordinate system should read <guilabel>Switch to Horizontal View (Horizontal Coordinates)</guilabel> when the current mode is Equatorial Coordinates. For an altazimuth-mounted instrument or naked-eye viewing, switch to Horizontal Coordinates, so that the option in the <guimenu>View</guimenu> menu reads <guilabel>Switch to Star Globe View (Equatorial Coordinates)</guilabel>. This sets the base coordinate system used to render the sky map, and also sets the reference for the orientation of the skymap: zenith or north.
fr: Commencez par choisir le système de coordonnées qui correspond à votre monture. Pour une monture équatoriale, passez en mode Coordonnées Équatoriales dans le menu <guimenu>Affichage</guimenu>. Cette option est nommée <guilabel>Passer en coordonnées horizontales</guilabel> quand le mode actif est en coordonnées équatoriales. Pour un instrument monté en alt-azimutale ou une observation à l'œil nu, passez aux coordonnées horizontales dans le menu <guimenu>Affichage</guimenu> avec l'option <guilabel>Passez en coordonnées horizontales</guilabel>. Cette opération fixe le système de coordonnées de base utilisé pour l'affichage de la carte du ciel ainsi que la référence pour son orientation, soit zénith ou nord.

source: If your instrument is using an erecting prism, typically used on Schmidt-Cassegrain and refracting type telescopes, the view through the eyepiece will be mirrored horizontally. You can have the sky map match this by checking the <guilabel>Mirrored View</guilabel> option under the <guimenu>View</guimenu> menu.
fr: Si votre instrument est équipé d'un redresseur terrestre à prisme, ce qui est typiquement utilisé sur un télescope Schmidt-Cassegrain ou un réfracteur, la vue à travers l'oculaire sera redressée horizontalement. La carte du ciel peut s'adapter à ce montage en cochant l'option <guilabel>Vue redressée</guilabel> dans le menu <guimenu>Affichage</menu>.

source: Next, to rotate the sky map freely, you can hold down the &Shift; key and drag the mouse on the sky map. A temporary overlay will appear showing the direction of north and zenith at the point, and displaying the angle they make with the vertical in a counterclockwise sense. The orientations of zenith and north will update as you rotate the sky map. Letting go of &Shift; or the mouse button will stop the rotation operation. As you pan the sky map or focus it on different objects, the rotation you set is retained as an offset from the reference direction. The reference direction is north when using Equatorial Coordinates and zenith when using Horizontal Coordinates. As a reminder, the reference direction is solid and brighter in the temporary overlay. For the two common orientations of erect and inverted, the rotation can be set / reset using the <menuchoice><guimenu>View</guimenu><guisubmenu>Skymap Orientation</guisubmenu></menuchoice> submenu. Select "North Down" or "Zenith Down" as is applicable to set an orientation of 180 degrees.
fr: Vous pouvez effectuer une rotation libre en gardant enfoncée la touche &Maj; et en glissant la souris sur la carte du ciel. Une superposition temporaire apparaîtra montrant la direction du nord et du zénith à ce point et affichera leur angle avec la verticale dans le sens antihoraire. L'orientation du zénith et du nord sera actualisée lorsque vous effectuerez une rotation de la carte du ciel. L'opération se terminera dès que vous relâcherez la touche &Maj;. La rotation fixée sera conservée en tant que décalage par rapport à la direction de référence, même lorsque vous déplacerez la carte du ciel ou zoomer sur différents objets. La direction de référence est le nord lorsque vous utilisez les coordonnées équatoriales et le zénith pour les coordonnées horizontales. Pour rappel, la direction de référence est représentée par un trait plein et de couleur vive dans la superposition temporaire. La rotation peut être réglée pour ces deux orientations communes dans les sous-menu <menuchoice><guimenu>Affichage</guimenu><guisubmenu>Orientation de la carte du ciel</guisubmenu></menuchoice>. Choisissez « Nord en bas » ou « Zénith en bas » en fonction du système de coordonnées utilisé pour régler une orientation de 180 degrés.

source: If you are visually observing through an eyepiece of an instrument, you may need to do some more correction. For the common case of a large Dobsonian telescope (or more generally a Newtonian design mounted on an altazimuth mount), a systematic additional correction is of help. This correction applies because we stand erect while using the telescope irrespective of the angle the telescope tube is making with the ground. So as we move the telescope in altitude, an additional correction depending on the altitude of the object needs to be applied to make the sky map match the view through the eyepiece. This correction is enabled by checking the <guilabel>Erect observer correction</guilabel> checkbox in the <menuchoice><guimenu>View</guimenu><guisubmenu>Skymap Orientation</guisubmenu></menuchoice> submenu. This correction only makes sense in Horizontal Coordinate mode and is disabled when using equatorial coordinates.
fr: Si vous observez à l'œil nu à travers un oculaire d'un instrument, il se peut que vous deviez faire quelques corrections supplémentaires. Pour le cas commun d'un télescope de Dobson (ou plus généralement un Newton monté sur une monture alt-azimutale), une correction supplémentaire systématique est nécessaire. Elle s'applique parce que l'observateur se tient debout lors de l'observation indépendamment de l'angle du tube du télescope par rapport au sol. Ainsi, à mesure que l'on bouge le télescope en élévation, il est nécessaire d'appliquer une correction dépendante de l'altitude de l'objet pour que la carte du ciel corresponde à la vue à travers l'oculaire. Cette correction est activée en cochant la case <guilabel>Correction observateur debout</guilabel> dans le sous-menu <menuchoice><guimenu>Affichage</guimenu><guisubmenu>Orientation de la carte du ciel</guisubmenu></menuchoice>. Cette correction ne fait sens que dans le mode de coordonnées horizontales et est par conséquent désactivée en coordonnées équatoriales.

source: Finally we provide some examples of how to use these settings for various instruments:
fr: Voici quelques exemples d'utilisation de ces réglages pour différents instruments :

source: Naked-eye observing: Choose Horizontal Coordinates and a <guilabel>Zenith Up</guilabel> orientation under <menuchoice><guimenu>View</guimenu><guisubmenu>Skymap Orientation</guisubmenu></menuchoice>.
fr: Observation à l'œil nu : choisissez les coordonnées horizontales et une orientation <guilabel>Zénith en haut</guilabel> dans le sous-menu <menuchoice><guimenu>Affichage</guimenu><guisubmenu>Orientation de la carte du ciel</guisubmenu></menuchoice>.

source: Camera on an equatorially mounted telescope: Choose Equatorial Coordinates and adjust the orientation of the sky map so that it matches your camera. As your mount points to different regions of the sky, the orientation should be rendered correctly.
fr: Appareil photo monté sur une monture équatoriale : choisissez les coordonnées équatoriales et ajustez l'orientation de la carte du ciel pour qu'elle corresponde à votre appareil photo. À mesure que votre monture point vers différentes régions du ciel, l'orientation devrait s'ajuster correctement.

source: Using binoculars: Same settings as Naked-eye observing
fr: Utilisation de jumelles : utilisez les mêmes réglages que pour l'observation à l'œil nu.

source: Eyepiece of an altazimuth Schmidt-Cassegrin telescope with an erecting prism: Under the <guimenu>View</guimenu> menu, choose <guilabel>Mirrored View</guilabel>, and under the <guisubmenu>Skymap Orientation</guisubmenu> sub-menu, choose <guilabel>Zenith Up</guilabel>. Finally, tweak the rotation manually to match the eyepiece view according to the angle you are using for your erecting prism.
fr: Oculaire d'un télescope Schmidt-Cassegrain équipé d'un redresseur terrestre à prisme : dans le menu <guimenu>Affichage</guimenu>, choisissez <guilabel>Vue redressée</guilabel>, et dans le sous-menu <guisubmenu>Orientation de la carte du ciel</guisubmenu>, choisissez <guilabel>Zénith en haut</guilabel>. Enfin, réglez manuellement la rotation pour qu'elle s'accorde à la vue de l'oculaire en accord avec l'angle utilisé pour le redresseur.

source: Using a RACI finder scope on an altazimuth mounted telescope: Same settings as Naked-eye observing, except you may need to tweak the orientation manually once if you have it mounted at an angle
fr: Chercheur redresseur d'image à angle droit sur une monture alt-azimutale : utilisez les mêmes réglages que pour l'observation à l'œil nu, sauf qu'il vous faudra peut-être ajuster l'orientation une fois si elle est montée à un angle.

source: Using a straight-through (inverted view) finder scope on an altazimuth mounted telescope: Choose Horizontal Coordinates and a sky-map orientation of <guilabel>Zenith Down</guilabel> in <menuchoice><guimenu>View</guimenu><guisubmenu>Skymap Orientation</guisubmenu></menuchoice> submenu
fr: Chercheur inversé sur une monture alt-azimutale : choisissez les coordonnées horizontales et une orientation de la carte du ciel avec <guilabel>Zénith en bas</guilabel> dans le sous-menu <menuchoice><guimenu>Affichage</guimenu><guisubmenu>Orientation de la carte du ciel</guisubmenu></menuchoice>.
