Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: In this example, Adaptive Focus is setup for Altitude adjustments on the Red filter only in Filter Settings. So the Adapted AF Run values are the same as the unadapted values for all the other filters.
fr: Dans cet exemple, la mise au point adaptative n'est réglée que pour les ajustements en altitude pour le filtre Rouge. Ainsi les valeurs des passes suivantes seront les mêmes que les valeurs non-ajustées pour tous les autres filtres.

source: If you hover the mouse over an AF Run it will show a tooltip Adaptive Focus Explainer. In the example, the mouse is hovering over AF Run 1 on Red. The 1st row of the Explainer shows the measured Autofocus result for that run (36683), adaptations for Temperature (0.0C) and Altitude (0.2 degrees Alt). The 2nd row of the Explainer shows the Adaptations: 206 total, 0 temperature, 205.9 altitude. The 3rd row shows the Adapted Position of 36889.
fr: En survolant la passe de mise au point automatique avec la souris, une fenêtre d'aide sera affichée. Dans cet exemple, la souris survole la passe 1 du filtre Rouge. La première ligne affiche le résultat des mesures de la mise au point automatique pour cette passe (36683), les ajustements pour la température (0.0°C) et l'altitude (0.2 degrés Alt). La deuxième ligne affiche les ajustements : 206 au total, 0 pour la température et 205.9 pour l'altitude. La troisième ligne affiche la position 36889.

source: The user can toggle between Adapt Focus or raw values. Whichever values are displayed in the grid will be the values that are saved.
fr: L'opérateur peut basculer entre les valeurs de la mise au point adaptative et les valeurs brutes. Les valeurs affichées seront celles qui seront enregistrées.

source: Here are some tips for using this utility:
fr: Voici quelques astuces pour utiliser cet outils :

source: Start by making sure the area of the sky you are running Build Filter Offsets on works well for Autofocus. Aiming high in the sky will result in shooting through less atmosphere with smaller, tighter stars. Make sure there are enough stars in the frame. Avoid Meridian Flips during the process. Track the same area during the process so each run is using more or less the same set of stars. Although the facility to use Adapt Focus is available to adjust for environmental changes such as temperature and altitude try to minimise these changes over the course of running the utility by selecting an appropriate area of the sky.
fr: Commencez par vous assurer que l'endroit du ciel où vous souhaitez utiliser l'outil produit de bons résultats pour la mise au point automatique. Un pointage haut dans le ciel permet d'imager à travers moins d'atmosphère et permettra d'avoir des étoiles plus petites et fines. Assurez-vous également d'avoir suffisamment d'étoiles dans le champ. Évitez également un retournement au méridien durant le processus. Pointez une zone identique durant le processus pour que chaque passe utilise plus ou moins le même ensemble d'étoiles. En effet, bien que cet outil permette d'ajuster les variables de température et d'altitude, il fonctionne mieux lorsque ces variables ne changent pas trop durant les différentes passes.

source: Make sure your equipment is in thermal equilibrium before starting. Calculate roughly how long the utility will take which is the total number of AF runs * time for a single AF run. Try to make sure that the conditions will remain as consistent as possible during this time, e.g. there is enough time before dawn, the moon won't affect focusing of some images more than others, the target won't drop below your horizon during the process, etc.
fr: Assurez-vous que votre matériel se trouve en état d'équilibre thermique avant de commencer. Estimez le temps nécessaire à l'outil (qui est le nombre total de passes multiplié par la durée d'une seule passe), et assurez-vous que les conditions resteront aussi stables que possible durant cette période, c'est à dire qu'il reste assez de temps avant l'aurore, que la Lune n'affectera pas plus la mise au point sur certaines étoiles que sur d'autres, que la cible ne descendra pas sous votre horizon durant le processus, etc.

source: Configure the utility for # Focus Runs (5 is a good start), reference filter (e.g. Lum) and Adapt Focus setting. Run the utility to completion.
fr: Réglez le nombre de passes (5 est un bon départ), le filtre de référence (par exemple Lum) et les réglages de la mise au point adaptative. Ensuite lancez l'outil jusqu'à achèvement.

source: Review the results. For each filter review each AF run looking for outliers. For each outlier decide what to do, e.g. remove from processing by setting to 0. If there are filters for which you are unhappy with the results, uncheck the Save checkbox for those filters.
fr: Vérifiez les résultats. Recherchez des valeurs aberrantes pour chaque filtre. Si vous en trouvez, décidez de ce que vous allez en faire, par exemple les supprimer du traitement en mettant 0. S'il y a des filtres avec lesquels vous n'êtes pas satisfaits des résultats, décochez la case Enregistrer pour ceux-ci.

source: When happy, press Save to save the filter offsets to Filter Settings for future use.
fr: Une fois satisfait, cliquez sur Enregistrer pour enregistrer les décalages de filtres dans les réglages de filtres pour les futures utilisations.

source: <title>Focus Display</title>
fr: <title>Affichage de la mise au point</title>

source: <screeninfo>Focus Display</screeninfo>
fr: <screeninfo>Affichage de la mise au point</screeninfo>

source: <phrase>Focus Display</phrase>
fr: <phrase>Affichage de la mise au point</phrase>

source: The focus display, displays a FITS viewer window onto the frame taken during the focus process. If <guilabel>Ring Mask</guilabel> is selected, then the mask is drawn on the image. All the stars detected by Ekos based on the selected parameters, have their HFR value displayed next to the associated star (unless Measure is set to FWHM).
fr: L'affichage de la mise au point affiche une fenêtre de l'afficheur FITS sur l'image prise durant la procédure de mise au point. Si <guilabel>Masque annulaire</guilabel> est sélectionné, alors le masque est dessiné sur l'image. Toutes les étoiles détectées par Ekos fondées sur les paramètres sélectionnées ont leur HFR affichée à leur côté (sauf si Mesure est réglé à FWHM).

source: If <guilabel>Mosaic Mask</guilabel> has been selected then the FITS viewer displays the mosaic 3x3 grid showing the center, edges and sides as configured in the Mosaic Mask options.
fr: Si <guilabel>Masque de mosaïque</guilabel> a été sélectionné, alors l'afficheur FITS affichera la grille de mosaïque 3x3 montrant le centre, les coins et les côtés comme configuré dans les options de masque de mosaïque.

source: <screeninfo>Focus Display Mosaic</screeninfo>
fr: <screeninfo>Affichage de la mise au point de la mosaïque</screeninfo>

source: <phrase>Focus Display Mosaic</phrase>
fr: <phrase>Affichage de la mise au point de la mosaïque</phrase>

source: The window supports the following FITS viewer options (at the top of the window):
fr: La fenêtre possède les options de l'afficheur FITS suivantes (au haut de la fenêtre) :

source: <guibutton>Zoom In</guibutton> and <guibutton>Zoom Out</guibutton>.
fr: <guibutton>Zoom avant</guibutton> et <guibutton>Zoom arrière</guibutton>.

source: <guibutton>Default Zoom</guibutton> and <guibutton>Zoom to Fit</guibutton>.
fr: <guibutton>Zoom par défaut</guibutton> et <guibutton>Zoom pour ajuster</guibutton>.

source: <guibutton>Toggle Stretch</guibutton>: Toggle screen stretch on or off.
fr: <guibutton>(Dés)active étirement</guibutton> : (dés)active l'étirement.

source: <guibutton>Toggle Crosshairs</guibutton>: Toggle crosshairs on or off.
fr: <guibutton>(Dés)active mire</guibutton> : (dés)active la mire.

source: <guibutton>Toggle Gridlines</guibutton>: Toggle pixel gridlines on or off.
fr: <guibutton>(Dés)active grille</guibutton> : (dés)active la grille.

source: <guibutton>Toggle Stars</guibutton>: Toggle star detection on or off.
fr: <guibutton>(Dés)active étoiles</guibutton> : (dés)active les étoiles.

source: <guibutton>View Star Profile</guibutton>: Launches the View Star Profile dialog.
fr: <guilabel>Afficher le profil de l'étoile</guilabel> : lance la boîte de dialogue de l'affichage du profil de l'étoile.

source: V-Curve
fr: Courbe en V

source: <screeninfo>Focus V-Curve</screeninfo>
fr: <screeninfo>Courbe en V de la mise au point</screeninfo>

source: <phrase>Focus V-Curve</phrase>
fr: <phrase>Courbe en V de la mise au point</phrase>

source: The V-Curve displays focuser position (x-axis) versus focus Measure, e.g. Half-Flux-Radius (HFR) (y-axis). Each datapoint is drawn on the graph and represented by a circle with a number representing the datapoint. How many datapoints are taken and how the focuser moves is determined by the parameters chosen.
fr: La courbe en V affiche la mesure de la mise au point (axe y), p. ex. le HFR en fonction de la position du moteur de mise au point (axe x). Chaque point est dessiné sur le graphique par un cercle et un nombre représentant sa valeur. Le nombre de points et le déplacement du moteur sont déterminés par les paramètres choisis.

source: For certain algorithms, Ekos will also draw a curve of best fit through the datapoints. If <guilabel>Use Weights</guilabel> is selected then error bars are indicated on each datapoint that correspond to the standard deviation in measured value.
fr: Pour certains algorithmes, Ekos dessinera également une courbe de régression des points. Si l'option <guilabel>Utiliser Poids</guilabel> est sélectionnée, des barres d'erreurs sont indiquées qui correspondent à la déviation standard mesurée en unité mesurée.

source: The units of the y-axis depend on the selected focus Measure. For example, for HFR, the y-axis will either be in Pixels or Arc seconds depending on how <guilabel>Display Units</guilabel> is set.
fr: Les unités de l'axe vertical dépendent de la mesure de mise au point sélectionnée. Par exemple pour le HFR, l'unité de l'axe vertical sera soit des pixels soit des secondes d'arc dépendant du réglage de <guilabel>Afficher unités</guilabel>.

source: If <guilabel>Refine Curve Fit</guilabel> is selected, Focus will check for and potentially exclude outlying datapoints. In this case datapoints 1, 5 and 7 were excluded.
fr: Si <guilabel>Affiner courbe de régression</guilabel> est sélectionné, le module de mise au point vérifiera les points aberrants et les exclura si nécessaire. Dans ce cas, les points 1, 5 et 7 ont été exclus.

source: Under the V-Curve a number of parameters are displayed:
fr: De nombreux paramètres sont affichés sous la courbe en V :

source: <guilabel>HFR</guilabel>: Displays the star HFR for the most recent datapoint if relevant.
fr: <guilabel>HFR</guilabel> : affiche la valeur HFR de l'étoile pour le dernier point si pertinent.

source: <guilabel>FWHM</guilabel>: Displays the star FWHM for the most recent datapoint if relevant.
fr: <guilabel>HFR</guilabel> : la valeur HFR de l'étoile pour le dernier point si pertinent.

source: <guilabel>Stars</guilabel>: The number of stars used for the most recent datapoint.
fr: <guilabel>Étoiles</guilabel> : le nombre d'étoiles utilisé pour le dernier point.

source: <guilabel>Iteration</guilabel>: The number of datapoints taken so far.
fr: <guilabel>Itération</guilabel> : le nombre de points utilisés jusqu'ici.

source: <guibutton>Relative Profile...</guibutton>: Invokes the <link linkend="focus-relative-profile">Relative Profile</link> popup.
fr: <guibutton>Profil relatif…</guibutton> : lance la boîte de dialogue <link linkend="focus-relative-profile">profil relatif</link>.

source: <guibutton>Clear Data</guibutton>: Resets the V-Curve graph by clearing the displayed data.
fr: <guibutton>Effacer données</guibutton> : réinitialise le graphique de la courbe en V en effaçant les données affichées.

source: Here is a V-Curve when Measure is set to HFR Adj:
fr: Voici une courbe en V avec Mesure réglée à HFR ajusté :

source: V-Curve HFR Adj
fr: Courbe en V avec HFR ajusté

source: Focus V-Curve HFR Adj
fr: Courbe en V de la mise au point avec HFR ajusté

source: Here is a V-Curve when Measure is set to FWHM:
fr: Voici une courbe en V avec Mesure réglée à FWHM :

source: V-Curve FWHM
fr: Courbe en V avec FWHM

source: Focus V-Curve FWHM
fr: Courbe en V avec FWHM

source: Here is a V-Curve when Measure is set to # Stars. In this case the Critical Focus Zone (CFZ) <guilabel>Display</guilabel> checkbox has been checked so the CFZ is displayed as well:
fr: Voici une courbe en V avec Mesure réglée à # d'étoiles. Dans ce cas la case <guilabel>Afficher</guilabel> de la CFZ a été cochée et ainsi la CFZ est également affichée :

source: V-Curve Num Stars
fr: Courbe en V avec nombre d'étoiles

source: Focus V-Curve Num Stars
fr: Courbe en V de la mise au point avec nombre d'étoiles

source: Here is a V-Curve when Measure is set to Fourier:
fr: Voici une courbe en V avec Mesure réglée à Fourier :

source: V-Curve Fourier
fr: Courbe en V avec Fourier

source: Focus V-Curve Fourier
fr: Courbe en V de la mise au point avec Fourier

source: When Framing, the graph format changes to that of a "time series" where horizontal axis denotes the frame number. This is to aid you in the framing process as you can see how Measure, in this case HFR, changes between frames.
fr: Lors d'acquisitions en boucle, le format du graphique est modifié en une série temporelle où l'axe horizontal représente le numéro de l'image. Cela peut vous aider dans ce processus puisque vous pouvez voir comment la mesure, ici HFR, change entre les images.

source: This is very useful, for example, when trying to get the system into approximate focus before starting an Autofocus run. In this case Framing is started and the Step In and Step Out buttons used to adjust focus and the effect on the V-Curve observed.
fr: Cela est très utile, lorsque par exemple, vous essayez de trouver une mise au point approximative avant d'exécuter une mise au point automatique. Dans ce cas, l'acquisition en boucle est démarrée et les boutons Pas vers l'intérieur et Pas vers l'extérieur sont utilisés pour ajuster la mise au point et l'effet sur la courbe en V.

source: V-Curve as timeseries
fr: Courbe en V comme série temporelle.

source: Focus V-Curve Timeseries
fr: Courbe en V de la mise au point comme série temporelle

source: Relative Profile
fr: Profil relatif

source: <screeninfo>Focus Relative Profile</screeninfo>
fr: <screeninfo>Profil relatif de la mise au point</screeninfo>

source: <phrase>Focus Relative Profile</phrase>
fr: <phrase>Profil relatif de la mise au point</phrase>

source: The relative profile is a graph that displays the relative HFR values plotted against each other. Lower HFR values correspond to narrower shapes and vice-versa. The solid red curve is the profile of the current HFR value, while the dotted green curve is for the previous HFR value. Finally, the magenta curve denotes the first measured HFR. This enables you to judge how well the Autofocus process improved the relative focus quality.
fr: Le profil relatif est un graphique qui représente les valeurs HFR affichées les unes contre les autres. Les valeurs basses de HFR correspondent à des formes plus étroites et inversement. La courbe en rouge plein représente le profil de la valeur HFR courante, alors que la courbe en vert pointillé représente la valeur précédente. Enfin, la courbe en magenta montre la première valeur HFR mesurée. Ce graphique vous permet de juger de la qualité de la mise au point relative.

source: How to Setup for an Autofocus Run
fr: Le réglage de la procédure de mise au point automatique

source: The exact settings that work best for a given astronomical setup need to be worked out by the user using trial and error. A good place to start is the <link linkend="focus-advisor">Focus Advisor</link> section. Run Focus Advisor and accept its recommendations. It uses the Linear 1 Pass algorithm:
fr: Le réglage exact qui fonctionne le mieux pour un équipement astronomique donné doit être trouvé par l'utilisateur par tâtonnements. La section du <link linkend="focus-advisor">Conseiller de mise au point</link> est un bon point de départ. Lancez-le et acceptez ses recommandations. L'algorithme linéaire à 1 passe y est utilisé :

source: Setup Backlash. See the <link linkend="focus-backlash">Backlash</link> section for more details.
fr: Réglage du jeu. Veuillez consulter la section <link linkend="focus-backlash">Jeu</link> pour davantage de détails.

source: Initial Step Size. This is a critical parameter. You may have an idea from other people with a similar setup. If not you can try setting it from the Critical Focus Zone (CFZ) for your equipment. See the <link linkend="focus-cfz">CFZ section</link> for more details.
fr: Taille de pas initiale. C'est le paramètre critique. Renseignez-vous auprès d'autres personnes ayant un montage similaire. Sinon, vous pouvez essayer depuis la zone critique de mise au point (CFZ) de votre équipement. Veuillez consulter la section <link linkend="focus-cfz">CFZ</link> pour davantage de détails.

source: Start near to focus by manually finding focus. Use the <guibutton>Start Framing</guibutton> option and manually adjust the focus to get to approximate focus.
fr: Débutez près de la position de mise au point trouvée manuellement. L'option <guibutton>En boucle</guibutton> permet d'afficher la recherche manuelle d'une mise au point approximative.

source: Make sure you are finding enough stars. Increasing the exposure usually finds more stars (but makes the focus process longer).
fr: Veillez à avoir suffisamment d'étoiles. L'augmentation de la durée d'exposition permet en général d'obtenir plus d'étoiles (mais rend le processus de mise au point plus long).

source: Run Autofocus. This is the sort of V-Curve you are after:
fr: Lancez la mise au point automatique. Voici le type de courbe en V que vous recherchez :

source: <screeninfo>Good Focus Curve</screeninfo>
fr: <screeninfo>Bonne courbe en V de la mise au point</screeninfo>

source: <phrase>Good Focus Curve</phrase>
fr: <phrase>Bonne courbe en V de la mise au point</phrase>

source: In contrast, the next picture shows an Initial Step Size that has been set too low. The HFR varies from about 0.78 to 0.72. Which gives a max / min just over 1. The other clue that this is a poor setup is that the Error Bar range is very large compared to HFR movement which means that the curve solver is drawing a curve through a lot of noise, which means the results will not be very accurate.
fr: En revanche, la prochaine figure montre que la taille de pas initiale a été réglé à une valeur trop basse. Le HFR varie de 0,78 à 0,72, ce qui donne un rapport max/min juste au-dessus de 1. Un autre indice qui montre le mauvais choix de ce réglage est la taille des barres d'erreur qui sont très grandes par rapport aux valeurs de HFR, ce qui signifie que la courbe est interpolée avec beaucoup de bruit et donc que la précision des résultats n'est pas très bonne.

source: <screeninfo>Bad Focus Curve</screeninfo>
fr: <screeninfo>Mauvaise courbe en V de la mise au point</screeninfo>

source: <phrase>Bad Focus Curve</phrase>
fr: <phrase>Mauvaise courbe en V de la mise au point</phrase>

source: Focuser Backlash
fr: Jeu du moteur de mise au point

source: Backlash in the focuser setup is due to a combination of backlash in the electronic focuser itself (e.g. in the gearing mechanism), in the binding of the electronic focuser to the telescope drawtube, and in the telescope drawtube's mechanism. Thus, each setup will have its own backlash characteristic even if the same focuser is used.
fr: Le jeu du moteur de mise au point provient très probablement d'une combinaison du jeu du moteur lui-même (par exemple dans les rouages mécaniques), de son attache au télescope et enfin du mécanisme du télescope. Par conséquent, chaque équipement aura ses propres caractéristiques de jeu, même en utilisant le même moteur de mise au point.

source: It is important to have a clear strategy for dealing with Backlash and to setup Focus appropriately for the chosen strategy. It is best to have backlash managed in one place to avoid conflicts. Whilst it is possible to have backlash managed in multiple places (this has been done successfully) it is not recommended in general because it can lead to conflicts between software components and the focuser.
fr: Il est important de suivre une stratégie claire pour gérer le jeu et pour configurer la mise au point judicieusement. Il est préférable de gérer le jeu à un seul endroit pour éviter les conflits. Bien qu'il soit possible de gérer le jeu à de multiples endroits (cela a déjà été fait avec succès), ce n'est pas recommandé en général parce que cela peut conduire à des conflits entre les composantes du logiciel et le moteur de mise au point.

source: There are several ways to measure backlash in ticks. Consult the documentation on your focuser or use the internet including the Indi Forum.
fr: Il existe plusieurs manières de mesurer le jeu en pas. Veuillez consulter la documentation de votre moteur de mise au point ou utiliser les ressources d'Internet, le forum d'Indi inclus.

source: There are several things to consider when working out how to deal with backlash:
fr: Il y a plusieurs points à considérer quand il s'agit de gérer le jeu :

source: <emphasis role="bold">No Backlash</emphasis>: If you are fortunate enough to have a setup with no backlash then it would make sense to set <guilabel>Driver Backlash</guilabel> and <guilabel>AF Overscan</guilabel> off (set to zero).
fr: <emphasis role="bold">Pas de jeu</emphasis> : si la chance est de votre côté et que votre équipement n'a pas de jeu, alors vous pourriez désactiver la <guilabel>compensation de jeu du pilote</guilabel> et le <guilabel>Balayage de mise au point automatique</guilabel> (mettre à 0).

source: <emphasis role="bold">Backlash Managed by Focuser</emphasis>: If your focuser had the ability to manage backlash itself then you can use this facility and turn <guilabel>Driver Backlash</guilabel> and <guilabel>AF Overscan</guilabel> off (set to zero). Alternatively, if it's possible, you could turn off the focuser's backlash facility and use either the Device Driver or AF Overscan to manage backlash.
fr: <emphasis role="bold">Jeu géré par le moteur de mise au point</emphasis> : si le moteur de mise au point possède la capacité de gérer le jeu nativement, alors vous pouvez utiliser cette fonctionnalité et désactivez la <guilabel>compensation de jeu du pilote</guilabel> et le <guilabel>Balayage de la mise au point automatique</guilabel> (réglé à zéro). Ou alors, faire le contraire en désactivant cette fonctionnalité du moteur de mise au point et utiliser soit le pilote de périphérique soit le balayage de la mise au point automatique pour gérer la compensation.

source: <emphasis role="bold">Backlash Managed by Device Driver</emphasis>: If your device driver has the ability to manage backlash then you can use this facility and turn off <guilabel>AF Overscan</guilabel> (set to zero). Alternatively, you could turn off the device driver's backlash facility and set <guilabel>AF Overscan</guilabel>.
fr: <emphasis role="bold">Jeu géré par le pilote du périphérique</emphasis> : si le pilote du périphérique possède la capacité de gérer le jeu lui-même, alors vous pouvez l'utiliser et désactiver le <guilabel>balayage de mise au point automatique</guilabel> (réglé à zéro). Ou alors faire le contraire en désactivant cette fonctionnalité du pilote et utiliser le <guilabel>balayage</guilabel>.
