Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_sidereal.po
Languages: fr

source: <title>Sidereal Time</title>
fr: <title>Temps sidéral</title>

source: <primary>Sidereal Time</primary>
fr: <primary>Temps sidéral</primary>

source: Hour Angle
fr: Angle horaire

source: <firstterm>Sidereal Time</firstterm> literally means <quote>star time</quote>. The time we are used to using in our everyday lives is Solar Time. The fundamental unit of Solar Time is a <firstterm>Day</firstterm>: the time it takes the Sun to travel 360 degrees around the sky, due to the rotation of the Earth. Smaller units of Solar Time are just divisions of a Day:
fr: Le <firstterm>temps sidéral</firstterm> signifie littéralement le <quote>temps des étoiles</quote>. Le temps que nous utilisons dans la vie quotidienne s'appelle le temps solaire. L'unité fondamentale du temps solaire est la <firstterm>journée</firstterm> : le temps nécessaire pour que le Soleil effectue une rotation de 360 degrés autour du ciel, dû à la rotation de la Terre. Les autres unités du temps solaire sont des divisions de la journée :

source: 1/24 Day = 1 Hour
fr: 1 / 24 jour = 1 heure

source: 1/60 Hour = 1 Minute
fr: 1 / 60 heure = 1 minute

source: 1/60 Minute = 1 Second
fr: 1 / 60 minute = 1 seconde

source: However, there is a problem with Solar Time. The Earth does not actually spin around 360 degrees in one Solar Day. The Earth is in orbit around the Sun, and over the course of one day, it moves about one Degree along its orbit (360 degrees/365.25 Days for a full orbit = about one Degree per Day). So, in 24 hours, the direction toward the Sun changes by about a Degree. Therefore, the Earth has to spin 361 degrees to make the Sun look like it has traveled 360 degrees around the Sky.
fr: Mais il y a un problème : en réalité la Terre n'effectue pas une rotation de 360 degrés en une journée solaire. La Terre orbite autour du Soleil et au cours d'une journée elle parcourt environ 1 degré le long de son orbite (360 / 365.25 = 1 degré par jour). Donc en 24 heures la direction face au Soleil change d'environ 1 degré. Résultat : la Terre doit effectuer une rotation de 361 degrés pour que le Soleil semble avoir parcouru 360 degrés dans le ciel.

source: In astronomy, we are concerned with how long it takes the Earth to spin with respect to the <quote>fixed</quote> stars, not the Sun. So, we would like a timescale that removes the complication of Earth's orbit around the Sun, and just focuses on how long it takes the Earth to spin 360 degrees with respect to the stars. This rotational period is called a <firstterm>Sidereal Day</firstterm>. On average, it is 4 minutes shorter than a Solar Day, because of the extra 1 degree the Earth spins in a Solar Day. Rather than defining a Sidereal Day to be 23 hours, 56 minutes, we define Sidereal Hours, Minutes and Seconds that are the same fraction of a Day as their Solar counterparts. Therefore, one Solar Second = 1.00278 Sidereal Seconds.
fr: En astronomie, on s'intéresse seulement à la durée de rotation de la Terre relativement aux étoiles <quote>fixes</quote> et non pas au Soleil. On désire alors une mesure du temps qui enraye la complication de l'orbite de la Terre autour du Soleil qui se charge uniquement de savoir combien de temps prend la Terre à effectuer une rotation de 360 degrés par rapport aux étoiles. Cette durée de rotation s'appelle une <firstterm>journée sidérale</firstterm>. En moyenne une journée sidérale est 4 minutes plus courte qu'une journée solaire, à cause du 1 degré de rotation terrestre supplémentaire dans la journée solaire. Au lieu de définir la journée sidérale comme étant de 23 heures 56 minutes, on définit l'heure sidérale, la minute sidérale et la seconde sidérale comme étant la même fraction d'une journée que leurs homonymes solaires. Donc, 1 seconde solaire = 1,00278 secondes sidérales.

source: The Sidereal Time is useful for determining where the stars are at any given time. Sidereal Time divides one full spin of the Earth into 24 Sidereal Hours; similarly, the map of the sky is divided into 24 Hours of <firstterm>Right Ascension</firstterm>. This is no coincidence; Local Sidereal Time (<acronym>LST</acronym>) indicates the Right Ascension on the sky that is currently crossing the <link linkend="ai-meridian">Local Meridian</link>. So, if a star has a Right Ascension of 05h 32m 24s, it will be on your meridian at LST=05:32:24. More generally, the difference between an object's <acronym>RA</acronym> and the Local Sidereal Time tells you how far from the Meridian the object is. For example, the same object at LST=06:32:24 (one Sidereal Hour later), will be one Hour of Right Ascension west of your meridian, which is 15 degrees. This angular distance from the meridian is called the object's <link linkend="ai-hourangle">Hour Angle</link>.
fr: Le temps sidéral est très utile pour déterminer où se trouvent les étoiles à un moment donné. Le temps sidéral divise une rotation complète de la Terre en 24 heures sidérales ; de la même manière, la carte du ciel est divisée en 24 heures d'<firstterm>ascension droite</firstterm>. Ce n'est pas une coïncidence ; l'heure locale sidérale (<acronym>HLS</acronym>) indique l'ascension droite qui traverse actuellement le <link linkend="ai-meridian">méridien local</link>. Donc si une étoile a une ascension droite de 05h 32m 24s, elle passera votre méridien à HLS = 05:32:24. En d'autres mots, la différence entre l'<acronym>AD</acronym> d'un objet et le temps HLS indique à quelle distance du méridien l'objet se trouve. Par exemple, ce même objet au temps HLS = 06:32:24 (une heure sidérale plus tard), se trouve à une heure d'ascension droite à l'ouest de votre méridien, c'est-à-dire 15 degrés. Cette distance angulaire entre l'objet et le méridien s'appelle l'<link linkend="ai-hourangle">angle horaire</link> de l'objet.

source: The Local Sidereal Time is displayed by &kstars; in the <guilabel>Time Info Box</guilabel>, with the label <quote>ST</quote> (you have to <quote>unshade</quote> the box by double-clicking it in order to see the sidereal time). Note that the changing sidereal seconds are not synchronized with the changing Local Time and Universal Time seconds. In fact, if you watch the clocks for a while, you will notice that the Sidereal seconds really are slightly shorter than the LT and UT seconds.
fr: L'heure locale sidérale dans &kstars; se trouve dans le <guilabel>Panneau d'information</guilabel>, sous l'appellation <quote>TS</quote> (vous devez <quote>dérouler</quote> la boîte en double-cliquant pour voir l'heure sidérale). Notez que le changement des secondes sidérales n'est pas synchronisé avec l'heure locale et l'heure universelle. En fait, si vous regardez les horloges quelque temps, vous remarquerez que les secondes sidérales sont plus courtes que les secondes HL et HU.

source: Point to the <link linkend="ai-zenith">Zenith</link> (press <keycap>Z</keycap> or select the <menuchoice><guimenu>Pointing</guimenu> <guimenuitem>Zenith</guimenuitem></menuchoice> menu item). The Zenith is the point on the sky where you are looking <quote>straight up</quote> from the ground, and it is a point on your <link linkend="ai-meridian">Local Meridian</link>. Note the Right Ascension of the Zenith: it is exactly the same as your Local Sidereal Time.
fr: Pointez sur le <link linkend="ai-zenith">zénith</link> en appuyant sur la touche <keycap>Z</keycap> ou sélectionnez <menuchoice><guimenu>Pointage</guimenu> <guimenuitem>Zénith</guimenuitem></menuchoice>. Le zénith est le point qui se trouve directement au-dessus de votre tête et est un point qui se trouve sur votre <link linkend="ai-meridian">méridien local</link>. Notez l'ascension droite du zénith : elle est égale à votre heure locale sidérale.
