Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_commands.po
Languages: fr

source: Opens <link linkend="ekos">Ekos</link>, a complete and powerful tool for astrophotography. With Ekos, you can align and guide your telescope, focus your CCD, and capture images using an easy intuitive interface.
fr: Ouvre <link linkend="ekos">Ekos</link>, un outil complet et puissant pour l'astrophotographie. Avec Ekos vous pouvez aligner et guider votre télescope, ajuster la mise au point de votre CCD et procéder à l'acquisition d'images en utilisant une interface facile et intuitive.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Jupiter's Moons</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Lunes de Jupiter</guimenuitem>

source: Opens the <link linkend="tool-jmoons">Jupiter Moons Tool</link>, which displays the positions of Jupiter's four brightest moons as a function of time.
fr: Ouvre l'outil <link linkend="tool-jmoons">Lunes de Jupiter</link> qui affiche la position des quatre Lunes de Jupiter les plus brillantes en fonction du temps.

source: <guimenu>Tools</guimenu> <guimenuitem>Flags</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Drapeaux</guimenuitem>

source: Opens the <guilabel>Flag manager</guilabel> Tool, which can be used to assign color labels and icons to the given positions on the sky chart.
fr: Ouvre l'outil de <guilabel>gestionnaires de drapeaux</guilabel> qui permet d'assigner des étiquettes de couleurs et des icônes à des positions données sur la carte du ciel.

source: Data Menu
fr: Menu Données

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Data</guimenu> <guimenuitem>Download New Data...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Données</guimenu> <guimenuitem>Télécharger de nouvelles données…</guimenuitem>

source: Open the <guilabel>Get Hot New Stuff</guilabel> dialog to download additional data for &kstars;.
fr: Ouvre la boîte de dialogue <guilabel>Obtenir les nouveautés</guilabel> pour télécharger de nouvelles données pour &kstars;.

source: <guimenu>Data</guimenu> <guimenuitem>Manage DSO Catalogs</guimenuitem>
fr: <guimenu>Données</guimenu> <guimenuitem>Gérer les catalogues du ciel profond (CP)</guimenuitem>

source: Open the <guilabel>DSO Catalogs</guilabel> dialog for manage the catalog database of &kstars;.
fr: Ouvre la boîte de dialogue <guilabel>Catalogue CP</guilabel> pour gérer la base de données des catalogues de &kstars;.

source: <guimenu>Data</guimenu> <guisubmenu>Updates</guisubmenu>
fr: <guimenu>Données</guimenu> <guisubmenu>Mises à jour</guisubmenu>

source: This submenu can be used to update various object data, namely asteroids, comets and satellites orbital elements as well as recent supernovae data from the Internet. The data will be downloaded for the current user account only. If you use &kstars; from different account you should download them for every account separately.
fr: Ce sous-menu permet de mettre à jour à partir d'Internet les données d'objets divers, nommément les astéroïdes, les comètes, les éléments orbitaux de satellites ainsi que les données des supernova récentes. Les données seront téléchargées uniquement pour le compte de l'utilisateur courant. Si vous utilisez &kstars; sur plusieurs comptes, vous devrez télécharger ces données pour chaque compte séparément.

source: &kstars; tries to download recent supernovae list automatically by default. You can switch the download off using <guilabel>Supernovae</guilabel> page of &kstars; Settings window.
fr: &kstars; essaie par défaut de télécharger automatiquement la liste des supernova récente. Vous pouvez désactiver le téléchargement dans la page <guilabel>Supernova</guilabel> de &kstars;.

source: Observation Menu
fr: Menu Observation

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut> <guimenu>Observation</guimenu> <guimenuitem>Observation Planner</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Observation</guimenu> <guimenuitem>Planificateur d'observations</guimenuitem>

source: Open the <link linkend="tool-obsplanner">Observation Planner</link> tool.
fr: Ouvre l'outil de <link linkend="tool-obsplanner">planificateur d'observations</link>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo></shortcut> <guimenu>Observation</guimenu> <guimenuitem>Execute the Session Plan...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> </shortcut> <guimenu>Observation</guimenu> <guimenuitem>Exécuter le plan de session…</guimenuitem>

source: Opens <link linkend="tool-obsplanner">session plan wizard</link> or execute the planned session.
fr: Ouvre l'outil d'<link linkend="tool-obsplanner">assistant de plan de session</link> ou exécute la session planifiée.

source: <guimenu>Observation</guimenu> <guimenuitem>Polaris Hour Angle...</guimenuitem>
fr: <guimenu>Observation</guimenu> <guimenuitem>Angle horaire polaire…</guimenuitem>

source: Opens the <guilabel>Polaris Hour Angle</guilabel> tool.
fr: Ouvre l'outil <guilabel>Angle horaire polaire</guilabel>.

source: Settings Menu
fr: Menu Configuration

source: <guimenu>Settings</guimenu> <guisubmenu>Info Boxes</guisubmenu>
fr: <guimenu>Configuration</guimenu> <guisubmenu>Boîtes d'informations</guisubmenu>

source: A submenu that lists the different info boxes.
fr: Un sous-menu qui liste les différentes boîtes d'informations.

source: Show Info Boxes
fr: Afficher les boîtes d'informations

source: Toggle display of all three Info Boxes:
fr: (Dés)active l'affichage des trois boîtes d'informations :

source: Time Box
fr: Heure

source: Focus Box
fr: Mise au point

source: Location Box
fr: Position

source: Show Time Box
fr: Afficher la boîte d'heure

source: Toggle display of the Time Info Box. By default, the Time Info Box is located in the top left side of the screen. You can change the position of Time Info Box by holding the left-click mouse button and dragging it to the new position.
fr: (Dés)active l'affichage de la boîte d'informations de l'heure. Par défaut, cette boîte est placée en haut à gauche de l'écran. Vous pouvez modifier sa position en gardant le bouton gauche de la souris appuyé et en la déplaçant à sa nouvelle position.

source: Show Focus Box
fr: Affiche la boîte de mise au point

source: Toggle display of the Focus Info Box. By default, the Focus Info Box is located in the top right side of the screen. You can change the position of Focus Info Box by holding the left-click mouse button and dragging it to the new position.
fr: (Dés)active l'affichage de la boîte d'information de la mise au point. Par défaut, cette boîte est placée en haut à droite de l'écran. Vous pouvez modifier sa position en gardant le bouton gauche de la souris appuyé et en la déplaçant vers sa nouvelle position.

source: Show Location Box
fr: Affiche la boîte de position

source: Toggle display of the Location Info Box. By default, the Location Info Box is located in the bottom left side of the screen. You can change the position of Location Info Box by holding the left-click mouse button and dragging it to the new position.
fr: (Dés)active la boîte d'information de la position. Par défaut, cette boîte est placée en haut à droite de l'écran. Vous pouvez modifier sa position en gardant le bouton gauche de la souris appuyé et en la déplaçant vers sa nouvelle position.

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu>
fr: <guimenu>Configuration</guimenu> <guisubmenu>Barre d'outils affichées</guisubmenu>

source: A submenu that lists the different toolbars.
fr: Un sous-menu qui liste les différentes barres d'outils.

source: Main Toolbar
fr: Barre principale

source: Toggle display of the Main Toolbar. By default, the Main Toolbar provides useful shortcuts for controlling the sky map view (&ie; Zoom in and Zoom out) and for controlling &kstars; clock as well. You can Start / Stop the clock, advance one step backward / forward in time and also you can easily set the time step used by &kstars;' clock. The time step is the rate at which time flows in the simulation. For setting the time step, you can use the spin box used for establishing the time step units and the spin box used for increasing / decreasing the time step value. Using the Main Toolbar you can quickly open the <guilabel>Find Object</guilabel>, <guilabel>Set Time</guilabel> or <guilabel>Set Geographic Location</guilabel> window. Main Toolbar can be configured using the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> menu item.
fr: (Dés)active l'affichage de la barre principale. Par défaut, la barre principale fournit des raccourcis utiles pour contrôler la vue de la carte du ciel (c'est-à-dire Zoom avant et Zoom arrière) et aussi pour contrôler l'horloge de &kstars;. Vous pouvez Démarrer/Arrêter l'horloge, avancer ou reculer d'un pas temporel et aussi facilement régler l'heure utilisée par &kstars;. Le pas temporel correspond au taux de temps dans la simulation. Pour régler le pas de temps, vous pouvez utiliser la boîte des unités de temps et celle des valeurs d'un pas temporel. La barre principale permet également de rapidement ouvrir les fenêtres <guilabel>Trouver un objet</guilabel>, <guilabel>Régler l'horloge</guilabel> ou encore <guilabel>Régler la position géographique</guilabel>. Cette barre principale peut être configurée en utilisant le menu <menuchoice><guimenu>Configuration</guimenu><guimenuitem>Barres d'outils affichées</guimenuitem></menuchoice>.

source: View Toolbar
fr: Barre d'outils Affichage

source: Toggle display of the View Toolbar. View Toolbar controls which sky objects are drawn on &kstars; Sky Map (stars, deep sky objects, Solar system objects, supernovae or satellites) as well as what constellation information is included (constellation lines, constellation names, constellation art or constellation boundaries). It also provides icon shortcuts for: showing milky way (drawn with dark grey color), showing equatorial/horizontal coordinate grid and for showing the green opaque ground. Note that when the horizon is switched off, refraction effects are temporarily disabled. View Toolbar can be configured using the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> menu item.
fr: (Dés)active l'affichage de la barre d'outils Affichage. Elle contrôle quels objets sont dessinés sur la carte du ciel de &kstars; (étoiles, objets du ciel profond, objets du système solaire, supernova ou satellites) ainsi que l'information au sujet des constellations à inclure (les lignes de constellations et leur limite, leur nom et leur type de culture céleste). Elle fournit également des raccourcis d'icône pour afficher la Voie Lactée (de couleur grise foncée), pour afficher les grilles équatoriales et azimutales et aussi pour afficher un terrain opaque vert. Veuillez noter que lorsque l'horizon est désactivé, les effets de réfaction sont temporairement désactivés. Cette barre d'outil peut être configurée en utilisant le menu <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Barres d'outils affichées</guimenuitem></menuchoice>.

source: INDI Toolbar
fr: Barre d'outils INDI

source: Toggle display of the INDI Toolbar. By default, INDI Toolbar contains five shortcut icons:
fr: (Dés)active l'affichage de la barre d'outil INDI. Par défaut, la barre d'outils INDI contient cinq icônes de raccourci :

source: Toggle Ekos
fr: (Dés)active la barre d'outil Ekos

source: Toggle INDI Control Panel
fr: (Dés)active le tableau de bord INDI

source: Toggle FITS Viewer
fr: (Dés)active l'afficheur FITS

source: Toggle Sensor FOV
fr: (Dés)active le capteur « FOV »

source: Toggle Lock Telescope Center
fr: (Dés)active le verrouillage du centre du télescope

source: INDI Toolbar can be configured using the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> menu item.
fr: La barre d'outil INDI peut être configurée en utilisant <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Barres d'outils affichées</guimenuitem></menuchoice>.

source: Telescope Toolbar
fr: Barre d'outil Télescope

source: Toggle display of the Telescope Toolbar. By default, Telescope Toolbar contains seven shortcut icons:
fr: (Dés)active l'affichage de la barre d'outil Télescope. Par défaut cette barre d'outils contient sept icônes de raccourci :

source: Toggle Mount Control Panel
fr: (Dés)active le tableau de bord de la monture

source: Toggle Telescope Tracking
fr: (Dés)active le suivi du télescope

source: Slew telescope to the focused object
fr: Pivote le télescope vers l'objet centré

source: Sync telescope to the focused object
fr: Synchronise le télescope vers l'objet centré

source: Park telescope
fr: Parquer le télescope

source: Unpark telescope
fr: Déparquer le télescope

source: Abort telescope motions
fr: Annuler le mouvement du télescope

source: Telescope Toolbar can be configured using the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> menu item.
fr: La barre d'outils du télescope peut être configurée en utilisant <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Affichage des barres d'outils…</guimenuitem></menuchoice>

source: Dome Toolbar
fr: Barre d'outils du dôme

source: Toggle display of the Dome Toolbar. By default, Dome Toolbar contains two shortcut icons:
fr: (Dés)active l'affichage de la barre d'outils du dôme. Par défaut cette barre d'outils contient deux icônes de raccourci :

source: Park dome
fr: Parquer le dôme

source: Unpark dome
fr: Déparquer le dôme

source: Dome Toolbar can be configured using the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> menu item.
fr: La barre d'outils du dôme peut être configurée en utilisant <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Affichage des barres d'outils…</guimenuitem></menuchoice>.

source: <guimenu>Settings</guimenu> <guisubmenu>Statusbar</guisubmenu>
fr: <guimenu>Configuration</guimenu> <guisubmenu>Barre d'état</guisubmenu>

source: A submenu that lists the different statusbars.
fr: Un sous-menu listant les différentes barres d'état.

source: Show Statusbar
fr: Afficher la barre d'état

source: Toggle display of the Statusbar. It is located in the bottom of &kstars; window.
fr: (Dés)active l'affichage de la barre d'état. Elle est placée en bas de la fenêtre de &kstars;.

source: Show Az/Alt Field
fr: Afficher le champ Az/Alt

source: Toggle display of the mouse cursor's horizontal coordinates in the statusbar.
fr: (Dés)active l'affichage des coordonnées azimutales du pointeur de la souris dans la barre d'état.

source: Show RA/Dec Field
fr: Afficher le champ AD/DEC

source: Toggle display of the mouse cursor's equatorial coordinates in the statusbar.
fr: (Dés)active l'affichage des coordonnées équatoriales du pointeur de la souris dans la barre d'état.

source: Show J2000.0 RA/Dec Field
fr: Afficher le champ J2000.0 AD/DEC

source: Toggle display of the mouse cursor's equatorial J2000 coordinates in the statusbar.
fr: (Dés)active l'affichage des coordonnées équatoriales J2000 du pointeur de la souris dans la barre d'état.

source: <guimenu>Settings</guimenu> <guisubmenu>Themes</guisubmenu>
fr: <guimenu>Configuration</guimenu> <guisubmenu>Thèmes</guisubmenu>

source: Lists the available Theme items.
fr: Liste les différents thèmes disponibles.

source: <guimenu>Settings</guimenu> <guisubmenu>Color Schemes</guisubmenu>
fr: <guimenu>Configuration</guimenu> <guisubmenu>Modèles de couleurs</guisubmenu>

source: This submenu contains all of the defined color schemes: Classic, Star Chart, Night Vision and Moonless Night. It can also include your custom color schemes. Select any item to set that color scheme.
fr: Ce sous-menu contient tous les modèles de couleurs : Classique, Carte d'étoiles, Vision nocturne et Nuit sans Lune. Elle peut aussi inclure vos propres modèles de couleurs. En sélectionnant un élément, le modèle de couleur se met en place.

source: <guimenu>Settings</guimenu> <guisubmenu>FOV Symbols</guisubmenu>
fr: <guimenu>Configuration</guimenu> <guisubmenu>Indicateurs de champ de vision</guisubmenu>

source: This submenu lists the available field-of-view (FOV) Symbols. The FOV Symbol is drawn at the center of the display. You may choose one or more from the list of predefined symbols (7x35 Binoculars, Telrad, One Degree, HST WFPC2 or 30m at 1.3cm) by checking their specific checkbox, or you may use no symbol by unchecking all the items from the symbols list. You can also define your own symbols (or modify existing symbols) using the <guimenuitem>Edit FOV Symbols...</guimenuitem> menu item.
fr: Cette liste de sous-menu répertorie les indicateurs de champ de vision (FOV) disponibles. L'indicateur de champ de vision est dessiné au centre de l'affichage. Vous pouvez choisir depuis la liste des indicateurs prédéfinis (Jumelles 7x35, Telrad, Un degré, HST WFPC2 ou 30m à 1,3cm) en cochant leur case ou vous pouvez n'en utiliser aucun en décochant toutes les cases. Vous pouvez définir vos propres indicateurs (ou modifier les indicateurs existants) en utilisant l'élément <guimenuitem>Modifier les indicateurs de champ de vision…</guimenuitem>.

source: <guimenu>Settings</guimenu> <guisubmenu>Artificial Horizon...</guisubmenu>
fr: <guimenu>Configuration</guimenu> <guisubmenu>Horizon artificiel…</guisubmenu>

source: If you select this submenu, then Artificial Horizon Manager will be opened. Artificial Horizon Manager is used to define on the skymap one or more regions that are blocked from view from your current location (&ie; tall trees or building). The window is split in two sections: in the left side is the Regions section while in the right side is the Points section. You can add a new region by pressing the <guibutton>+</guibutton> (Add Region) button or you can remove a region by selecting it in the regions list and then pressing the <guibutton>-</guibutton> (Remove Region) button. In order to draw a region you need to define a list of points that encompasses the blocked area. You can add a new point by pressing the <guibutton>+</guibutton> (Add Point) button from the right Points section. You can also remove a highlighted point from the list of points or you can clear all the points. There are two ways to add a new point to a selected region: manually by entering the point's coordinates or by selecting the point from the skymap after clicking <guibutton>Select Points</guibutton> button. Note that each point is described by a set of horizontal coordinates: Az (Azimuth) and Alt (Altitude). If you want to modify a point's coordinates, just double click on its Az/Alt text box value and enter the new value. First and Last points must be on the horizon. Polygons must be closed to be considered valid regions. Artificial Horizon Manager provides a easy way to rename your regions. By default, regions are named as: <quote>Region </quote> plus an index (&ie; <quote>Region 1</quote> or <quote>Region 2</quote>). For renaming a region, just double click on its name and then you will be invited to complete a new region name. You can also control which regions are enabled or disabled for marking on the map by a simple click on the checkbox in front of each region. After you defined your desired regions you can apply them by pressing the <guibutton>Apply</guibutton> button. If you want to use these regions again, in further astronomy sessions, you can save them such that next time when you will open &kstars; they will be automatically marked on the skymap.
fr: Si vous sélectionnez ce sous-menu, alors la fenêtre du gestionnaire d'horizon artificiel s'ouvrira. Il permet de définir une ou plusieurs zones sur la carte du ciel qui sont masquées depuis votre position actuelle (c'est-à-dire par des grands arbres ou des immeubles). La fenêtre est séparée en deux parties : sur la partie gauche se trouve la section Régions et sur la partie droite la section Points. Vous pouvez ajouter une zone en appuyant sur le bouton <guibutton>+</guibutton> (ajouter Région) ou vous pouvez en supprimer une en la choisissant dans la liste et appuyer sur le bouton <guibutton>-</guibutton> (Supprimer Région). Afin de dessiner une région, il faut définir une liste de points qui l'entoure. Vous pouvez ajouter un nouveau point en cliquant sur le bouton <guibutton>+</guibutton> (Ajouter Point) de la section de droite. Vous pouvez également supprimer un point sélectionné de la liste de points ou effacer tous les points. Il y a deux manières d'ajouter un point à une région sélectionnée : en indiquant manuellement les coordonnées du point ou en sélectionnant le point de la carte du ciel après avoir cliqué sur le bouton <guibutton>Sélectionner Point</guibutton>. Veuillez noter que chaque point est décrit par des coordonnées horizontales : Az (Azimut) et Alt (Altitude). Si vous souhaitez modifier les coordonnées d'un point, il suffit de double-cliquer sur sa valeur Az/Alt dans la boîte et indiquer de nouvelles valeurs. Le premier et le dernier point doivent se trouver sur l'horizon. Les polygones doivent être fermés pour être considérés comme des régions valables. Le gestionnaire d'horizon artificiel fournit un moyen simple pour renommer vos régions. Par défaut, les régions sont nommées : <quote>Région</quote> plus un index (c'est-à-dire <quote>Région 1</quote> ou <quote>Région 2</quote>). Pour renommer une région, il suffit de double-cliquer sur son nom et vous serez invité à saisir un nouveau nom. Vous pouvez aussi contrôler l'affichage de ces régions sur la carte du ciel par un simple clic sur la case à cocher en face de chaque région. Après avoir défini vos régions, vous pouvez les appliquer en cliquant sur le bouton <guibutton>Appliquer</guibutton>. Si vous souhaitez réutiliser ces régions dans une session ultérieure, vous pouvez les enregistrer afin qu'au prochain lancement de &kstars; elles seront automatiquement affichées sur la carte du ciel.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Manage Observer...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo> </shortcut> <guimenu>Configuration</guimenu> <guimenuitem> Gérer l'observateur…</guimenuitem>

source: Selecting this will open Manage Observers window that enables you to register a number of observers which are using &kstars; on this computer. You can add a new entry to observers list by completing the mandatory fields: <guilabel>Name:</guilabel> and <guilabel>Surname:</guilabel> and then pressing the <guibutton>+</guibutton> (Add observer) button. Note that <guilabel>Contact:</guilabel> field is optional, &kstars; allowing you to add a new observer even though <guilabel>Contact:</guilabel> text box is empty. You can also remove an observer from the list using <guibutton>-</guibutton> (Remove observer) button.
fr: En sélectionnant ceci vous ouvrirez la fenêtre de gestion d'observateur qui permet de répertorier les observateurs qui utilisent &kstars; sur cette ordinateur. Vous pouvez saisir un nouvel observateur en complétant les champs requis : <guilabel>Nom</guilabel> et <guilabel>Prénom</guilabel> et valider en cliquant sur le bouton <guibutton>+</guibutton> (Ajouter Observateur). Veuillez noter que le champ <guilabel>Contact</guilabel> est facultatif. Vous pouvez supprimer un observateur en cliquant sur le bouton <guibutton>-</guibutton> (Supprimer Observateur).
