Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos.po
Languages: fr

source: <emphasis role="bold">Ekos</emphasis> is an advanced cross-platform (&Windows;, &MacOS;, &Linux;) observatory control and automation tool with a particular focus on Astrophotography. It is based on a modular extensible framework to perform common astrophotography tasks. This includes highly accurate GOTOs using astrometry solver, ability to measure <emphasis>and</emphasis> correct polar alignment errors, auto-focus &amp; auto-guide capabilities, and capture of single or stack of images with filter wheel support. Ekos is shipped with &kstars;.
fr: <emphasis role="bold">Ekos</emphasis> est un outil multi-plate-forme (&Windows;, &MacOS; et &Linux;) avancé de contrôle d'observatoire et d'automatisation avec un intérêt particulier pour l'astrophotographie. Il est fondé sur un cadre modulaire et extensible pour réaliser les tâches courantes d'astrophotographie. Cela inclut du pointage GOTO hautement précis grâce au résolveur astrometry.net, la possibilité de mesurer <emphasis>et</emphasis> de corriger les erreurs d'alignement polaire, la mise au point et le guidage automatique ainsi que l'acquisition d'images simples ou multiples avec gestion de roue à filtres. Ekos est distribué avec &kstars;.

source: Ekos introductory video
fr: Vidéo d'introduction à Ekos

source: Features:
fr: Fonctionnalités :

source: Control your telescope, Camera (&amp; DSLRs), filter wheel, focuser, guider, adaptive optics unit, and any INDI-compatible auxiliary device from Ekos.
fr: Contrôle de télescope, de caméra (&amp; APN), de roue à filtres, de moteur de mise au point, de guide, de périphérique d'optique adaptative et de tout périphérique compatible avec le protocole INDI (Instrument Neutral Distributed Interface) directement depuis Ekos.

source: <emphasis>Built-in</emphasis> native <link linkend="ekos-guide">autoguiding</link> with support for automatic dithering between exposures and support for Adaptive Optics devices in addition to traditional guiders.
fr: <link linkend="ekos-guide">Guidage automatique</link> natif <emphasis>intégré</emphasis> avec gestion automatique de décalage entre les expositions ainsi que gestion pour les périphériques d'optique adaptative en complément des guides traditionnels.

source: <ulink url="https://knro.blogspot.com/2013/10/demo-of-ekos-alignment-module.html">Extremely accurate GOTOs</ulink> using astrometry.net solver (both Online and Offline solvers supported).
fr: <ulink url="https://knro.blogspot.com/2013/10/demo-of-ekos-alignment-module.html">GOTO extrêmement précis</ulink> grâce à l'utilisation du résolveur astrometry.net (mode en-ligne et hors-ligne gérés).

source: Load &amp; Slew: Load a FITS image, slew to solved coordinates, and center the mount on the exact image coordinates in order to get the same desired frame.
fr: Charger &amp; Pivoter : chargement d'une image FITS, pivotement vers les coordonnées résolues et centrage de la monture sur les coordonnées exactes de l'image afin d'obtenir le même champ.

source: Measure &amp; Correct Polar Alignment errors using astrometry.net solver.
fr: Mesure et correction des erreurs d'alignement polaire en utilisant le résolveur astrometry.net.

source: Easy to use Polar Alignment Assistant tool. A very quick and reliable tool to polar align your German Equatorial Mount!
fr: Un outil d'alignement polaire assisté facile à utiliser. Un outil très rapide et fiable pour réaliser un alignement polaire précis d'une monture équatoriale allemande !

source: Capture and record <ulink url="https://www.youtube.com/watch?v=OJFZWwlAQRM">video streams in SER format</ulink>.
fr: Acquisition et enregistrement des <ulink url="https://www.youtube.com/watch?v=OJFZWwlAQRM">vidéos au format SER</ulink>.

source: Completely <ulink url="https://www.youtube.com/watch?v=85L3J_iiXZ4">automated scheduler</ulink> to control all your observatory equipment, select the best targets for imaging given current conditions and constraints, monitor weather conditions, and capture your data while you are away!
fr: <ulink url="https://www.youtube.com/watch?v=85L3J_iiXZ4">Ordonnanceur complètement automatisé</ulink> pour contrôler l'intégralité du matériel, et permettant de sélectionner des cibles d'acquisition tout en définissant des contraintes sur les conditions météorologiques. Réalisez vos acquisitions de données même lorsque vous êtes absent !

source: <emphasis>Smart</emphasis> Dark Library: All your dark frames with different binning/temperature/frame settings are saved for future use. Ekos re-uses dark frames intelligently without taking unnecessary captures. You can configure how long you want to reuse all the dark frames.
fr: Bibliothèque <emphasis>intelligente</emphasis> de Dark : toutes les trames de Dark de combinaisons de groupement de pixels et de température différents sont enregistrées pour des usages futurs. Ekos réutilise intelligemment ces trames pour éviter des acquisitions inutiles. La durée d'exploitation des ces trames peut être réglée.

source: Define multiple driver profiles for local and remote setups. Switch among them easily.
fr: Définition de multiples profils de matériel pour des configurations locales et à distance. Passer facilement d'un profil à l'autre.

source: Auto and manual focus modes using Half-Flux-Radius (HFR) method.
fr: Modes de mise au point automatique et manuelle en utilisant la méthode HFR (Half-Flux-Radius).

source: <ulink url="https://www.youtube.com/watch?v=stsrcsPxUZA">Automated <emphasis>unattended</emphasis> meridian flip</ulink>. Ekos performs post meridian flip alignment, calibration, focusing, and guiding to resume the capture session.
fr: <ulink url="https://www.youtube.com/watch?v=stsrcsPxUZA">Retournement au méridien automatisé et <emphasis>non surveillé</emphasis></ulink>. Ekos réalise automatiquement un alignement après le retournement au méridien, la calibration, la mise au point automatique et le guidage afin de reprendre la session d'acquisition.

source: Automatic focus between exposures when a user-configurable HFR limit is exceeded.
fr: Mise au point automatique entre expositions quand la limite HFR déterminée par l'utilisateur dépasse une certaine limite.

source: Powerful sequence queue for batch capture of images with optional prefixes, timestamps, filter wheel selection, and much more!
fr: Puissante gestion de séquences d'acquisition par lots avec l'ajout facultatif de préfixes, d'horodatage, de sélection de roue à filtres et bien plus encore !

source: Export and import sequence queue sets as Ekos Sequence Queue (<literal role="extension">.esq</literal>) files.
fr: Exportation et importation d'ensembles de file d'attente de séquences comme des fichiers de séquences Ekos d'extension <literal role="extension">.esq</literal>.

source: <ulink url="https://www.youtube.com/watch?v=fg2HDFg_dCE">Center the telescope anywhere in a captured FITS image</ulink> or any FITS with World Coordinate System (WCS) header.
fr: <ulink url="https://www.youtube.com/watch?v=fg2HDFg_dCE">Centrer le télescope n'importe où dans une image FITS</ulink> ou n'importe quelle image FITS avec une en-tête « WCS » (World Coordinate System).

source: Automatic flat field capture, just set the desired ADU and let Ekos does the rest!
fr: Acquisition automatique des images de plage de lumière uniforme (PLU ou « Flat Field » en anglais). Définissez le pas de quantification souhaité (ADU ou « Analog Digital Unit » en anglais) et laissez Ekos faire le reste !

source: Automatic abort and resumption of exposure tasks if guiding errors exceed a user-configurable value.
fr: Annulation et reprise automatique des tâches d'expositions si les erreurs de guidage dépassent une valeur configurable par l'utilisateur.

source: Support for dome slaving.
fr: Gestion des dômes.

source: Complete integration with &kstars; Observation Planner and SkyMap.
fr: Intégration complète avec le planificateur d'observations de &kstars; et la carte du ciel.

source: Fully scriptable via <ulink url="https://freedesktop.org/wiki/Software/dbus/">&DBus;</ulink>.
fr: Complètement contrôlable programmatiquement via <ulink url="https://freedesktop.org/wiki/Software/dbus/">&DBus;</ulink>.

source: Integrate with all INDI native devices.
fr: Intégration native avec tous les périphériques INDI.
