Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-capture.po
Languages: fr

source: You can add as many jobs as desired. While it is not strictly necessary, it is preferable to add the dark and flat jobs after the light frames. Once you are done adding jobs, simply click <guilabel>Start Sequence</guilabel> <inlinemediaobject><imageobject><imagedata fileref="media-playback-start.png" format="PNG"/></imageobject></inlinemediaobject> to begin executing the jobs. A job state changes from <guilabel>Idle</guilabel> to <guilabel>In Progress</guilabel> and finally to <guilabel>Complete</guilabel> once it is done. The Sequence Queue automatically starts the next job. If a job is aborted, it may be resumed again. To pause a sequence, click the pause button <inlinemediaobject><imageobject><imagedata fileref="media-playback-pause.png" format="PNG"/></imageobject></inlinemediaobject> and the sequence will be stopped after the current capture is complete. To reset the status of all the jobs, simply click the reset button <inlinemediaobject><imageobject><imagedata fileref="view-refresh.png" format="PNG"/></imageobject></inlinemediaobject>. Please beware that all image progress counts are reset as well. To preview an image in &kstars; FITS Viewer, click the <guibutton>Preview</guibutton> button.
fr: Vous pouvez ajouter autant de tâches que désirées. Bien que cela ne soit pas strictement nécessaire, il est préférable d'ajouter les tâches d'acquisition de Dark et de Flat après celles de Light. Une fois que vous avez terminé d'ajouter des tâches, cliquez simplement sur le bouton <guibutton>Démarrer séquence</guibutton> <inlinemediaobject><imageobject><imagedata fileref="media-playback-start.png" format="PNG"/></imageobject></inlinemediaobject> pour débuter l'exécution des tâches. L'état d'une tâche passe de <guilabel>Inactif</guilabel> à <guilabel>En progrès</guilabel> et enfin <guilabel>Complété</guilabel> une fois terminée. La file d'attente des séquences démarre ensuite automatiquement la prochaine tâche. Si une tâche est interrompue, elle peut être reprise. Pour mettre une tâche en pause, cliquez sur le bouton <inlinemediaobject><imageobject><imagedata fileref="view-refresh.png" format="PNG"/></imageobject></inlinemediaobject> et la tâche sera arrêtée <emphasis role="bold">après que l'acquisition en cours soit terminée</emphasis>. Pour réinitialiser l'état de toutes les tâches, cliquez simplement sur le bouton de réinitialisation <inlinemediaobject><imageobject><imagedata fileref="view-refresh.png" format="PNG"/></imageobject></inlinemediaobject>. Veuillez noter que cela réinitialise également le compteur de progression de toutes les images. Pour afficher un aperçu d'une image dans l'afficheur FITS de &kstars;, cliquez sur le bouton <guibutton>Aperçu</guibutton>.

source: Sequence queues can be saved as an &XML; file with extension <literal role="extension">.esq</literal> (Ekos Sequence Queue). To load a sequence queue, click the open document button <inlinemediaobject><imageobject><imagedata fileref="document-open.png" format="PNG"/></imageobject></inlinemediaobject>. Please note that it will replace any current sequence queues in Ekos.
fr: Les séquences peuvent être enregistrées dans un fichier au format &XML; d'extension <literal role="extension">.esq</literal> (Ekos Sequence Queue). Pour charger une séquence, cliquez sur le bouton <inlinemediaobject><imageobject><imagedata fileref="document-open.png" format="PNG"/></imageobject></inlinemediaobject>. Veuillez noter que cela <emphasis>remplacera</emphasis> toute séquence déjà dans la file d'attente d'Ekos.

source: <emphasis role="bold">Job Progress</emphasis>: Ekos is designed to execute and resume the sequence over multiple nights if required. Therefore, if <guilabel>Remember Job Progress</guilabel> option is enabled in <link linkend="ekos">Ekos Options</link>, Ekos shall scan the file system to count how many images are already completed and will resume the sequence from where it was left off. If this default behavior is not desired, simply turn off <guilabel>Remember Job Progress</guilabel> under options.
fr: <emphasis role="bold">Progression des tâches</emphasis> : Ekos est conçu pour exécuter les séquences sur plusieurs nuits si nécessaire. Ainsi, si l'option <guilabel>Se rappeler de la progression des tâches</guilabel> est activée dans les <link linkend="ekos">options d'Ekos</link>, Ekos fera un scan du système de fichiers pour déterminer le nombre d'images déjà présentes et terminées et reprendra la séquence au point où il s'était arrêté. Si ce n'est pas le comportement désiré, vous pouvez simplement désactiver cette option.

source: To edit a job, double click it. You will notice the add button <inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject> now changed to check mark button <inlinemediaobject><imageobject><imagedata fileref="dialog-ok-apply.png" format="PNG"/></imageobject></inlinemediaobject>. Make your changes on the left-hand side of the CCD module and once done, click on the check mark button. To cancel a job edit, click anywhere on the empty space within the sequence queue table.
fr: Pour modifier une tâche, il faut double cliquer sur son nom. Remarquez comment le bouton d'ajout <inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject> s'est modifié en un bouton coché <inlinemediaobject><imageobject><imagedata fileref="dialog-ok-apply.png" format="PNG"/></imageobject></inlinemediaobject>. Faites vos changements dans le panneau gauche du module CCD et ensuite cliquez sur la coche pour appliquer. Pour annuler la modification, cliquez n'importe où dans un espace vide de la table de séquences.

source: <emphasis role="bold">Editing running jobs</emphasis>: When Capture is running, or when the Scheduler is running, you cannot edit the sequence queue or a .esq file on disk using the Capture tab. However, the scheduler tab does have a Capture Sequence Editor tool that can be used to edit .esl files on disk, or create new ones.
fr: <emphasis role="bold">Modification des tâches actives</emphasis> : quand une acquisition est en cours ou quand l'ordonnanceur est actif, vous ne pouvez pas modifier la file de séquences ou un fichier .esq dans l'onglet d'acquisition. Toutefois, il existe un outil dans l'onglet de l'ordonnanceur qui permet de modifier les fichiers .esl ou en créer de nouveaux.

source: If your camera supports live video feed, then you can click the <guibutton>Live Video</guibutton> button to start streaming. The video stream window enables recording and subframing of the video stream. For more information, check the video below:
fr: Si votre caméra gère les vidéos en direct, vous pouvez cliquer sur le bouton <guilabel>Vidéo en direct</guilabel> pour débuter la diffusion en continu. La fenêtre de diffusion permet l'enregistrement et l'extraction de trames de la vidéo.

source: Recording feature
fr: Fonctionnalité d'enregistrement

source: The live view also provides a graphical overlay tool to aid in collimation. This is toggled on/off by the crosshair button.
fr: La vue « Live view » fournit un outil de superposition d'images très utile pour la collimation. Le bouton en croix permet de le (dés)activer.

source: Collimation overlay
fr: Superposition de la collimation

source: The overlay options button opens a dialog that allows arbitrary and flexible creation of ellipses (including circles), rectangles and lines, as well as anchor points which act as global drawing offsets. Each defined element has its own size, offset, repetition, thickness and color (including transparency).
fr: Ce bouton ouvre une fenêtre où il est possible de définir de manière flexible des ellipses (cercles inclus), des rectangles et des lignes de toutes tailles, d'agir sur des points d'ancrages permettant de régler les effets de dessin. Chaque élément possède sa propre taille, ses décalages, ses répétitions et ses largeurs de traits et de couleurs (transparence inclue).

source: Collimation overlay options
fr: Options pour la superposition de la collimation

source: FITS Viewer
fr: Afficheur FITS

source: Captured images are displayed in &kstars; FITS Viewer, and also in the summary screen. Set options related to how the images are displayed in the viewer.
fr: Les images sont affichées dans l'afficheur FITS de &kstars; ainsi que dans l'écran de résumé. Vous pouvez spécifier les options d'affichage de l'afficheur.

source: <guilabel>Auto Dark</guilabel>: You can capture an image and auto dark subtract it by checking this option. Note that this option is only applicable when using <guilabel>Preview</guilabel>, you cannot use it in batch mode sequence queue.
fr: <guilabel>Dark automatique</guilabel> : vous pouvez soustraire automatiquement un Dark d'une image en cochant cette option. Veuillez noter que cette option n'est disponible que lors de l'utilisation de l'<guilabel>aperçu</guilabel>. Il n'est pas possible de l'utiliser en mode traitements par lots.

source: <guilabel>Effects</guilabel>: Image enhancement filter to be applied to the image after capture.
fr: <guilabel>Effets</guilabel> : filtre d'amélioration d'une image à appliquer après son acquisition.

source: <title>Rotator Settings</title>
fr: <title>Réglages du rotateur</title>

source: <screeninfo>Rotator Settings</screeninfo>
fr: <screeninfo>Réglages du rotateur</screeninfo>

source: <phrase>Rotator Settings</phrase>
fr: <phrase>Réglages du rotateur</phrase>

source: Field Rotators are supported in INDI &amp; Ekos. The rotator angle is the raw angle reported by the rotator and is not necessary the <ulink url="https://en.wikipedia.org/wiki/Position_angle">Position Angle</ulink>. A Position Angle of <emphasis>zero</emphasis> indicates that the frame top (indicated by small arrow) is pointing <emphasis>directly</emphasis> at the pole. The position angle is expressed as E of N (East of North), so 90 degrees PA indicates the frame <emphasis>top</emphasis> points 90 degrees away (counter-clockwise) from the pole. Check <ulink url="https://nustarsoc.caltech.edu/NuSTAR_Public/NuSTAROperationSite/file/NuSTAR-PA.pdf">examples</ulink> for various PAs.
fr: Les rotateurs de champs sont gérés par INDI et Ekos. L'angle du rotateur est l'angle rapporté par le rotateur mais n'est pas nécessairement <ulink url="https://fr.wikipedia.org/wiki/Angle_de_position">l'angle de position</ulink>. Un angle de position de zéro indique que le haut d'une trame (repéré par une petite flèche) pointe <emphasis>directement</emphasis> vers le pôle. L'angle de position est exprimé en degrés de l'est par rapport au nord, ainsi, un angle de position de 90 indique que le <emphasis>haut</emphasis> d'une trame pointe à 90 degrés (sens antihoraire) du pôle. Quelques <ulink url="http://www.dibonsmith.com/orbits.htm">exemples</ulink> d'angle de position d'étoiles binaires.

source: To calibrate the Position Angle (PA), capture and solve an image in the <link linkend="ekos-align">Ekos Align module</link>. An <emphasis>offset</emphasis> and a <emphasis>multiplier</emphasis> are applied to the raw angle to produce the position angle. The Ekos Rotator dialog permits direct control of the raw angle and also the PA. The offset and multiplier can be changed manually to synchronize the rotator's raw angle with the actual PA. Check <guilabel>Sync FOV to PA</guilabel> to rotate the current Field of View (FOV) indicator on the Sky Map with the PA value as you change it in the dialog.
fr: Afin de calibrer l'angle de position (AP), prenez une image et resolvez-là dans le <link linkend="ekos-align">module d'alignement</link> d'Ekos. Un <emphasis>décalage</emphasis> et un <emphasis>coefficient multiplicateur</emphasis> sont appliqués à l'angle brute pour calculer l'angle de position. La boîte de dialogue du rotateur d'Ekos permet un contrôle direct de l'angle brut et de l'angle de position. Le décalage et le coefficient multiplicateur peuvent être modifiés manuellement afin de synchroniser l'angle brute du rotateur avec l'angle de position actuel. Cochez <guilabel>Synchroniser CdV vers AP</guilabel> pour effectuer la rotation de l'indicateur du champ de vision courant sur la carte du ciel avec la valeur d'angle de position.

source: Rotator settings
fr: Réglages du rotateur

source: Each capture job may be assigned different rotator angles, but be aware that this would cause guiding to abort as it would lose track of the guide star when rotating. Therefore, for most sequences, the rotator angle is kept the same for all capture jobs.
fr: On peut assigner à chaque tâche d'acquisition un angle de rotation différent mais soyez conscient que cela peut causer l'interruption du guidage puisque l'étoile guide sera perdue pendant la rotation. Ainsi, pour la plupart des séquences, l'angle du rotateur est identique pour toutes les tâches d'acquisition.

source: Calibration Frames
fr: Trames de calibration

source: <screeninfo>Calibration settings</screeninfo>
fr: <screeninfo>Réglages de la calibration</screeninfo>

source: <phrase>Calibration settings</phrase>
fr: <phrase>Réglages de la calibration</phrase>

source: For Flat Field frames, you can set calibration options in order to automate the process. The calibration options are designed to facilitate automatic unattended flat field frame capture. It can also be used for dark and bias frames if desired. If your camera is equipped with a mechanical shutter, then it is not necessary to set calibration settings unless you want to close the dust cover to ensure no light at all passes through the optical tube. For flat fields, you must specify the flat field light source, and then specify the duration of the flat field frame. The duration can be either manual or based on ADU calculations.
fr: Pour les trames de champ uniforme (Flat), vous pouvez régler les options de calibration pour automatiser le processus. Ces options sont conçues pour faciliter l'acquisition automatique des trames de champ uniforme. Elles peuvent également être utilisées pour l'acquisition des trames Dark et Bias. Si votre caméra possède un obturateur mécanique, il n'est pas nécessaire de régler ces options sauf si vous souhaitez fermer le bouchon antipoussière pour vous assurer qu'aucune lumière ne passe dans le tube optique. Pour les Flats, vous devez spécifier la source de lumière, puis une durée d'exposition. La durée peut être spécifiée soit manuellement soit fondé sur un calcul d'ADU (Analog Digital Unit ou pas de quantification).

source: Flat Field Source
fr: Source de lumière pour le Flat

source: <guilabel>Manual</guilabel>: The flat light source is manual.
fr: <guilabel>Manuel</guilabel> : la source de lumière est manuelle.

source: <guilabel>Dust Cover with Built-In Flat Light</guilabel>: If using a dust cover with builtin light source (&eg; FlipFlat). For dark and bias frames, close the dust cap before proceeding. For flat frames, close the dust cap and turn on the light source.
fr: <guilabel>Bouchon antipoussière avec source de lumière intégrée</guilabel> : pour l'utilisation de ce type d'appareil (p. ex. FlipFlat). Pour les trames Dark et Bias, veillez à fermer le bouchon antipoussière avant de commencer. Pour les trames Flat, fermez le bouchon antipoussière et allumez la source de lumière.

source: <guilabel>Dust Cover with External Flat Light</guilabel>: If using a dust cover with an external flat light source. For dark and bias frames, close the dust cap before proceeding. For flat frames, open the dust cap and turn on the light source. The external flat light source location is presumed to be the parking location.
fr: <guilabel>Bouchon antipoussière avec source de lumière externe</guilabel> : pour l'utilisation de bouchon antipoussière avec source de lumière externe. Pour les trames Dark et Bias, veuillez à fermer le bouchon antipoussière avant de commencer. Pour les trames Flat, fermez le bouchon antipoussière et allumer la source de lumière. L'emplacement de la source externe de lumière pour les Flats est présumée être la position de parcage.

source: <guilabel>Wall</guilabel>: Light source is a panel on the observatory wall. Specify the Azimuth and Altitude coordinates of the panel and the mount shall slew there before capturing the flat field frames. If the light panel is controllable from INDI, Ekos shall turn it on/off as required.
fr: <guilabel>Mur</guilabel> : la source de lumière est un panneau placé contre un mur. Spécifier les coordonnées d'azimut et d'altitude du panneau et la monture pivotera dans cette direction avant de débuter l'acquisition des trames de Flats. Si le panneau de lumière est contrôlable par INDI, Ekos se chargera de l'allumer et de l'éteindre.

source: <guilabel>Dawn/Dusk</guilabel>: Currently unsupported.
fr: <guilabel>Aube/Crépuscule</guilabel> : non géré actuellement.

source: Flat Field Duration
fr: Durée d'exposition de l'acquisition de Flat

source: <guilabel>Manual</guilabel>: Duration is as specified in the Sequence Queue.
fr: <guilabel>Manuelle</guilabel> : la durée est spécifiée dans la file d'attente de la séquence.

source: <guilabel>ADU</guilabel>: Duration is variable until specified ADU is met.
fr: <guilabel>ADU</guilabel> : la durée est variable jusqu'à que la valeur ADU soit atteinte.

source: Before the calibration capture process is started, you can request Ekos to park the mount and/or dome. Depending on your flat source selection above, Ekos will use the appropriate flat light source before starting flat frames capture. If ADU is specified, Ekos begins by capturing a couple of preview images to establish the curve required to achieve the desired ADU count. Once an appropriate value is calculated, another capture is taken and ADU is recounted until a satisfactory value is achieved.
fr: Avant le début de la procédure d'acquisition de la calibration, vous pouvez demander à Ekos de parquer la monture et/ou le dôme. Selon la sélection de la source de Flat ci-dessus, Ekos va utiliser la source de lumière appropriée pour les Flats avant de commencer l'acquisition des trames de Flat. Si une valeur ADU est spécifiée, Ekos commence par prendre une série d'images pour établir la courbe nécessaire pour atteindre la valeur ADU souhaitée. Une fois que cette valeur est calculée, une nouvelle image est prise et l'ADU est recalculée jusqu'à ce que la valeur souhaitée soit atteinte.

source: Exposure Calculator
fr: Calculateur d'exposition

source: <screeninfo>Exposure calculator</screeninfo>
fr: <screeninfo>Calculateur d'exposition</screeninfo>

source: <phrase>Exposure calculator</phrase>
fr: <phrase>Calculateur d'exposition</phrase>

source: The exposure calculator is an implementation of a calculation process presented by Dr. Robin Glover in 2019. This calculation process seeks to establish a sub-exposure time which considers two sources of noise in an image: camera read noise, and noise from background sky brightness (light pollution). The effects of camera thermal noise on images is not considered in this calculation. (Note: Since his presentation in 2019, Dr. Glover has enhanced his calculation process to incorporate the effects of sensor quantum efficiency, and sensor pixel size. At this time, the KStars implementation lacks those features.)
fr: Le calculateur d'exposition est une implémentation d'un traitement de calcul présenté par le Dr. Robin Glover en 2019. Il cherche à établir le temps d'exposition en considérant deux sources de bruit d'une image : le bruit de lecture de l'appareil et le bruit de la pollution lumineuse. Les effets du bruit thermique de l'appareil sur les images ne sont pas pris en considération dans ce calcul. (Remarque : depuis sa présentation en 2019, le Dr. Glover a amélioré son calcul en tenant compte de l'efficacité quantique du capteur et la taille des pixels. Pour le moment, KStars ne tient pas compte de ces améliorations).

source: The concept in Dr. Glover's calculation is to provide a sufficiently long exposure so that the effects of camera read-noise are overwhelmed by the signal coming from the target, but not so long an exposure that the effects of light pollution rise to levels which would overwhelm the signal from the target.
fr: L'idée principal du calcul est de fournir un temps d'exposition suffisamment long pour que le bruit de lecture de l'appareil soit largement dépassé par le signal provenant de la cible mais pas trop long pour éviter que le bruit de la pollution lumineuse ne dépasse pas le signal de la cible.

source: The implementation of this process does not consider the strength (magnitude or flux) of the intended target, nor does it consider other factors which may cause an astrophotographer to choose an alternate sub-exposure time. These other factors may include: the storage requirements and extended post-processing time for a large number of short exposures, the impacts of external factors that might occur in very long exposures, such as tracking / guiding performance, changes in weather conditions which may disrupt seeing conditions, intrusions from air traffic or passing satellites.
fr: Cette implémentation ne considère pas la force (magnitude ou flux) de la cible, ni d'autres facteurs qui pourraient inciter l'astrophotographe à choisir une durée d'exposition différente. Ces autres facteurs peuvent inclure : les exigences en terme de stockage et le temps supplémentaire de post-traitement dû au nombre important de trames de faible durée d'exposition, les impacts de facteurs externes qui se produiront pour les très longues expositions tels que les performances de suivi et de guidage, les modifications des conditions météorologiques, les intrusions du traffic aérien ou encore le passage de satellites artificiels.

source: Approaches to imaging can vary greatly in the selection of exposure times, and number of sub-exposures used for integration. A well accepted approach for imaging deep-sky objects utilizes long exposures, requires good guiding, good to excellent seeing conditions, and would typically employ filtering to reduce the effects of light pollution. At the other extreme are approaches such as speckle imaging techniques (commonly 'lucky imaging'), which utilize many hundreds to many thousands of extremely short exposures in an attempt to eliminate the effects of light pollution, poor seeing conditions, and poor guiding. Choices made for values of certain inputs to the exposure calculator will vary depending upon which imaging approach is being employed.
fr: Les approches à l'imagerie peuvent considérablement varier quant au choix des durées d'exposition et le nombre de trames utilisées pour l'intégration. Une approche largement acceptée pour l'imagerie d'objets du ciel profond implique de longues durées d'exposition qui nécessitent un bon guidage, des conditions de visibilité excellente et emploierait typiquement l'utilisation de filtres pour réduire les effets de la pollution lumineuse. À l'autre extrême, des approches utilisant des techniques rapides (nommées communément « imagerie chanceuse ») en prenant des centaines voir des milliers de trames de durée très courtes dans l'espoir d'éliminer les effets de la pollution lumineuse, ainsi que de mauvaises conditions de visibilité et de guidage. Les choix des valeurs des paramètres du calculateur d'exposition dépendront de l'approche utilisée.

source: Exposure Calculator Inputs
fr: Valeurs en entrée du calculateur d'exposition

source: <guilabel>Sky Quality</guilabel>: The <guimenu>Sky Quality selector</guimenu> sets the measurement of the magnitude per square arc-second of the background sky.
fr: <guilabel>Qualité du ciel</guilabel> : le <guimenu>sélecteur de qualité du ciel</guimenu> règle la mesure de la magnitude par secondes d'arc au carré du fond du ciel.
