Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_config.po
Languages: fr

source: The <guilabel>Stars</guilabel> section allows you to manage how stars are displayed in &kstars;. You can choose to see the stars or not by checking the <guilabel>Star catalogs</guilabel> checkbox. If you check it, then multiple options will be enabled. Thus, you can set how many stars are drawn on the map using the <guilabel>Star density:</guilabel> slider. You can also customize &kstars; to toggle star name and <link linkend="ai-magnitude">magnitudes</link>. Star names are drawn next to bright stars. To display labels of fainter stars, increase the <guilabel>Label density:</guilabel> slider.
fr: La section <guilabel>Étoiles</guilabel> vous permet de gérer la manière dont les étoiles sont affichées dans &kstars;. Vous pouvez choisir d'afficher ou non les étoiles en cochant <guilabel>Catalogues d'étoiles</guilabel>. En cochant, vous ferez apparaître plusieurs options. Par exemple le nombre d'étoiles peut être configuré avec le curseur <guilabel>Densité d'étoiles</guilabel>. Vous pouvez aussi configurer &kstars; pour afficher le nom des étoiles et leur <link linkend="ai-magnitude">magnitude</link>. Le nom des étoiles est affiché à côté des étoiles brillantes. Pour afficher le nom des étoiles plus pâles, augmentez le curseur de la <guilabel>densité d'étoiles</guilabel>.

source: <secondary>Deep-Sky Catalogs</secondary>
fr: <secondary>Catalogues du ciel profond</secondary>

source: Below the stars section, the <guilabel>Deep-Sky Objects</guilabel> section controls the display of several non-stellar object catalogs. You can toggle the display of Deep Sky Objects and control the display of their names and magnitudes. By default, the list of deep-sky objects includes the Messier, NGC and IC catalogs. Addons catalogs are available via the <menuchoice><guimenu>Data</guimenu> <guimenuitem>Download New Data...</guimenuitem></menuchoice> menu item where you can download catalogs provided by &kstars; team and the community through the <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs">catalog packaging repository</ulink>. The <guilabel>DSO minimal zoom:</guilabel> slider controls the minimal zoom level for which the DSOs are shown. Increasing the minimal zoom level can lead to performance improvements when panning the skymap zoomed-out. The <guilabel>DSO cache percentage:</guilabel> slider regulates how much of the DSO master catalog is being kept in memory. If you experience memory issues with large catalogs, try lowering the percentage. The <guilabel>Label density:</guilabel> slider controls the perceived density of labels for the DSOs. If labels start to overlap and the skymap begins to look too crowded, try tuning this option. The <guilabel>Faint limit zoomed in/out:</guilabel> regulates up to which magnitude objects are shown on the skymap (higher magnitude is fainter). If <guilabel>Show objects of unknown magnitude</guilabel> is ticked, objects of unknown magnitude are always shown.
fr: Sous la section des étoiles, la section <guilabel>Objets du ciel profond</guilabel> contrôle l'affichage de plusieurs catalogues d'objets non stellaires. Vous pouvez (dés)activer l'affichage des objets du ciel profond et contrôler leur nom et leur magnitude. Par défaut, la liste des objets du ciel profond inclut les catalogues Messier, NGC et IC. Des catalogues additionnels sont disponibles dans le menu <menuchoice><guimenu>Données</guimenu> <guimenuitem>Télécharger de nouvelles données</guimenuitem></menuchoice> où vous pouvez télécharger des catalogues fournit par l'équipe et la communauté de &kstars; dans le <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs">dépôt de catalogues</ulink>. Le curseur <guilabel>zoom minimal CP</guilabel> contrôle le niveau de zoom minimal pour l'affichage des objets du ciel profond. Augmenter le niveau de zoom minimal peut augmenter les performances lors des déplacements extérieurs de zoom. Le curseur <guilabel>pourcentage de cache CP</guilabel> régule le pourcentage du catalogue maître conservé en cache mémoire. Si vous observez des problèmes de mémoire, essayez de diminuer cette valeur. Le curseur <guilabel>Densité d'étiquette</guilabel> contrôle la densité perçue des objets du ciel profond. Si les étiquettes se chevauchent et la carte de ciel devient trop chargée, essayer de diminuer cette valeur. Le curseur <guilabel>zoom de la limite pâle</guilabel> régule la limite de magnitude affichée sur la carte du ciel (les magnitudes élevées sont les plus pâles). Si <guilabel>Afficher les objets de magnitude inconnues</guilabel> est coché, les objets de magnitude inconnues sont toujours affichés.

source: The following sections will detail how DSO catalogs work in &kstars; and how they're managed.
fr: La prochaine section expliquera en détail comment les catalogues du ciel profond (CP) fonctionnent dans &kstars; et comment ils sont gérés.

source: The DSO Catalog Database
fr: La base de données du catalogue du ciel profond (CP)

source: <primary>Deep-Sky Catalogs</primary>
fr: <primary>Catalogues du ciel profond</primary>

source: Database
fr: Base de données

source: Database System
fr: Système de base de données

source: This section aims at introducing the catalog database of &kstars; in simple but technical terms. It can be skipped without missing anything essential but helps understanding how to deal with and create (custom) catalogs.
fr: Cette section aspire à introduire la base de données de catalogues de &kstars; en des termes simples mais techniques. Elle peut être sautée sans perdre l'essentiel mais aide à comprendre comment gérer et créer des catalogues personnalisés.

source: DSO catalogs in &kstars; are just SQL (sqlite3) database tables. Each catalog is represented by its own table which contains all its objects and an entry in a catalog metadata table. Additionally, catalogs may be imported or exported from and into stand-alone database files.
fr: Les catalogues du ciel profond dans &kstars; sont de simples tables « SQL » (SQLite3) de bases de données. Chaque catalogue est représenté par sa propre table qui contient tous les objets et une entrée dans une table des métadonnées du catalogue. De plus, les catalogues peuvent être importés ou exportés dans des fichiers de base de données autonomes.

source: Each object has the usual properties like name and coordinates but additionally features two IDs. The first ID is the unique identifier for the specific object and is calculated by hashing all the object fields along with the catalog id. Because objects can be contained in several catalogs each object has an additional object id (OID) that identifies the physical object and may be shared by several objects of different catalogs.
fr: Chaque objet possède les propriétés usuelles telles que nom et coordonnées mais aussi deux identités. La première est l'identifiant unique de l'objet en question et est calculé par un hachage de tous les champs de l'objet et de l'identifiant du catalogue. Comme des objets peuvent appartenir à plusieurs catalogues, chaque objet possède un identifiant additionnel (OID) qui identifie l'objet physique et peut être partagé par plusieurs objets de différents catalogues.

source: To speed up object lookup all enabled catalogs are merged into a master table. Each catalog has a priority number and if several objects with the same OID occur the one from the catalog with the highest priority is loaded. The objects from the master catalog are then drawn on the sky and generally available in &kstars;.
fr: Afin d'accélérer la consultation, tous les catalogues activés sont fusionnés dans une table principale. Chaque catalogue possède un nombre de priorité et si plusieurs objets avec le même OID sont demandés, celui dont le catalogue a la plus haute priorité sera chargé. Les objets du catalogue principal sont ensuite dessinés sur le ciel et sont disponibles dans tout &kstars;.

source: Currently, deduplication (the assignment of OIDs) is only supported by the tooling of the <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs">catalog packaging repository</ulink>. The aim of this tool-chain is to reproducibly build catalogs in a homogeneous environment. Every catalog is implemented <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs/-/blob/master/catalogs/sharpless_2.py"> as a python module</ulink> and provides standard methods to acquire data, parse it and find duplicates in other catalogs. All downloadable catalogs are implemented this way. If you'd like to make a catalog of your own available for &kstars;, it is recommended that you implement it as a package in the repository. The tooling provided there is so flexible, that it should work for you. For more information on how to do that see the <ulink url="https://protagon.space/catalogs/">catalog repository documentation</ulink>. If you are not familiar with python programming you can request the addition of a catalog by opening a ticket in the repository or contacting <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs/-/project_members">the maintainers</ulink>. &kstars; provides also provides means to create custom catalogs by manually entering data or importing CSV tables, but those are less flexible and offer no deduplication.
fr: Pour le moment, la déduplication (l'affectation des OID) n'est gérée que par les outils du <ulink url="https://invent.kde/vboettcher/kstars-catalogs">dépôt de paquets des catalogues</ulink>. Le but de cet ensemble d'outils est de pouvoir reproduire la compilation des catalogues dans un environnement homogène. Chaque catalogue est implémenté dans un <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs/-/blob/master/catalogs/sharpless_2.py">module python</ulink> et fournit des méthodes standards pour acquérir des données, les analyser et trouver des doublons dans d'autres catalogues. Tous les catalogues téléchargeables sont implémentés de cette manière. Si vous voulez créer votre propre catalogue à mettre à disposition de &kstars;, il est fortement recommandé de le créer comme un paquet dans ce dépôt. Les outils à disposition sont tellement flexibles que cela devrait bien fonctionner pour vous. Pour davantage d'informations sur la manière de procéder, veuillez lire la <ulink url="https://protagon.space/catalogs/">documentation sur les dépôts de catalogues</ulink>. Si vous n'êtes pas à l'aise avec la programmation en Python, vous pouvez demander l'ajout d'un catalogue en ouvrant un ticket sur la page du dépôt ou en contactant les <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs/-/project_members">gestionnaires</ulink>. &kstars; fournit aussi des moyens de créer des catalogues personnalisés en entrant manuellement les données ou en important des tables au format CSV mais cela est moins flexible et ne permet pas la déduplication.

source: The Catalog Management &GUI;
fr: L'interface graphique de gestion des catalogues

source: The catalog management &GUI; is reached via the <menuchoice><guimenu>Data</guimenu> <guimenuitem>Manage DSO Catalogs...</guimenuitem></menuchoice> menu item and is displayed <link linkend="dso_manager">below</link>.
fr: L'interface graphique de gestion des catalogues se trouve dans le menu <menuchoice><guimenu>Données</guimenu> <guimenuitem>Gérer les catalogues CP…</guimenuitem></menuchoice> et est affiché <link linkend="dso_manager">ci-dessous</link>.

source: DSO Manager
fr: Gestionnaire des objets du ciel profond

source: <phrase>The DSO catalog management interface.</phrase>
fr: <phrase>L'interface de gestion du catalogue du ciel profond.</phrase>

source: <caption>The DSO catalog management interface.</caption>
fr: <caption>L'interface de gestion du catalogue des objets du ciel profond.</caption>

source: On the left, a list of catalogs is displayed. In this list, you can read off key catalog properties, including whether a catalog is enabled, what its ID is and what its name is. The <guilabel>Mutable</guilabel> column signifies whether the catalog can be edited or not. Catalogs which have been downloaded from the catalog repository via the <menuchoice><guimenu>Data</guimenu> <guimenuitem>Download New Data...</guimenuitem></menuchoice> menu item are usually immutable whereas user-created catalogs aren't. You can always <guilabel>Clone</guilabel> a catalog to make it mutable.
fr: Une liste de catalogues est affichée sur la partie gauche. Dans cette liste vous pouvez lire les propriétés essentielles du catalogues, en incluant son état d'activation, son identifiant ID et son nom. La colonne <guilabel>Modifiable</guilabel> indique si un catalogue peut être modifiable ou non. Les catalogues téléchargés du dépôt de catalogues à partir du menu <menuchoice><guimenu>Données</guimenu> <guimenuitem>Télécharger de nouvelles données</guimenuitem></menuchoice> sont en général immuables alors que ceux créés par des utilisateurs ne le sont pas. Vous pouvez toujours <guilabel>cloner</guilabel> un catalogue pour le rendre modifiable.

source: The buttons in the upper right corner allow you to add catalogs to the database.
fr: Les boutons dans le coin gauche du haut vous permettent d'ajouter des catalogues à la base de données.

source: Import Catalog...
fr: Importer un catalogue…

source: Import a catalog in the <literal role="extension">.kscat</literal> format from a file.
fr: Importer un catalogue au format <literal role="extension">.kscat</literal> depuis un fichier.

source: This is usually done to try out new versions of catalogs that haven't yet been picked up by the usual download server.
fr: Cela est généralement utilisé pour essayer des nouvelles versions de catalogues qui ne sont pas encore sur les serveurs de téléchargement.

source: With the buttons in the lower right corner, you can add, remove, modify and explore catalogs. Their actions always refer to the currently selected catalog (the highlighted row on the left).
fr: Les boutons dans le coin inférieur droite permettent d'ajouter, modifier et explorer les catalogues. Leurs actions se réfèrent toujours au catalogue courant (la rangée en surbrillance sur la gauche).

source: Create Catalog...
fr: Créer un catalogue…

source: Create a new catalog. See <xref linkend="create_catalog"/>.
fr: Création d'un nouveau catalogue. Voir <xref linkend="create_catalog"/>.

source: Enable / Disable
fr: Activer/Désactiver

source: Enable or disable a catalog.
fr: Activer ou désactiver un catalogue.

source: This is reflected in the skymap upon closing the catalog management &GUI;.
fr: Cela est reflété sur la carte du ciel à la fermeture de l'interface graphique de gestion des catalogues.

source: Remove
fr: Supprimer

source: Remove a catalog from the catalog database.
fr: Supprimer un catalogue de la base de données des catalogues.

source: Export...
fr: Exporter…

source: Export a catalog into a <literal role="extension">.kscat</literal> file.
fr: Exporter un catalogue dans un fichier <literal role="extension">.kscat</literal>.

source: The resulting file can be imported with <link linkend="import"><guibutton>Import Catalog...</guibutton></link> button.
fr: Le fichier résultant peut être importé grâce au bouton <link linkend="import"><guibutton>Importer un catalogue…</guibutton></link>.

source: Clone...
fr: Cloner…

source: Make an exact copy of the catalog and insert it into the database.
fr: Faire une copie exacte du catalogue et l'insérer dans la base de données.

source: This is useful if you wish to make modifications to an immutable catalog.
fr: Cela est utile si vous souhaitez apporter des modifications à un catalogue immuable.

source: Note however that this is not the recommended way to alter catalogs that are provided by the <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs">catalog packaging repository</ulink> &ie; the catalogs downloaded via the <menuchoice><guimenu>Data</guimenu><guimenuitem>Download New Data...</guimenuitem></menuchoice> menu item.
fr: Veuillez noter que ce n'est pas la méthode recommandée pour modifier des catalogues qui sont fournit par le <ulink url="https://invent.kde.org/vboettcher/kstars-catalogs">dépôt de paquets de catalogues</ulink>, c'est-à-dire les catalogues téléchargés via le menu <menuchoice><guimenu>Données</guimenu><guimenuitem>Télécharger de nouvelles données…</guimenuitem></menuchoice>.

source: <guibutton>Colors</guibutton>
fr: <guibutton>Couleurs</guibutton>

source: Open the catalog color editor (See <xref linkend="catalog_colors"/>.).
fr: Ouvrir l'éditeur de couleur de catalogue (voir <xref linkend="catalog_colors"/>).

source: This will open a dialog which allows you to set the colors in which objects from the selected catalog will be displayed for each color scheme.
fr: Cela ouvrira une boîte de dialogue où seront affichées les couleurs dans lesquelles les objets seront affichés, et cela pour chaque thème de couleurs.

source: More...
fr: Davantage…

source: Open the catalog details dialog. (See <xref linkend="catalog_details"/>.)
fr: Ouvrir la boîte de dialogue de détails de catalogue. (voir <xref linkend="catalog_details"/>).

source: In there, you can see the contents of the catalog, as well as some more meta information. Amongst other things, you can also edit its contents (if it is mutable).
fr: Là vous pouvez voir le contenu du catalogue ainsi que des métadonnées. Outre cela, vous pouvez aussi modifier son contenu (s'il est modifiable bien sûr).

source: Creating a new Catalog
fr: Créer un nouveau catalogue

source: Catalog creation dialog
fr: Boîte de dialogue de création d'un catalogue

source: Catalog creation dialog.
fr: Boîte de dialogue de création de catalogue.

source: This dialog reached through the catalog management &GUI; (see <xref linkend="catalog_gui"/>). The <guilabel>ID:</guilabel> field will be automatically chosen but can be changed. The <guilabel>Color:</guilabel> field configures in which color the objects of the catalog will be displayed. All the other values are optional or have sensible defaults. You can, of course, change these values at a later point.
fr: Cette boîte de dialogue est atteinte par l'interface graphique de gestion des catalogues (voir <xref linkend="catalog_gui"/>). Le champ <guilabel>ID</guilabel> sera automatiquement choisi mais peut être modifié. Le champ <guilabel>Couleurs</guilabel> configure la couleur d'affichage des objets du catalogue. Toutes les autres valeurs sont facultatives ou possèdent des valeurs par défaut raisonnables.

source: Upon clicking <guilabel>Ok</guilabel> an empty catalog with the meta data entered into the dialog will be added to the database and can then be filled with objects. (See <xref linkend="catalog_details"/> and <xref linkend="csv_import"/>.)
fr: En cliquant sur <guilabel>Ok</guilabel> vous ajouterez à la base de données un catalogue vide avec les métadonnées indiquées que vous pourrez ensuite alimenter avec les objets. (Voir <xref linkend="catalog_details"/> et <xref linkend="csv_import"/>).

source: <title>Catalog Color Editor</title>
fr: <title>Modifier la couleur d'un catalogue</title>

source: <secondary>Catalog Color Editor</secondary>
fr: <secondary>Éditeur de couleurs de catalogue</secondary>

source: Catalog color editor
fr: Éditeur de couleurs de catalogue

source: The catalog color editor.
fr: L'éditeur de couleurs de catalogue.

source: This dialog reached through the catalog management &GUI; (see <xref linkend="catalog_gui"/>). Each button represents the color that objects will be drawn in for a specific color scheme. Clicking on a button will allow you to choose a color with a color picker. The button colors are initialized with the default colors from the catalog specification. The color "default" is the color which will be chosen for the catalog if there is no color set for a color scheme.
fr: Cette boîte de dialogue atteinte par l'interface graphique de gestion de catalogues (voir <xref linkend="catalog_gui"/>). Chaque bouton représente la couleur d'affichage des objets pour un thème de couleur spécifique. Un clic sur un bouton fera apparaître un sélectionneur de couleurs pour choisir une couleur. La couleur des boutons est initialisée avec les couleurs par défaut des spécifications du catalogue. La couleur <quote>par défaut</quote> est celle qui sera choisie pour le catalogue s'il n'existe aucun groupe de couleurs pour un thème de couleurs.

source: <title>Catalog Details Dialog</title>
fr: <title>Boîte de dialogue des détails de catalogue</title>

source: <secondary>Catalog Details Dialog</secondary>
fr: <secondary>Boîte de dialogue des détails de catalogue</secondary>

source: Catalog details dialog
fr: Les détails d'un catalogue

source: The catalog details dialog.
fr: La boîte de dialogue de détails de catalogue.

source: This dialog reached through the catalog management &GUI; (see <xref linkend="catalog_gui"/>). In the top left corner, the catalog metadata is being displayed. On the right, a table of all objects in the catalog is being shown. The search line above the table filters objects by name. Double-clicking a row opens the object details dialog (see <xref linkend="tool-details"/>).
fr: Cette boîte de dialogue atteinte par l'interface graphique de gestion de catalogues (voir <xref linkend="catalog_gui"/>). Dans le coin en haut à gauche sont affichées les métadonnées du catalogue. Sur la droite, une table avec tous les objets du catalogue est affichée. La ligne de recherche au-dessus de la table permet de filtrer les objets par nom. Un double-clic sur une rangée ouvre une boîte de dialogue contenant les détails de l'objet.

source: Selecting a row enables the <guilabel>Object</guilabel> menu on the left. Selecting multiple rows performs the single-object action for each selected object.
fr: La sélection d'une rangée active le menu <guilabel>Objet</guilabel> de gauche. La sélection de plusieurs rangées réalise l'action d'un objet sur tous les objets sélectionnés.

source: Edit...
fr: Modifier…

source: Edit the catalog object. (See <xref linkend="add_object"/>).
fr: Modifier l'objet catalogue. (Voir <xref linkend="add_object"/>).

source: Removes the object from the catalog.
fr: Supprimer l'objet du catalogue.

source: Below the <guilabel>Object</guilabel> section, the general catalog options are situated.
fr: Les options générales des catalogues sont situées sous la section <guilabel>Objets</guilabel>

source: Edit Catalog Meta...
fr: Modifier les métadonnées d'un catalogue…

source: Edit the catalog metadata displayed in the top left. This opens the dialog described in <xref linkend="create_catalog"/>.
fr: Modifier les métadonnées du catalogue affichées en haut à gauche. Cela ouvrira la boîte de dialogue décrite dans <xref linkend="create_catalog"/>.

source: Add Object...
fr: Ajouter un objet…

source: Add an object to the catalog. (See <xref linkend="add_object"/>.)
fr: Ajouter un objet au catalogue. (Voir <xref linkend="add_object"/>)

source: Import CSV...
fr: Importer CSV…

source: Import objects from a tabular text format (csv, tsv, &etc;) into the catalog. (See <xref linkend="csv_import"/>.)
fr: Importer des objets à partir d'un fichier au format texte (csv, tsv, &etc;) dans le catalogue. (Voir <xref linkend="csv_import"/>).

source: <title>Adding/Editing Objects</title>
fr: <title>Ajout et modification des objets</title>

source: <secondary>Adding/Editing Objects</secondary>
fr: <secondary>Ajout/Modification d'objets</secondary>

source: <screeninfo>Add/Edit DSO Dialog</screeninfo>
fr: <screeninfo>Fenêtre de dialogue d'ajout/modification d'objets du ciel profond</screeninfo>

source: <phrase>Add/Edit DSO Dialog</phrase>
fr: <phrase>Boîte de dialogue d'ajout/modification d'objets du ciel profond</phrase>
