Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_config.po
Languages: fr

source: Configuring &kstars;
fr: Configurer &kstars;

source: Setting the Geographic Location
fr: Définition de la position géographique

source: Here is a screenshot of the <guilabel>Set Geographic Location</guilabel> window:
fr: Voici une capture d'écran de la fenêtre <guilabel>Définir la position géographique</guilabel> :

source: Changing the Geographic Location
fr: Changer la position géographique

source: Set Location Window
fr: Régler la fenêtre de position

source: There is a list of over 3400 predefined cities available to choose from. You set your location by highlighting a city from this list. Each city is represented in the world map as a small dot, and when a city is highlighted in the list, a red crosshairs appears on its location in the map.
fr: Il y a une liste de plus de 3 400 villes prédéfinies. Indiquez votre lieu en choisissant une ville dans cette liste. Chaque point sur la carte géographique représente une ville, et quand une ville est sélectionnée dans la liste, une croix rouge apparaît sur la carte.

source: Geographic Location Tool
fr: Outil de position géographique

source: Filtering
fr: Filtrage

source: It is not practical to scroll through the full list of 3400 locations, looking for a specific city. To make searches easier, the list can be filtered by entering text in the boxes below the map. For example, in the screenshot, the text <userinput>A</userinput> appears in the <guilabel>City filter:</guilabel> box, while <userinput>Te</userinput> has been entered in the <guilabel>Province filter:</guilabel> box, and <userinput>USA</userinput> is in the <guilabel>Country filter:</guilabel> box. Note that all of the cities displayed in the list have city, province, and country names that begin with the entered filter strings, and that the message below the filter boxes indicates that 6 cities are matched by the filters. Also notice that the dots representing these six cities in the map have been colored white, while the unmatched cities remain gray.
fr: Il n'est pas pratique de faire défiler la liste au complet lorsque vous cherchez une ville parmi 3 400. Pour faciliter la recherche, la liste peut être filtrée en saisissant du texte dans les boîtes sous la carte. Par exemple, dans la capture d'écran, le texte <userinput>P</userinput> apparaît dans la boîte <guilabel>Filtre des villes</guilabel>, tandis que le texte <userinput>Ha</userinput> apparaît dans la boîte <guilabel>Filtre par provinces</guilabel> et <userinput>France</userinput> dans la boîte <guilabel>Filtre des pays</guilabel>. Ainsi, notez que les villes qui apparaissent maintenant dans la liste possèdent des noms de ville, département et pays qui commencent par les lettres utilisées dans le filtre, et qu'un message au bas indique que sept villes sont valables d'après le filtre. Notez également que les points représentant ces sept villes dans la carte ont été colorés en blanc, alors que les villes qui ne correspondent pas restent en gris.

source: The list can also be filtered by location in the map. Clicking anywhere in the world map will show only those cities within two degrees of the clicked location. At this time, you can search by name, or by location, but not both at once. In other words, when you click on the map, the name filters are ignored, and vice versa.
fr: La liste peut aussi être filtrée par endroits sur la carte géographique. Si vous cliquez un endroit sur la carte, seules les villes à moins de 2 degrés apparaîtront. Actuellement, vous pouvez effectuer une recherche en filtrant les noms ou en cliquant sur la carte, mais pas les deux à la fois. Lorsque vous cliquez la carte, les filtres de noms sont ignorés, et vice versa.

source: Custom locations
fr: Positions personnalisées

source: The <link linkend="ai-geocoords">longitude, latitude</link> and <link linkend="ai-timezones">time zone</link> information for the currently-selected location are displayed in the boxes at the bottom of the window. If you feel that any of these values are inaccurate, you can modify them and press the <guibutton>+</guibutton> (Add City) button to record your custom version of the location. You can also define a completely new location by pressing the <guibutton>Clear Fields</guibutton> button, and entering the data for the new location. Note that all fields except the optional <guilabel>Province:</guilabel>/<guilabel>Country:</guilabel> must be filled before the new location can be added to the list. &kstars; will automatically load your custom locations for all future sessions. Please note, at this point, the only way to remove a custom location is to remove the appropriate line from the file <filename>kstars/mycities.dat</filename> in your folder <userinput><command>qtpaths</command> <option>--paths GenericDataLocation</option></userinput>&nbsp;.
fr: Les informations sur la <link linkend="ai-geocoords">longitude, la latitude</link> et le <link linkend="ai-timezones">fuseau horaire</link> pour la position actuelle sélectionnée sont affichées dans les boîtes en bas de la fenêtre. Si vous trouvez que l'une de ces données est inadaptée, vous pouvez la modifier et actionner le bouton <guibutton>+</guibutton> (Ajouter la ville à la liste) pour enregistrer votre version personnalisée de la position. Vous pouvez également définir une position complètement nouvelle en actionnant le bouton <guibutton>Effacer les champs</guibutton>, et en écrivant les données pour la nouvelle position. Notez que tous les champs sauf <guilabel>Province</guilabel> et <guilabel>Pays</guilabel> doivent être remplis avant que la nouvelle position ne puisse être ajoutée à la liste. Lors des prochaines sessions, &kstars; chargera vos positions en même temps que les autres. Notez qu'à ce stade, la seule façon de supprimer une position personnalisée est de supprimer la ligne appropriée à partir du fichier <filename>kstars/mycities.dat</filename> dans votre dossier <userinput><command>qtpaths</command> <option>--paths GenericDataLocation</option></userinput>&nbsp;.

source: If you add custom locations (or modify existing ones), please send us your <filename>mycities.dat</filename> file so that we can add your locations to the master list.
fr: Si vous ajoutez des positions (ou modifiez celles existantes), veuillez nous envoyer votre fichier <filename>mycities.dat</filename> de sorte que nous puissions l'ajouter à la liste principale.

source: Setting the Time
fr: Détermination de l'heure

source: Date and Time
fr: Date et heure

source: The simulation clock
fr: L'horloge de simulation

source: When &kstars; starts up, the time is set to your computer's system clock, and the &kstars; clock is running to keep up with the real time. If you want to stop the clock, select the <menuchoice><guimenu>Time</guimenu> <guimenuitem>Stop Clock</guimenuitem></menuchoice> menu item, or simply click on the <guiicon>Stop Clock</guiicon> icon in the toolbar. You can make the clock run slower or faster than normal, or even make it run backward, using the time-step spinbox in the toolbar. This spinbox has two sets of up/down buttons. The first one will step through all 83 available time steps, one by one. The second one will skip to the next higher (or lower) unit of time, which allows you to make large timestep changes more quickly.
fr: Quand &kstars; démarre, l'heure est réglée sur l'horloge de votre ordinateur, l'horloge de &kstars; fonctionne pour rester en phase avec l'heure réelle. Si vous voulez arrêter l'horloge, sélectionnez <menuchoice><guimenu>Heure</guimenu> <guimenuitem>Arrêter l'horloge</guimenuitem></menuchoice> ou cliquez simplement sur l'icône de barre d'outils <guiicon>Arrêter l'horloge</guiicon>. Vous pouvez faire avancer l'horloge plus vite ou moins vite que la normale, ou même la faire reculer, en utilisant le compteur de pas de temps dans la barre d'outils. Ce compteur dispose de deux jeux de boutons haut/bas. Le premier circule parmi les 83 pas disponibles, un par un. Le deuxième sautera vers l'unité de temps suivante plus haute (ou plus basse), ce qui permet de faire de grands changements plus rapidement.

source: Setting
fr: Paramètres

source: You can set the time and date by selecting the <menuchoice><guimenu>Time</guimenu> <guimenuitem>Set Time...</guimenuitem></menuchoice> menu item, or by pressing the <guiicon>Time</guiicon> icon in the toolbar. The <guilabel>Set Time</guilabel> window uses a standard &kde; Date Picker widget, coupled with a spinbox for setting the hours and minutes. If you want to re-synchronize the simulation clock back to the current CPU time, just select the <menuchoice><guimenu>Time</guimenu> <guimenuitem>Set Time to Now</guimenuitem></menuchoice> menu item.
fr: Vous pouvez régler l'heure et la date en sélectionnant <menuchoice><guimenu>Heure</guimenu> <guimenuitem>Régler l'heure…</guimenuitem></menuchoice> ou en actionnant l'icône de barre d'outils <guiicon>Heure</guiicon>. La fenêtre <guilabel>Définir l'heure</guilabel> utilise un composant graphique de date standard de &kde;, couplé avec trois compteurs pour régler les heures, minutes et secondes. Si vous voulez synchroniser à nouveau l'horloge de simulation avec l'heure réelle, sélectionnez simplement <menuchoice><guimenu>Heure</guimenu> <guimenuitem>Régler l'heure à maintenant</guimenuitem></menuchoice>.

source: Extended range of dates
fr: Plages de dates élargies

source: &kstars; can accept very remote dates beyond the usual limits imposed by QDate. Currently, you can set the date between the years -100000 and +100000. We may extend this range even further in future releases. However, please be aware that the accuracy of the simulation becomes more and more degraded as more remote dates are examined. This is especially true for the positions of solar system bodies.
fr: &kstars; peut accepter des dates très lointaines, au-delà des limites habituelles imposées par QDate. Actuellement, vous pouvez fixer une date entre les années -100 000 et +100 000. Nous pourrions étendre cette plage lors de versions futures. Cependant, soyez averti que l'exactitude de la simulation devient de plus en plus dégradée pour les dates les plus lointaines. C'est particulièrement vrai pour les positions des corps du système solaire.

source: The Configure &kstars; Window
fr: La fenêtre de configuration de &kstars;

source: Configure &kstars; window
fr: La fenêtre de configuration de &kstars;

source: The <guilabel>Configure - &kstars;</guilabel> window allows you to modify a wide range of display options. You can access the window with the <guiicon>Configure</guiicon> toolbar icon, or by selecting the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem></menuchoice> menu item. The window is depicted below:
fr: La fenêtre <guilabel>Configuration de &kstars;</guilabel> vous permet de modifier une grande variété d'options d'affichage. Vous pouvez accéder à la fenêtre avec l'icône de barre d'outils <guiicon>Configurer</guiicon> ou en sélectionnant le menu <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Configurer &kstars;…</guimenuitem></menuchoice>. Cette fenêtre est décrite ci-après :

source: <screeninfo>Configure - &kstars; Window</screeninfo>
fr: <screeninfo>Fenêtre de configuration de &kstars;</screeninfo>

source: <phrase>Configure - &kstars; Window</phrase>
fr: <phrase>Fenêtre de configuration de &kstars;</phrase>

source: The <guilabel>Configure - &kstars;</guilabel> window is divided into fourteen pages: <guilabel>Catalogs</guilabel>, <guilabel>Solar System</guilabel>, <guilabel>Satellites</guilabel>, <guilabel>Supernovae</guilabel>, <guilabel>Guides</guilabel>, <guilabel>Terrain</guilabel>, <guilabel>Image Overlays</guilabel>, <guilabel>Colors</guilabel>, <guilabel>FITS</guilabel>, <guilabel>INDI</guilabel>, <guilabel>Ekos</guilabel>, <guilabel>Xplanet</guilabel>, <guilabel>Advanced</guilabel> and <guilabel>Developer</guilabel>.
fr: La fenêtre <guilabel>Configuration de &kstars;</guilabel> est divisée en quatorze pages : <guilabel>Catalogues</guilabel>, <guilabel>Système solaire</guilabel>, <guilabel>Satellites</guilabel>, <guilabel>Supernova</guilabel>, <guilabel>Guides</guilabel>, <guilabel>Terrain</guilabel>, <guilabel>Superposition d'image</guilabel>, <guilabel>Couleurs</guilabel>, <guilabel>FITS</guilabel>, <guilabel>INDI</guilabel>, <guilabel>Ekos</guilabel>, <guilabel>XPlanet</guilabel>, <guilabel>Avancé</guilabel> et <guilabel>Développeurs</guilabel>.

source: <secondary>Catalogs page</secondary>
fr: <secondary>Page de catalogues</secondary>

source: In the <guilabel>Catalogs</guilabel> page, you determine several properties concerning the display of the star and deep sky object catalogs.
fr: Sur la page des <guilabel>Catalogues</guilabel>, Vous pouvez choisir plusieurs configurations concernant l'affichage des catalogues des étoiles et des objets du ciel profond.

source: Solar System page
fr: Onglet Système solaire

source: In the <guilabel>Solar System</guilabel> page, you can specify whether the Sun, Moon, planets, comets and asteroids are displayed.
fr: Sur la page du <guilabel>Système solaire</guilabel>, vous pouvez spécifier si le Soleil, la Lune, les planètes, les comètes et les astéroïdes sont affichés.

source: Satellites page
fr: Page des satellites

source: The <guilabel>Satellites</guilabel> page allows you to set the satellites view options.
fr: L'onglet des <guilabel>satellites</guilabel> vous permet de définir les options d'affichage des satellites.

source: Supernovae page
fr: Page des supernova

source: The <guilabel>Supernovae</guilabel> page allows you to manage how supernovae are displayed by &kstars;.
fr: L'onglet <guilabel>Supernova</guilabel> permet de gérer la manière dont les supernova sont affichées dans &kstars;.

source: Guides page
fr: Onglet Guides

source: The <guilabel>Guides</guilabel> page lets you toggle whether non-objects are displayed (&ie;, constellation lines, constellation names, the Milky Way contour).
fr: La page des <guilabel>Guides</guilabel> vous permet d'afficher ou non les non-objets (c'est-à-dire les lignes de constellations, leurs noms ou encore le contour de la Voie Lactée).

source: Sky culture
fr: Culture du ciel

source: It is possible to choose a <guilabel>Sky culture:</guilabel> for the constellation lines and names on this page. The current version of &kstars; includes data for more than a dozen sky cultures.
fr: Il est possible de choisir une <guilabel>culture du ciel</guilabel> (civilisation) pour les lignes de constellations et les noms sur cette page. La version actuelle de &kstars; inclut des données pour plus d'une dizaine de cultures du ciel.

source: Terrain page
fr: Page Terrain

source: Terrain image
fr: Image du terrain

source: Customizing
fr: Personnalisation

source: The <guilabel>Terrain</guilabel> page allows you to set the terrain or landscape image and configure its speedup options.
fr: La page des <guilabel>terrains</guilabel> vous permet de définir les terrains ou les images de paysage et de configurer leurs options d'accélération.

source: Image Overlays page
fr: Page de superposition d'image

source: <primary>Image Overlays</primary>
fr: <primary>Superposition d'image</primary>

source: The <guilabel>Image Overlays</guilabel> page allows you to add and manage your own images that will be displayed in the skymap.
fr: La page de <guilabel>Superposition d'image</guilabel> permet d'ajouter et de gérer vos propres images qui peuvent être affichées dans la carte du ciel.

source: Colors page
fr: Pages Couleurs

source: Color Schemes
fr: Chartes de couleurs

source: The <guilabel>Colors</guilabel> page allows you to set the color scheme, and to define new custom color schemes.
fr: La page des <guilabel>couleurs</guilabel> vous permet de définir le thème de couleur, et de définir des thèmes de couleurs personnalisés.

source: For detailed explanation of the options on the <guilabel>FITS</guilabel> page see the <link linkend="fits-configure">Configure FITS</link> section.
fr: Pour une explication détaillée des options sur <guilabel>FITS</guilabel>, veuillez vous reporter à la section <link linkend="fits-configure">Configurer FITS</link>.

source: For detailed explanation of the options on the <guilabel>INDI</guilabel> page see the <link linkend="indi-configure">Configure INDI</link> section.
fr: Pour une explication détaillée des options sur <guilabel>INDI</guilabel>, veuillez vous reporter à la section <link linkend="indi-configure">Configurer INDI</link>.

source: For detailed explanation of <guilabel>Ekos</guilabel> astrophotography suite, see the <link linkend="ekos">Ekos section of this manual</link>.
fr: Pour une explication détaillée des options de la suite astrophotographie <guilabel>Ekos</guilabel>, veuillez vous reporter à la section <link linkend="ekos">Section Ekos</link> de ce manuel.

source: Xplanet page
fr: Page de XPlanet

source: The <guilabel>Xplanet</guilabel> page provides fine-grained control over <ulink url="http://xplanet.sourceforge.net/">Solar system planet surface renderer Xplanet</ulink> (should be installed separately).
fr: La page de <guilabel>XPlanet</guilabel> fournit un contrôle détaillé du <ulink url="http://xplanet.sourceforge.net/">rendu de la surface des planètes du système solaire par XPlanet</ulink> (à installer séparément).

source: Advanced page
fr: Page Avancé

source: The <guilabel>Advanced</guilabel> page provides fine-grained control over the more subtle behaviors of &kstars;.
fr: La page <guilabel>Avancé</guilabel> fournit un contrôle fin des comportements les plus subtils de &kstars;.

source: The <guilabel>Developer</guilabel> page allows you to enable or disable a few options mostly useful for developers or for folks looking to help debug issues. Currently these are enabling the saving of images during Ekos's autofocus, guiding and alignment.
fr: La page des <guilabel>Développeurs</guilabel> permet d'activer ou de désactiver quelques options surtout utiles pour les développeurs ou pour les personnes qui souhaitent aider à déterrer les bogues. Actuellement elles activent l'enregistrement des images des processus de mise au point automatique, de guidage et d'alignement.

source: <title>Catalogs</title>
fr: <title>Catalogues</title>

source: <primary>Catalogs</primary>
fr: <primary>Catalogues</primary>

source: <screeninfo>Catalogs Window</screeninfo>
fr: <screeninfo>Fenêtre des catalogues</screeninfo>

source: <phrase>Catalogs Window</phrase>
fr: <phrase>Fenêtre des catalogues</phrase>

source: <primary>Catalogs page</primary>
fr: <primary>Page des catalogues</primary>

source: Short overview
fr: Aperçu court

source: In the <guilabel>Catalogs</guilabel> page, you can configure which object catalogs are displayed by &kstars;, as well as how much information you would like to be included on the Sky Map. By default, &kstars; includes ~300,000 named and unnamed stars up to magnitude 8. For Deep Sky Objects, the included catalog is the New General Catalog (<quote>NGC</quote>) including the Index Catalog (<quote>IC</quote>) and the Messier Catalog.
fr: Sur la page <guilabel>Catalogues</guilabel>, vous pouvez configurer les catalogues que &kstars; affichera, ainsi que la quantité d'information qu'affichera &kstars;. Par défaut, &kstars; inclut plus de 300 000 noms d'étoiles connues et inconnues jusqu'à la magnitude 8. Pour les objets du ciel profond, sont inclus les catalogues <quote>NGC</quote>, <quote>IC</quote> et <quote>Messier</quote>.

source: The New General Catalog of Nebulae and Clusters of Stars (abbreviated as NGC) is a catalog of ca 7,840 deep-sky objects.
fr: Le catalogue NGC inclut environ 7 840 objets du ciel profond.

source: The Index Catalog of Nebulae and Clusters of Stars (abbreviated as IC) serves as a supplement to the NGC, and contains an additional 5,386 objects, collectively known as the IC objects.
fr: Le catalogue IC complète le catalogue NGC avec quelques 5 386 objets supplémentaires.

source: You can install new catalogs using &kstars; <quote>Add-On Installer</quote>. You can open it via the <menuchoice><guimenu>Data</guimenu> <guimenuitem>Download New Data...</guimenuitem></menuchoice> menu item. You can choose from a list of catalogs, including (but not limited to):
fr: Vous pouvez installer de nouveaux catalogues avec l'<quote>installateur d'extension</quote>. Vous pouvez l'ouvrir en allant dans le menu <menuchoice><guimenu>Données</guimenu> <guimenuitem>Télécharger de nouvelles données…</guimenuitem></menuchoice>. Vous pouvez choisir à partir d'une liste de catalogues qui inclut (mais n'est pas limité à) :

source: Steinicke NGC/IC Catalog: is a more complete NGC/IC catalog.
fr: Le catalogue NGC/IC de Steinicke qui est un catalogue plus complet que le NGC/IC.

source: Abell Planetary Nebulae Catalog: is a catalog of 86 planetary nebulae. The maximum magnitude is represented by Abell 47's value of 19.5.
fr: Le catalogue des nébuleuses planétaires de Abell contenant 86 nébuleuses planétaires. La magnitude maximale est atteinte par le 47 ième objet dont la valeur est 19,5.

source: Sharpless HII region Catalog: is the Sharpless (Sh2) catalog of HII regions (diffuse nebulae).
fr: Le catalogue « Sharpless » de la région « HII » (Sh2) contient les régions des nébuleuses diffuses.

source: Hickson Compact Groups: is a catalog consisting of 99 compact groups of galaxies.
fr: Les groupes compacts de Hickson forment un catalogue contenant un groupe compact de 99 galaxies.

source: Tycho-2 Star Catalog: is a catalog of more than 2.5 million of the brightest stars. It contains stars with a magnitude value from 8.0 to 12.5.
fr: Le catalogue Tycho-2 Star contient plus de 2,5 millions d'étoiles les plus brillantes. Il contient des étoiles de magnitude allant de 8,0 à 12,5.

source: USNO NOMAD Catalog: is a catalog of about 100 million stars with magnitude from 12.5 to 16.5. Note that is requires Tycho-2 to be installed.
fr: Le catalogue NOMAD USNO contient plus de 100 millions d'étoiles de magnitude 12,5 à 16.5. Veuillez noter que le catalogue Tycho-2 doit être préalablement installé.

source: The following is a summary of catalogs in &kstars;:
fr: Ce qui suit est un résumé des catalogues de &kstars; :

source: Stars Catalogs
fr: Catalogues des étoiles

source: Name
fr: Nom

source: Abbreviation
fr: Abréviation

source: Number of objects
fr: Nombre d'objets

source: Add-On
fr: Extension

source: Default
fr: Défaut

source: Default Catalog
fr: Catalogue par défaut

source: Up to 8 magnitude
fr: Jusqu'à la magnitude 8

source: <entry>No</entry>
fr: <entry>Non</entry>

source: <entry>Yes</entry>
fr: <entry>Oui</entry>

source: more than 2.5 million
fr: plus de 2,5 millions

source: Naval Observatory Merged Astronomic Dataset
fr: Ensemble de données NOMAD

source: 100 million
fr: 100 millions

source: Deep-sky objects Catalogs
fr: Catalogues des objets du ciel profond

source: New General Catalog of Nebulae and Clusters of Stars (OpenNGC)
fr: Nouveau catalogue général (NGC) des nébuleuses et des amas d'étoiles (OpenNGC)

source: Abell Planetary Nebulae Catalog
fr: Catalogue Abell des nébuleuses planétaires

source: Up to 19.5 magnitude
fr: Jusqu'à la magnitude 19,5

source: Sharpless HII region Catalog
fr: Catalogue Sharpless des régions HII

source: Hickson Compact Groups
fr: Groupes compacts de Hickson

source: A potentially more up-to-date listing can be found in the <ulink url="https://protagon.space/catalogs/pages/catalogs.html">catalog repository documentation</ulink>.
fr: Une liste probablement plus à jour peut être trouvée dans la documentation du <ulink url="https://protagon.space/catalogs/pages/catalogs.html">dépôt de catalogue</ulink>.

source: Star catalogs
fr: Catalogues des étoiles
