Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_indi.po
Languages: fr

source: Astronomical Device Control with <acronym>INDI</acronym>
fr: Contrôle de matériel astronomique avec <acronym>INDI</acronym>

source: INDI Control
fr: Contrôle INDI

source: Overview
fr: Survol

source: &kstars; provides an interface to configure and control astronomical instruments via the <acronym><link linkend="what-is-indi">INDI</link></acronym> protocol.
fr: &kstars; fournit une interface pour configurer et piloter les instruments astronomiques par le protocole <acronym><link linkend="what-is-indi">INDI</link></acronym>.

source: The <acronym>INDI</acronym> protocol supports a variety of astronomical instruments such as CCD cameras and focusers. For an up to date list of supported devices, please visit <acronym>INDI</acronym> <ulink url="https://indilib.org/index.php?title=Devices">supported devices page</ulink>.
fr: Le protocole <acronym>INDI</acronym> gère une grande variété d'instruments astronomiques, comme les caméra CCD et les viseurs. Pour une liste à jour des matériels pris en charge, veuillez consulter la page <acronym>INDI</acronym> <ulink url="https://indilib.org/index.php?title=Devices"> des matériels gérés</ulink>.

source: INDI Setup
fr: Réglage INDI

source: Setup
fr: Configuration

source: &kstars; can control local and remote devices seamlessly via the <link linkend="what-is-indi">INDI</link> server/client architecture. INDI devices may be run in three different modes:
fr: &kstars; peut contrôler des périphériques locaux et distants sans peine par l'architecture client/serveur <link linkend="what-is-indi">INDI</link>. Les périphériques INDI peuvent fonctionner dans trois modes différents :

source: <guilabel>Local</guilabel>: The local mode is the most common and is used to control local device (&ie; a device attached to your machine).
fr: <guilabel>local</guilabel> : le mode local est le plus commun et sert à contrôler le matériel local (&ie; attaché à votre machine).

source: <guilabel>Server</guilabel>: The server mode establishes an INDI server for a particular device and waits for connections from remote clients. You cannot operate server devices, you can only start and shut them down.
fr: <guilabel>serveur</guilabel> : le mode serveur établit un serveur INDI pour un matériel particulier et attend les connexions des clients distants. Vous ne pouvez pas manipuler les périphériques serveurs, vous ne pouvez que les démarrer et les arrêter.

source: <guilabel>Client</guilabel>: The client mode is used to connect to remote INDI servers running INDI devices. You can control remote devices seamlessly like local devices.
fr: <guilabel>client</guilabel> : le mode client sert à se connecter à des serveurs INDI faisant fonctionner des périphériques INDI. Vous pouvez contrôler des périphériques sans peine comme des périphériques locaux.

source: You can run local device, establish INDI servers, and connect to remote clients from the <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>Device Manager...</guimenuitem></menuchoice> menu item.
fr: Vous pouvez lancer un périphérique local, établir des serveurs INDI et connecter à des clients distants depuis le <menuchoice><guimenuitem>Gestionnaire de périphériques</guimenuitem> dans le menu <guimenu>Périphériques</guimenu></menuchoice>.

source: Here is a screenshot of the <guilabel>Device Manager</guilabel> window:
fr: Voici une capture d'écran de la fenêtre de <guilabel>Gestionnaire de matériel</guilabel> :

source: Running device drivers
fr: Lancer les pilotes de périphérique

source: Start device drivers
fr: Démarrer les pilotes de périphériques

source: You can run devices by browsing the device tree, selecting a specific device, and then clicking on the <guibutton>Run Service</guibutton> button. You can select the operation mode, either local or server as defined above. The port number is randomly generated between the range from 7624 to 10,000. To specify a port, click on the port column next to the desired driver. &kstars; allows multiple drivers to run under one INDI server, and hence one port. Select multiple drivers then press <guibutton>Run Service</guibutton> button.
fr: Vous pouvez démarrer des périphériques en naviguant dans l'arborescence, sélectionnez un périphérique spécifique, puis cliquez sur le bouton <guibutton>Démarrer le service</guibutton>. Vous pouvez sélectionner le mode de fonctionnement, soit local ou serveur tel que défini ci-dessus. Le numéro de port est généré de façon aléatoire entre la plage de 7624 à 10000. Pour spécifier un port, cliquez sur la colonne de port à côté du pilote de périphériques désiré. &kstars; permet aux pilotes de périphériques de faire fonctionner plusieurs pilotes sous un même serveur INDI, et donc un seul port. Sélectionnez plusieurs pilotes puis appuyez sur le bouton <guibutton>Démarrer le service</guibutton>.

source: To control remote devices, refer to the <link linkend="indi-remote-control">remote device control</link> section.
fr: Pour contrôler les périphériques distants, référez-vous à la section <link linkend="indi-remote-control">contrôle de périphérique distant</link>.

source: Telescope Setup
fr: Réglage du télescope

source: Most telescopes are equipped with <hardware>RS232</hardware> interface for remote control. Connect the RS232 jack in your telescope to your computer's <hardware>Serial/USB</hardware> port. Traditionally, the RS232 connects to the serial port of your computer, but since many new laptops abandoned the serial port in favor of <hardware>USB/FireWire</hardware> ports, you might need to obtain a Serial to USB adaptor to use with new laptops.
fr: La plupart des télescopes sont équipés d'une interface <hardware>RS232</hardware> pour la télécommande. Connectez la prise RS232 de votre télescope dans la prise <hardware>série / USB</hardware> de votre ordinateur. Habituellement, le RS232 se connecte au port série de votre ordinateur, mais, comme beaucoup de nouveaux portables ont abandonné le port série en faveur de ports <hardware>USB / Firewire</hardware>, vous pouvez avoir besoin de vous procurer un adaptateur USB pour utilisation avec les nouveaux portables.

source: After connecting your telescope to the Serial/USB port, turn your telescope on. It is <emphasis>highly</emphasis> recommended that you download and install the latest firmware for your telescope controller.
fr: Après avoir connecté votre télescope au port Série / USB, allumez votre télescope. Il est <emphasis>hautement</emphasis> recommandé de télécharger et installer le firmware (logiciel embarqué) le plus récent pour votre contrôleur de télescope.

source: The telescope needs to be aligned before it can be used properly. Align your telescope (one or two stars alignment) as illustrated in your telescope manual.
fr: Le télescope doit être aligné avant de pouvoir être utilisé correctement. Alignez votre télescope (une ou deux étoiles d'alignement) comme illustré dans le manuel de votre télescope.

source: &kstars; needs to verify time and location settings before connecting to the telescope. This insures proper tracking and synchronization between the telescope and &kstars;. The following steps will enable you to connect to a device that is connected to your computer. To connect and control remote devices, please refer to <link linkend="indi-remote-control">remote device control</link> section.
fr: &kstars; a besoin de vérifier les réglages d'heure et d'emplacement avant de se connecter au télescope. Ceci assure un suivi propre et une synchronisation entre le télescope et &kstars;. Les étapes suivantes vous permettront de connecter un matériel qui est connecté à votre ordinateur ; pour connecter et contrôler les périphériques distants, veuillez vous rapporter à la section <link linkend="indi-remote-control">Contrôle des périphériques distants</link>.

source: You can use the Telescope Setup Wizard and it will verify all the required information in the process. It can automatically scan ports for attached telescopes. You can run the wizard by selecting the <menuchoice><guimenu>Devices</guimenu> <guimenuitem>Telescope Wizard</guimenuitem></menuchoice> menu item.
fr: Vous pouvez utiliser l'assistant de configuration du télescope, et il vérifiera toutes les informations nécessaires au processus. Il peut balayer automatiquement les ports pour les télescopes attachés. Vous pouvez lancer l'assistant de configuration en sélectionnant <menuchoice><guimenuitem>Assistant de configuration de télescope</guimenuitem> dans le menu <guimenu>Périphériques</guimenu></menuchoice>.

source: Alternatively, you can connect to a local telescope by performing the following steps:
fr: D'une autre manière, vous pouvez connecter un télescope local en effectuant les étapes suivantes :

source: Set your geographical location. Open the <guilabel>Set Geographic Location</guilabel> window by selecting the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Geographic...</guimenuitem></menuchoice> menu item, or by pressing the <guiicon>Globe</guiicon> icon in the toolbar, or by pressing <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo>.
fr: Déterminez votre emplacement géographique. Ouvrez la fenêtre <menuchoice><guimenuitem>Emplacement géographique…</guimenuitem>depuis le menu <guimenu>Configuration</guimenu></menuchoice> ou en actionnant l'icône représentant un <guiicon>Globe</guiicon> dans la barre d'outils, ou en saisissant <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo>.

source: Set your local time and date. You can change to any time or date by selecting <menuchoice><guimenu>Time</guimenu> <guimenuitem>Set Time...</guimenuitem></menuchoice> menu item, or by pressing the <guiicon>Time</guiicon> icon in the toolbar. The <guilabel>Set Time</guilabel> window uses a standard &kde; Date Picker widget. If you ever need to reset the clock back to the current time, just select the <menuchoice><guimenu>Time</guimenu> <guimenuitem>Set Time to Now</guimenuitem></menuchoice> menu item.
fr: Déterminez vos heure et date locales. Vous pouvez changer en n'importe quelle heure ou date en sélectionnant <menuchoice><guimenuitem>Définir l'heure…</guimenuitem> dans le menu <guimenu>Heure</guimenu></menuchoice> ou en actionnant l'icône <guiicon>Heure</guiicon> dans la barre d'outils. La fenêtre <guilabel>Régler l'heure</guilabel> utilise un composant graphique de choix de date standard dans &kde;. Si vous avez besoin de remettre l'horloge à l'heure actuelle, actionnez simplement <menuchoice><guimenuitem>Régler l'heure à maintenant</guimenuitem> dans le menu <guimenu>Heure</guimenu></menuchoice>.

source: Click on the <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>Device Manager...</guimenuitem></menuchoice> menu item.
fr: cliquez sur le menu <menuchoice><guimenu>Périphériques</guimenu> et sélectionnez <guimenuitem>Gestionnaire de périphériques…</guimenuitem></menuchoice>

source: Under the <guilabel>Device</guilabel> column, select your telescope model.
fr: sous la colonne <guilabel>Périphérique</guilabel>, sélectionnez votre modèle de télescope.

source: Click on the <guibutton>Run Service</guibutton> button.
fr: cliquez sur le bouton <guibutton>Lancer le service</guibutton>.

source: Click <guibutton>Close</guibutton> to leave the Device Manager Dialog.
fr: cliquez sur le bouton <guibutton>Fermer</guibutton> pour fermer la boîte de dialogue du gestionnaire de matériel.

source: Frequent Settings
fr: Réglages fréquents

source: You do not need to set the geographic location and time every time you connect to a telescope. Only adjust the settings as needed.
fr: Vous n'avez pas besoin de déterminer l'emplacement géographique à chaque fois que vous connectez un télescope. N'ajustez que les réglages nécessaires.

source: You are now ready to use the device features, &kstars; conveniently provides two interchangeable &GUI; interfaces for controlling telescopes:
fr: Vous êtes maintenant prêt à utiliser les fonctions du périphérique. &kstars; fournit deux interfaces graphiques interchangeables pour contrôler les télescopes :

source: Controlling your telescope
fr: Contrôler votre télescope

source: <guilabel>Sky map Control</guilabel>: For each device you run in the <guilabel>Device Manager</guilabel>, a corresponding entry will show up in popup menu that allows you to control the properties of the device. You can issue commands like <command>Slew</command>, <command>Sync</command>, and <command>Track</command> directly from the sky map.
fr: <guilabel>Contrôle de la carte du ciel</guilabel> : pour chaque périphérique que vous lancez dans le <guilabel>gestionnaire de périphériques</guilabel>, une entrée correspondants s'affichera dans un menu contextuel qui vous permet de contrôler les propriétés du périphérique. Vous pouvez exécuter des commandes comme <command>Pivoter</command>, <command>Synchroniser</command> et <command>Suivre</command> directement depuis la carte du ciel.

source: Here is a screenshot of the popup menu with an active LX200 Classic device:
fr: Voici une capture d'écran du menu contextuel avec un périphérique actif LX200 Classic :

source: Controlling devices from sky map
fr: Contrôle des périphériques depuis la carte du ciel

source: <guilabel>INDI Control Panel</guilabel>: The panel offers the user with all the features supported by a device.
fr: <guilabel>Tableau de bord INDI</guilabel> : le tableau de bord offre à l'utilisateur toutes les fonctions gérées par un périphérique.

source: The panel is divided into three main sections:
fr: Le panneau est divisé en trois sections principales :

source: <guilabel>Device tabs</guilabel>: Each additional active device occupies a tab in the INDI panel. Multiple devices can run simultaneously without affecting the operation of other devices.
fr: <guilabel>Onglets des périphériques</guilabel> : chaque périphérique actif additionnel occupe un onglet dans le panneau INDI. De multiples périphériques peuvent fonctionner simultanément sans affecter les opérations des autres périphériques.

source: Property views on the <guilabel>Main Control</guilabel> and <guilabel>Options</guilabel> tabs: Properties are the key element in INDI architecture. Each device defines a set of properties to communicate with the client. The current position of the telescope is an example of a property. Semantically similar properties are usually contained in logical blocks or groupings.
fr: Affichage des propriétés dans les onglets <guilabel>Contrôle principal</guilabel> et <guilabel>Options</guilabel> : les propriétés sont l'élément-clé dans l'architecture INDI. Chaque périphérique définit un jeu de propriétés pour communiquer avec le client. La position courante du télescope est un exemple de propriété. Des propriétés semblables du point de vue sémantique sont habituellement contenues dans des blocs logiques ou des groupes.

source: <guilabel>Log viewer</guilabel>: Devices report their status and acknowledge commands by sending INDI messages. Each device has its own log view. A device usually sends messages to its device driver only, but a device is permitted to send a generic message when appropriate.
fr: <guilabel>Afficheur de journaux</guilabel> : les périphériques rapportent leur état et accusent réception des commandes en envoyant des messages INDI. Chaque périphérique a son propre journal. Un périphérique n'envoie habituellement des messages qu'à son pilote de périphérique, mais un périphérique peut envoyer un message générique lorsque c'est approprié.

source: INDI Control Panel
fr: Tableau de bord INDI

source: You are not restricted on using one interface over another as they can be both used simultaneously. Actions from the <guilabel>Sky map</guilabel> are automatically reflected in the <guilabel>INDI Control Panel</guilabel> and vice versa.
fr: Vous n'êtes pas limité à l'utilisation d'une interface par le chevauchement, car les deux peuvent être utilisées simultanément. Les actions de <guilabel>Carte du ciel</guilabel> sont reflétés automatiquement dans le <guilabel>Tableau de bord INDI</guilabel> et vice versa.

source: To connect to your telescope, you can either select <guimenuitem>Connect</guimenuitem> from your device popup menu or alternatively, you can press <guibutton>Connect</guibutton> under your device tab in the <guilabel>INDI Control Panel</guilabel>.
fr: Pour connecter votre télescope, vous pouvez soit sélectionner <guimenuitem>Connecter</guimenuitem> du menu contextuel des périphériques, soit actionner <guibutton>Connecter</guibutton> sous votre onglet de périphérique dans le <guilabel>Tableau de bord INDI</guilabel>.

source: By default, &kstars; will try to connect to the <constant>/dev/ttyS0</constant> port. To change the connection port, select the <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>INDI Control Panel...</guimenuitem></menuchoice> menu item and change the port under your device tab.
fr: Par défaut, &kstars; essayera de se connecter au port <constant>/dev/ttyS0</constant>. Pour changer le port de connexion, sélectionnez <menuchoice><guilabel>Tableau de bord INDI</guilabel> dans le menu <guimenu>Périphériques</guimenu></menuchoice> et changez le port sous l'onglet de votre périphérique.

source: &kstars; automatically updates the telescope's longitude, latitude, and time based on current settings in &kstars;. You can enable/disable these using the <guilabel>INDI</guilabel> page from the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem></menuchoice> menu item. Using the <guilabel>INDI</guilabel> page you can configure &kstars; to display or not INDI status messages in the status bar. By default INDI server port numbers have values between the range from 7624 to 9000, but you can easily change the range using the <guilabel>From:</guilabel> and <guilabel>To:</guilabel> text boxes from the <guilabel>Server Port</guilabel> section.
fr: &kstars; met à jour automatiquement la longitude, la latitude et l'heure basés sur les réglages actuels de &kstars;. Vous pouvez les activer/désactiver en utilisant la page <guilabel>INDI</guilabel> dans le menu <menuchoice><guimenu>Configurations</guimenu> <guimenuitem>Configurer &kstars;</guimenuitem></menuchoice>. Dans la page <guilabel>INDI</guilabel>, vous pouvez indiquez à &kstars; d'afficher ou non les messages d'INDI dans la barre d'état. Par défaut, les numéros de port du serveur INDI se trouve dans la plage 7624 à 9000, mais vous pouvez facilement modifier cette plage en utilisant les boîtes de texte <guilabel>De</guilabel> et <guilabel>À</guilabel> de la section <guilabel>Port du serveur</guilabel>.

source: If &kstars; communicates successfully with the telescope, it will retrieve the current <abbrev>RA</abbrev> and <abbrev>DEC</abbrev> from the telescope and will display a crosshair on the sky map indicating the telescope position. You can hide the crosshair that marks telescope position using <guilabel>INDI</guilabel> page from the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem></menuchoice> menu item.
fr: Si &kstars; réussit à communiquer avec le télescope, il retrouvera l'<abbrev>AD</abbrev> et la <abbrev>Déc</abbrev> courantes depuis le télescope et affichera une croix sur la carte du ciel, indiquant la position du télescope. Vous pouvez masquer la croix qui indique la position depuis le menu <menuchoice><guimenu>Configurations</guimenu> <guimenuitem>Configurer &kstars;…</guimenuitem></menuchoice>.

source: Synchronizing your telescope
fr: Synchronisation de votre télescope

source: If you aligned your telescope and the last alignment star was, for example, Vega, then the crosshair should be centered around Vega. If the crosshair was off target, then you can <mousebutton>right</mousebutton>-click Vega from the sky map and select <command>Sync</command> from your telescope menu. This action will instruct the telescope to synchronize its internal coordinates to match those of Vega, and the telescope's crosshair should now be centered around Vega.
fr: Si vous avez aligné votre télescope et que la dernière étoile d'alignement a été, par exemple, Vega, la croix doit être centrée autour de Vega. Si la croix était hors cible, vous pouvez cliquer avec le bouton <mousebutton>droit</mousebutton> sur la carte du ciel et sélectionner <command>Synchroniser</command> du menu du télescope. Cette action demandera au télescope de synchroniser ses coordonnées internes pour qu'elles correspondent à celles de Vega et la croix du télescope doit maintenant être centrée autour de Vega.

source: This is it: your telescope is ready to explore the heavens!
fr: Voilà ! Votre télescope est prêt à explorer les cieux !

source: WARNING
fr: AVERTISSEMENT

source: Never use the telescope to look at the sun. Looking at the sun might cause irreversible damage to your eyes and your equipment.
fr: N'utilisez jamais le télescope pour regarder le Soleil. L'observation du Soleil peut causer des dommages irréversibles à vos yeux et à votre équipement.

source: CCD and Video-Capture Setup
fr: Configuration des captures - CCD et vidéo

source: CCD Video Control
fr: Contrôle des CCD Vidéo

source: You can run CCD and Video Capture devices from the <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>Device Manager...</guimenuitem></menuchoice> menu item. Like all INDI devices, some of the device controls will be accessible from the skymap. The device can be controlled fully from the <guimenuitem>INDI Control Panel...</guimenuitem> item.
fr: Vous pouvez lancer des périphériques CCD et de capture vidéo depuis le menu <menuchoice><guimenuitem>Gestionnaire de périphériques</guimenuitem> dans le menu <guimenu>Périphériques</guimenu></menuchoice>. Comme tous les périphériques INDI, certains des contrôles seront accessibles depuis la carte du ciel. Le périphérique peut être contrôlé pleinement depuis le <guimenuitem>Tableau de bord INDI…</guimenuitem>.

source: The standard format for image capture is FITS. Once an image is captured and downloaded, it will be automatically displayed in the &kstars; <link linkend="tool-fitsviewer">FITS Viewer</link>.
fr: Le format standard pour la capture d'images est FITS. Une fois qu'une image est capturée et téléchargée, elle sera affichée dans <link linkend="tool-fitsviewer">l'afficheur FITS</link> de &kstars;.

source: Configure INDI
fr: Configurer INDI

source: Configure
fr: Configurer

source: The <guilabel>INDI</guilabel> page allows you to modify <emphasis>Client side</emphasis> INDI specific options. To access it, select the <guilabel>INDI</guilabel> page from <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem></menuchoice> menu item. The window is divided into several main categories: General, Device Updates, Display and Server Port:
fr: La page d'<guilabel>INDI</guilabel> vous permet de modifier les options spécifiques du <emphasis>Côté client</emphasis> d'INDI. Pour y accéder, sélectionnez <menuchoice><guimenu>Configurations</guimenu> <guimenuitem>Configurer &kstars;</guimenuitem></menuchoice> de cette page. ;La fenêtre est divisée en plusieurs catégories principales : général, mises à jour des périphériques automatique, affichage, source de mise à jour, roue à filtres et port du serveur :

source: General
fr: Général

source: <guilabel>INDI server:</guilabel> Specify the binary of installed INDI server in your system. By default, &kstars; uses <quote>/usr/bin/indiserver</quote> binary.
fr: <guilabel>Serveur INDI</guilabel> : indiquez l'exécutable du serveur INDI installé sur votre système. Par défaut, &kstars; utilise <quote>/usr/bin/indiserver</quote>.
