Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-user-interface.po
Languages: fr

source: <title>User Interface</title>
fr: <title>Interface utilisateur</title>

source: Tools
fr: Outils

source: <tertiary>User Interface</tertiary>
fr: <tertiary>Interface utilisateur</tertiary>

source: Ekos Astrophotography Tool is organized into several <emphasis>Modules</emphasis>. A module is a set of functions and tasks for a particular step in astrophotography and/or data acquisition. Currently, the following modules are included with Ekos:
fr: L'outil d'astrophotographie Ekos est organisé en plusieurs <emphasis>modules</emphasis>. Un module est un ensemble de fonctions et de tâches pour une étape particulière en astrophotographie et/ou dans l'acquisition de données. Actuellement les modules suivants sont inclus dans Ekos :

source: Setup &amp; Summary Module
fr: Module Configuration et résumé

source: <para>Scheduler Module</para>
fr: <para>Module Ordonnanceur</para>

source: <para>Capture Module</para>
fr: <para>Module Acquisition</para>

source: <para>Focus Module</para>
fr: <para>Module Mise au point</para>

source: Alignment Module
fr: Module Alignement

source: <para>Guide Module</para>
fr: <para>Module Guidage</para>

source: <para>Mount Module</para>
fr: <para>Module Monture</para>

source: Each module has its own tab and icon in the graphical user interface as illustrated in the screenshot below:
fr: Chaque module possède son propre onglet et icône dans l'interface graphique utilisateur comme illustré dans la capture d'écran ci-dessous :

source: <screeninfo>Ekos summary cheatsheet</screeninfo>
fr: <screeninfo>Aide-mémoire du résumé Ekos</screeninfo>

source: <phrase>Ekos summary cheatsheet</phrase>
fr: <phrase>Aide-mémoire du résumé Ekos</phrase>

source: Summary &amp; Setup Module
fr: Module Configuration et résumé

source: As its name suggests, this is where you will create and manage your equipment profile, and connect to your devices. It also provides a summary view where the capture progress along with the focus &amp; guide operations is displayed in a compact format to convey the most important information relevant to the user.
fr: Ainsi que suggéré par son nom, c'est ici que vous allez créer et gérer le profil de votre matériel et vous connecter aux périphériques. Il fournit aussi une vue résumant la procédure d'acquisition, de mise au point et de guidage dans un format compact afin de transmettre les informations les plus importantes à l'utilisateur.

source: <term>Scheduler Module</term>
fr: <term>Module Ordonnanceur</term>

source: After mastering Ekos, users are encouraged to learn how to use the Scheduler module since it facilitates the complete observation process greatly. It enables you to select multiple targets, specify which conditions and requirements to be met, and what frames are required for capture. Afterwards the scheduler intelligently calculates the best observation time for each object and then proceed to control the complete observatory from startup to shutdown.
fr: Après la prise en main d'Ekos, les utilisateurs sont encouragés à utiliser le module Ordonnanceur puisqu'il facilite grandement tout le processus d'observation. Il vous permet de choisir plusieurs cibles, de spécifier les conditions à respecter et les trames nécessaires à l'acquisition. Cela fait, l'ordonnanceur calcule le meilleur horaire d'observation pour chaque objet et ensuite prend le contrôle total de la session d'observation, du début jusqu'à la fin.

source: <term>Capture Module</term>
fr: <term>Module Acquisition</term>

source: This is the primary module for camera &amp; filter wheel control. Create imaging sequences, capture previews, and watch video streams. It supports rotator control and can automatically capture flat frames in a number of scenarios.
fr: Ceci est le module principal pour le contrôle de la caméra et de la roue à filtre. Il permet de créer des séquences d'images, d'afficher des aperçus des acquisitions et de visionner des vidéos. Il gère le contrôle du rotateur et peut automatiquement procéder à l'acquisition de <quote>flats</quote> pour de multiples scénarios.

source: <term>Focus Module</term>
fr: <term>Module Mise au point</term>

source: Measure the sharpness of your images in the focus module by calculating Half-Flux-Radius. The lower the HFR, the sharper the image becomes. You can run the focus module with or without a focuser. With an electronic focuser, you can run an autofocus operation where Ekos iterates and calculates the optical focus position.
fr: Mesurez la netteté de vos images avec le module de mise au point en calculant le HFR (Half-Flux-Radius). Plus cette valeur est basse et meilleure sera la netteté. Vous pouvez exécuter le module de mise au point avec ou sans un moteur de mise au point. Avec un moteur de mise au point électronique, vous pouvez exécuter la procédure de mise au point automatique et Ekos procédera par itérations en calculant la position de mise au point optique.

source: <term>Guide Module</term>
fr: <term>Module Guidage</term>

source: To achieve long exposure astrophotography, guiding is necessary to ensure the image is locked and stabilized for the complete duration of the exposure duration. Deviations from the frame with time can lead to blurry images and star trails. In the guide module, it can automatically select a suitable guide star and then lock the mount to always keep that star in its position. If the guide module detects any deviation from this locked position, it sends correction pulses to the mount to bring it back to the original position.
fr: Pour réaliser de l'imagerie à longues poses, il est nécessaire d'utiliser du guidage pour s'assurer que l'image est verrouillée et stabilisée pour toute la durée de l'exposition. Les déviations avec le temps débouchent sur des images floues et des traînées d'étoiles. Le module de guidage permet de sélectionner automatiquement une étoile guide et de verrouiller la monture pour conserver cette étoile toujours à la même position. Si le module détecte une déviation de cette position verrouillée, il envoie des impulsions de correction à la monture pour la ramener à sa position initiale.

source: <term>Mount Module</term>
fr: <term>Module Monture</term>

source: Mount control can be either done via the Sky Map interactively or via the Mount Control Panel in the mount module. Configure telescope properties (focal length &amp; aperture) for both your primary imaging telescope and guide scope. However, it is recommended to select the telescopes in the equipment profile and not change the values directly in the mount module.
fr: La monture peut être contrôlée soit de manière interactive dans la carte du ciel soit avec le tableau de bord de la monture dans le module Monture. Configurez les propriétés du télescope (longueur de la focale et ouverture) pour le télescope imageur et le télescope faisant office de guide. Il est cependant recommandé de configurer les télescopes dans le profil de votre matériel plutôt que de modifier les valeurs directement dans le module Monture.
