Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_eyepieceview.po
Languages: fr

source: <title>Simulate Eyepiece View</title>
fr: <title>Simuler la vue à l'oculaire</title>

source: Tools
fr: Outils

source: <secondary>Simulate Eyepiece View</secondary>
fr: <secondary>Simuler la vue à l'oculaire</secondary>

source: Simulate eyepiece view
fr: Simuler la vue à l'oculaire

source: Example View
fr: Vue exemple

source: On the left hand side is the sky map shot from &kstars;. On the right hand side is the POSS (DSS) image of the same region. The orientation in the above example has been adjusted to match the view through a Dobsonian telescope at the location and time of the simulation in &kstars;.
fr: Sur la gauche se trouve une prise de la carte du ciel de &kstars;. Sur la droite, on voit une image POSS (DSS) de la même région. L'orientation de cet exemple a été ajustée pour correspondre à la vue à travers un télescope de Dobson à l'emplacement et à l'heure de la simulation dans &kstars;.

source: This tool simulates how an object looks through your eyepiece. In addition to rendering the eyepiece field, &kstars; can also fetch and overlay the DSS imagery. Additionally, if you are using a Dobsonian telescope, you can rotate the field of view to match the eyepiece view.
fr: Cet outil simule la vue d'un objet obtenue à travers votre oculaire. En plus de rendre le champ de l'oculaire, &kstars; peut aller chercher et superposer une image DSS. De plus, si vous utiliser un Dobson, vous pouvez faire tourner le champ de vision pour le faire correspondre avec la vue à l'oculaire.

source: To use this feature, first define your eyepieces' fields of view using the <link linkend="customize">FOV Symbol editor</link>.
fr: Pour utiliser cette fonctionnalité, vous devez d'abord définir les champs de vue de vos oculaires en utilisant l'outil <link linkend="customize">Indicateurs de champ de vision</link>.

source: Then there are two ways to invoke the feature:
fr: Ensuite il y a deux manières d'invoquer cette fonctionnalité :

source: In Sky Map, right click on the desired object and click <guilabel>Simulate eyepiece view</guilabel> in the popup menu.
fr: Dans la carte du ciel, cliquez avec le bouton droit de la souris sur l'objet désiré et cliquez sur <guilabel>Simuler la vue à l'oculaire</guilabel> dans le menu.

source: In observation planner, right click an object and click <guilabel>Simulate eyepiece view</guilabel> in the popup menu.
fr: Dans le planificateur d'observations, cliquez avec le bouton droit de la souris et cliquez ensuite sur <guilabel>Simuler la vue à l'oculaire</guilabel> dans le menu.

source: When the tool is first invoked, it will prompt a dialog to select the desired FOV to render the view. To compare the rendered view against a real sky image, click the <guibutton>Fetch DSS image</guibutton> button to download a DSS image. You can manually adjust the view to match your eyepiece using the rotation slider, the <guilabel>Invert view</guilabel> and <guilabel>Flip view</guilabel> check boxes. Alternatively, you can use a pre-calculated amount of rotation by using one item of the <guilabel>Preset:</guilabel> dropdown box that is tailored for different optical systems.
fr: À la première invocation de cet outil, on vous demandera de choisir le champ de vue à utiliser pour afficher la vue. Vous pouvez comparer cette vue avec une vraie image du ciel en cliquant sur le bouton <guibutton>Chercher image DSS</guibutton> pour télécharger une image. Vous pouvez ajuster l'angle de rotation avec le curseur pour que la correspondance soit correcte, ou <guilabel>Inverser la vue</guilabel> et <guilabel>Retourner la vue</guilabel> en cochant les cases correspondantes. Sinon vous pouvez utiliser une quantité précalculée de rotation en utilisant un des éléments de la liste déroulante <guilabel>Préréglages</guilabel> qui est adapté à différents systèmes optiques.

source: Arp84 eyepiece view
fr: Vue à l'oculaire de Arp 84

source: View with Overlay
fr: Voir avec superposition

source: Arp84 eyepiece view with ticks enabled indicating how the chart must be oriented to match the eyepiece view through a Dobsonian at a given time (the generated data is for location McDonald Observatory Texas, and the date is 14th Dec 2016).
fr: La vue à l'oculaire de Arp 84 avec un marquage indiquant comment le graphique doit être orienté pour correspondre à la vue à travers un Dobson à une heure donnée.

source: To export the view to a file, click <guibutton>Export</guibutton> button. Export enables adding ticks for printed charts as shown above and save the image.
fr: Pour exporter la vue vers un fichier, cliquez sur <guibutton>Exporter</guibutton>. L'exportation permet d'ajouter des marques pour des graphiques imprimés comme montré ci-dessus et de enregistrer l'image.
