Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_fitsviewer.po
Languages: fr

source: <acronym>FITS</acronym> Viewer
fr: Afficheur <acronym>FITS</acronym>

source: <primary>FITS Viewer</primary>
fr: <phrase>Afficheur FITS</phrase>

source: FITS, or Flexible Image Transport System, is the standard format for representing images and data in Astronomy. The &kstars; FITS Viewer is a tool to view those images. It is not designed for editing of FITS Images.
fr: FITS (Flexible Image Transport System) est le format standard pour représenter les images et les données en astronomie. L'afficheur FITS de &kstars; permet de visualiser ces images. Il n'est pas conçu pour modifier les images FITS.

source: The FITS Viewer can be automatically invoked for images received from the camera. It can also be invoked directly from the main &kstars; menu. To open a FITS file, select the <menuchoice><guimenu>File</guimenu> <guimenuitem>Open Image...</guimenuitem></menuchoice> menu item, or press <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>.
fr: L'outil d'affichage FITS peut s'utiliser automatiquement pour visualiser les images reçues de l'appareil. Il peut aussi être lancé directement depuis le menu principal de &kstars;. Pour ouvrir un fichier FITS, sélectionnez depuis le menu <menuchoice><guimenu>Fichier</guimenu> <guimenuitem>Ouvrir FITS…</guimenuitem></menuchoice> ou appuyez sur <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>.

source: The FITS Viewer
fr: L'afficheur FITS

source: <phrase>FITS Viewer</phrase>
fr: <phrase>L'afficheur FITS</phrase>

source: The above diagram illustrates the FITS Viewer main work area and window. There is also a hidden area that can be exposed by moving the mouse over the 6 small dots on the left side (about center of the image vertically) and pressing and holding the mouse, sliding it over to the right a bit.
fr: Le diagramme ci-dessus illustre l'endroit principal de travail de l'afficheur FITS ainsi que sa fenêtre. Il existe également un endroit caché qui peut être présenté en déplaçant la souris sur les 6 petits points sur le côté gauche (à peu près au centre de l'image) et en cliquant et gardant le bouton de la souris enfoncé et en la déplaçant un peu vers la droite.

source: The FITS Viewer with sliding panel open
fr: L'afficheur FITS avec le panneau glissant ouvert

source: FITS Viewer with sliding panel open
fr: L'afficheur FITS avec le panneau glissant ouvert

source: Main Controls
fr: Contrôles principaux

source: The various controls and displays for the FITS Viewer are shown below. The tool provides basic functions for image display. While the tool adhere to the FITS standard, it does not support all possible FITS features:
fr: Les différents boutons et affichages pour l'afficheur FITS sont montrés ci-dessous. L'outil fournit les fonctions de base pour l'affichage des images. Bien qu'il respecte les standards FITS, il ne gère pas toutes les fonctionnalités possibles :

source: Support for only <emphasis>one</emphasis> image per file.
fr: Prise en charge pour seulement <emphasis>une</emphasis> image par fichier.

source: Support for only 2D and 3D data. 1D data are discarded.
fr: Prise en charge pour les données 2D et 3D seulement. Les données 1D sont ignorées.

source: The FITS Viewer window is divided into the following regions:
fr: La fenêtre de l'afficheur FITS est divisée en plusieurs partie:

source: Main Menu
fr: Menu principal

source: File
fr: Fichier

source: Standard Open, Save, and Save As.
fr: Actions standards Ouvrir, Enregistrer et Enregistrer sous.

source: FITS Header: Display FITS header table data.
fr: En-tête FITS : affiche les informations d'en-tête FITS.

source: Debayer: Covert RAW image to RGB.
fr: Debayerisation : convertit les images brutes en RGB.

source: Edit
fr: Modifier

source: Undo: Undo last action.
fr: Annuler : annule la dernière action.

source: Redo: Redo last action.
fr: Refaire : refait la dernière action.

source: Copy: Copy image to clipboard.
fr: Copier : copier l'image dans le presse-papier.

source: View
fr: Afficher

source: Zoom Controls: Zoom in, Zoom out, standard Zoom.
fr: Commandes Zoom : zoom avant, zoom arrière, zoom standard.

source: Filters: Auto Stretch, Contrast, High Pass, Rotate, Flip.
fr: Filtres : auto-étirement, contraste, passe haut, rotation, inversion.

source: Mark Stars: Detect and mark stars in the image.
fr: Marquage d'étoiles : détecter et marquer les étoiles dans l'image.

source: Show Clipping: Display in red which stars have pixels that appear to be clipped.
fr: Afficher coupage : affiche en rouge les étoiles dont certains pixels sont coupés.

source: Main Toolbar
fr: Barre principale

source: Open File.
fr: Ouvrir un fichier.

source: Save File: Save FITS data. Any filters applied to the image will be saved.
fr: Enregistrer un fichier : enregistre les données FITS. Tout filtre appliqué à l'image sera enregistré.

source: Save File As.
fr: Enregistrer le fichier sous.

source: Undo last action.
fr: Annule la dernière action.

source: Redo last action.
fr: Refaire la dernière action.

source: Zoom In: Zoom in up to a maximum of 400%. For large images this operation can be very memory intensive. Turn on Limited Resource Mode to save memory.
fr: Zoom avant : zoom avant jusqu'à un maximum de 400 %. Pour des grosses images, cette opération peut prendre beaucoup de mémoire. Activer <quote>Mode de resource limité</quote> pour économiser de la mémoire.

source: Zoom Out.
fr: Zoom arrière.

source: View in Actual Size.
fr: Afficher à la taille actuel.

source: Zoom to fit.
fr: Zoomer pour ajuster.

source: Rotate Right.
fr: Tourner à droite.

source: Rotate Left.
fr: Tourner à gauche.

source: Flip Horizontal.
fr: Inversion horizontale.

source: Flip Vertical.
fr: Inversion verticale.

source: Show Cross Hairs: Toggles crosshairs in the center of the image.
fr: Afficher le réticule : bascule l'affichage du réticule au centre de l'image.

source: Show Pixel Gridlines: Toggles pixel grid.
fr: Afficher le quadrillage des pixels : bascule le quadrillage des pixels.

source: Show Equatorial Gridlines: Toggles Equatorial Grid if FITS contains a valid WCS header.
fr: Afficher la grille équatoriale : bascule la grille équatoriale si le fichier FITS contient une en-tête WCS valable.

source: Show Objects in Image: Identifies objects such as stars, galaxies, and nebulae within the image.
fr: Afficher les objets dans l'image : identifie des objets tels que les étoiles, les galaxies et les nébuleuses dans l'image.

source: Center Telescope: Toggle Center Telescope mode. When active and if the image contains a valid WCS header, clicking anywhere in the image triggers the telescope slewing to the clicked point.
fr: Centrer le télescope : bascule le mode de centrage du télescope. Quand ce mode est activé et que l'image contient une en-tête WCS valable, un clic n'importe où dans l'image déclenche le pivotement du télescope vers le point cliqué.

source: Histogram: Toggle histogram view in the side panel.
fr: Histogramme : bascule l'affichage de l'histogramme dans le panneau latéral.

source: Statistics: Toggle FITS Statistic view in the side panel.
fr: Statistiques : bascule l'affichage des statistiques FITS dans le panneau latéral.

source: Auto Stretch: Apply Auto Stretch filter to the image.
fr: Auto-étirement : applique le filtre d'auto-étirement à l'image.

source: Toggle Selection Rectangle: Toggle selection rectangle for statistics of a region of interest.
fr: Changer de rectangle de sélection : changement du rectangle de sélection pour une région d'intérêt.

source: Side Panel: The side panel can be opened by dragging the separator to the right. When dragged to the left, the side panel can also be closed.
fr: Panneau latéral : le panneau latéral peut être ouvert en tirant le séparateur vers la droite. En le tirant vers la gauche, il sera fermé.

source: Statistics: Displays image statistics including Minimum, Maximum, Average, and Median values.
fr: Statistiques : affiche les statistiques de l'image telles que valeurs minimum, maximum, moyenne et médiane.

source: Plate Solving: A tool plate-solve the loaded image. This is useful to debug plate-solving issues.
fr: Résolution : un outil pour résoudre les images chargés. Cela est utile pour déboguer les problèmes de résolution.

source: Histogram: Displays image histogram with controls to adjust the minimum and maximum values for each channel. Both linear and logarithmic scalings are available to apply to the image. This is somewhat redundant with the below-image histogram and may be removed in the future.
fr: Histogramme : affiche l'histogramme de l'image avec la possibilité d'ajuster les valeurs minimum et maximum pour chaque canal. Les échelles linéaires et logarithmiques sont disponibles pour application à l'image. Toutefois, cela est redondant avec l'histogramme ci-dessous et sera probablement supprimé dans le futur.

source: FITS Header: Displays a table for FITS header keywords, values, and comments.
fr: En-tête FITS : affiche un tableau des en-tête FITS avec les mots-clés, les valeurs et les commentaires.

source: Recent Images: Displays recently opened images. Clicking on any image will load it.
fr: Images récentes : affiche les images récemment ouvertes. Un clic sur n'importe quelle image l'ouvrira.

source: Image Display Area.
fr: Zone d'affichage de l'image.

source: Mouse: Hovering over the image will update the status bar values accordingly.
fr: Souris : le survol de l'image par la souris indiquera les valeurs en conséquence.

source: Mouse: Hovering over the image will move a cursor in the histogram display below the image, if that histogram is activated.
fr: Souris : un survol de l'image déplacera un curseur dans l'histogramme affiché sous l'image, si cette histogramme est activé.

source: Control key: Holding down the control key and then moving the mouse will show a magnified portion of the image.
fr: Touche Contrôle : en maintenant enfoncée la touche Contrôle et ensuite en déplaçant la souris, une portion agrandie de l'image apparaîtra.

source: The Magnifier in the FITS Viewer
fr: La loupe dans l'afficheur FITS

source: The magnifier in the FITS Viewer
fr: La loupe dans l'afficheur FITS

source: Statistics of region of interest
fr: Statistiques d'une région d'intérêt

source: Provides simple statistics average mean, average standard deviation and average median of the selected region by the user in a tooltip.
fr: Fournit des statistiques simples : moyenne, écart-type moyen et médiane moyenne de la région sélectionnée par l'utilisateur dans une infobulle.

source: FITSViewer
fr: Afficheur « FITS »

source: Selection Statistics
fr: Sélectionnez des statistiques

source: The user can either set the selection region by <keycombo>&Shift;<keycap>Left Click</keycap></keycombo> dragging (when the selection statistics is activated) or by choosing an entry from the drop down menu of the Toggle Selection Rectangle button. In addition to this, the user can translate the region by simple <keycap>Left Click</keycap> drag of the mouse. The statistics of the region are shown as a tooltip once the cursor is brought over the selection region. For smaller images, the statistics are updated instantly, and for larger images, the statistics are updated once the user releases the <keycap>Left Click</keycap> button after modification of the region.
fr: L'utilisateur peut soit sélectionner une région en glissant le pointeur après un <keycombo>&Maj;<keycap>Clic gauche</keycap></keycombo> (quand les statistiques sont activées) ou en choisissant une entrée du menu déroulant du bouton de sélection de rectangle. De plus, l'utilisateur peut translater la région d'un simple <keycap>Clic gauche</keycap> de la souris. Les statistiques de la région sont affichées en surimpression lors d'un survol de la région sélectionnée. Les statistiques sont mises à jour instantanément pour les petites images et pour les grandes images, celles-ci sont mises à jour au relâchement du <keycap>Clic gauche</keycap> après modification de la région.

source: Stretching Controls
fr: Boutons d'étirement

source: <screeninfo>The Stretch Controls in the FITS Viewer</screeninfo>
fr: <screeninfo>Boutons d'étirement de l'afficheur FITS</screeninfo>

source: <phrase>The Stretch Controls in the FITS Viewer</phrase>
fr: <phrase>Boutons d'étirement de l'afficheur FITS</phrase>

source: Near the bottom of the window are controls for stretching the image and displaying its histogram. They are described below from left to right.
fr: Près du bas de la fenêtre se trouvent les boutons pour étirer l'image et afficher l'histogramme. Ils sont décrits ci-dessous de gauche à droite.

source: Enable Stretching: On the very left of this display is a button that enables or disables stretching.
fr: Activer l'étirement : le bouton pour activer l'étirement se trouve tout à gauche.

source: Shadow Value: The value below which pixels are displayed as black can be manually entered (scale is 0 to 1.0, even for integer pixel values).
fr: Point noir : la valeur sous laquelle les pixels seront affichés en noir peut être manuellement saisie (l'échelle va de 0 à 1.0, même pour des valeurs entières de pixels).

source: Midtones Value: The midtones value which controls the brightness of the image can be manually entered (scale is 0 to 1.0, even for integer pixel values).
fr: Ton moyen : la valeur du ton moyen qui contrôle la brillance de l'image peut être manuellement saisie (l'échelle va de 0 à 1.0, même pour des valeurs entières de pixels).

source: Highlights Value: The value above which pixels are displayed as white can be manually entered (scale is 0 to 1.0, even for integer pixel values).
fr: Point blanc : la valeur au-dessus de laquelle les pixels seront affichés en blanc peut être manuellement saisie (l'échelle va de 0 à 1.0, même pour des valeurs entières de pixels).

source: Show Histogram: A button that displays or hides the image histogram is to the right of the highlights number box.
fr: Afficher histogramme : le bouton pour afficher/cacher l'histogramme de l'image se trouve à la droite de la boîte affichant le point blanc.

source: Auto Stretch: A button (magic wand icon) that will automatically create a pleasing stretch is found on the right. It is disabled if the stretch is already at the automatically computed value.
fr: Auto-étirement : le bouton (baguette magique) d'auto-étirement se trouve à droite. Il est désactivé si l'étirement est déjà à la valeur calculée.

source: In addition, there are sliders that can be used to adjust the Shadow, Midtones and Highlights values. Adjusting them will change the values displayed.
fr: De plus, il y a des curseurs qui permettent d'ajuster les valeurs de point noir, de ton moyen et de point blanc. Les valeurs modifiées sont affichées.

source: The histogram, if it is enabled, may be zoomed by using the mouse's scroll wheel, and panned by dragging with the mouse. A cursor in the histogram shows the position of the pixel in the image under the mouse.
fr: L'histogramme, si activé, peut être agrandi avec la molette de la souris et déplacé en glissant la souris. Une croix dans l'histogramme affiche la position du pixel de l'image sous le curseur de la souris.

source: Status Bar
fr: Barre d'état

source: <screeninfo>The Status Display in the FITS Viewer</screeninfo>
fr: <screeninfo>L'affichage de l'état dans l'afficheur FITS</screeninfo>

source: <phrase>The Status Display in the FITS Viewer</phrase>
fr: <phrase>L'affichage de l'état dans l'afficheur FITS</phrase>

source: From right to left, the following status indicators are available:
fr: De droite à gauche, les indicateurs d'état suivant sont :

source: Loading Indicator: The LED becomes yellow when an image is getting loaded and turns green after loading is successfully done. If there are problems with loading the image, it turns red.
fr: Indicateur de chargement : la LED devient jaune quand une image est en train d'être chargée et passe au vert quand le chargement s'est terminé avec succès. Si des erreurs ont été rencontrées, elle sera rouge.

source: Resolution: Image resolution in pixels. 4656x3520 in the screenshot above.
fr: Résolution : la résolution de l'image en pixels. 4656x3520 dans la capture d'écran ci-dessus.

source: Zoom Percentage. 13% above.
fr: Pourcentage de zoom. 13 % ci-dessus.

source: Cartesian Coordinates: Displays and updates the current mouse position as you hover over the image. X:769 Y:3508 above.
fr: Coordonnées cartésiennes : affiche et actualise la position courante de la souris en survolant l'image. X:769 Y:3508 ci-dessus.

source: Pixel Value: Value of the pixel under the mouse. 1,792 above.
fr: Valeur du pixel : valeur du pixel sous la souris. 1792 ci-dessus.

source: Equatorial Coordinates: If the image contains a valid WCS header, the J2000 Right Ascension (RA) and declination (DE) values are displayed. 13h 14' 22" 42 37' 35" above.
fr: Coordonnées équatoriales : si l'image contient une en-tête WCS valable, l'ascension droite J2000 (AD) et la déclinaison (Déc) sont affichées. 13h 14' 22" 42 37' 35" ci-dessus.

source: Image Stats: Displays the HFR, Eccentricity and number of stars if computed. HFR:1.96 Ecc:0.43 143 stars above.
fr: Statistiques de l'image : affiche le HFR, l'excentricité et le nombre d'étoiles si calculées. HFR : 1.96 Ecc : 0.43 143 étoiles ci-dessus.

source: Clipped Stars: If Show Clipping is activated in the main toolbar, it displays the number of possibly clipped pixels. Clip:403 above.
fr: Étoiles coupées : si l'option Afficher coupage est activée dans la barre d'outils principale, le nombre de pixels possiblement coupés est affiché. Clip : 403 ci-dessus.

source: In addition to image display, the viewer can process World-Coordinate-System (WCS) header if present within the FITS file and provides useful information regarding the objects found within the image, equatorial grid overlay, popup menu, and the ability to slew the mount (if connected) to any point within the image.
fr: Outre l'affichage de l'image, l'afficheur peut traiter l'éventuelle en-tête WCS (World Coordinate System) qui fournit des informations précieuses concernant les objets présents dans l'image, la superposition de la grille équatoriales, un menu contextuel et la possibilité de pivoter le télescope vers n'importe quel point de l'image.

source: Several filters can be applied to enhance the image include auto stretch and high contrast. Depending on the image size, these operations can take a few seconds to complete. The bottom status bar displays the current pixel value and current X &amp; Y coordinates of the mouse pointer within the image. Furthermore, it includes the current zoom level and the image resolution.
fr: Plusieurs filtres peuvent être appliqués pour améliorer l'image en incluant l'auto-étirement et le haut contraste. Ces opérations peuvent prendre quelques secondes selon la taille de l'image. La barre d'état du bas affiche la valeur du pixel survolé ainsi que les coordonnées X et Y. Enfin, elle inclut le niveau de zoom actuel et la résolution de l'image.

source: When loading a bayered image, the viewer can automatically debayer the image if <emphasis>Auto Debayer</emphasis> is checked in the FITS Settings. The debayering operation fetches the bayer pattern (&eg; RGGB) from the FITS header. If none exists, you can alter the debayering algorithm and pattern from the <guimenu>File</guimenu> menu or by using the <keycombo>&Ctrl; <keycap>D</keycap></keycombo> shortcut.
fr: Quand une image bayerisé est chargée, l'afficheur peur automatiquement la débayériser si le réglage FITS <quote>Auto débayerisation</quote> est coché. Cette opération lit le motif de Bayer (c'est-à-dire RGGB) dans l'en-tête FITS. Si aucun n'est trouvé, vous pouvez modifier l'algorithme et le motif dans le menu <guimenu>Fichier</guimenu> ou avec le raccourci <keycombo>&Ctrl; <keycap>D</keycap></keycombo>.

source: Since operations such as auto debayering and auto WCS are computationally expensive and stress the processor on low-powered embedded devices, you can toggle their behavior in <link linkend="fits-configure">&kstars; Settings FITS page</link>.
fr: Comme les opérations d'auto-débayérisation et d'auto WCS sont très gourmandes en puissance de calculs, vous pouvez désactiver ce comportement dans la <link linkend="fits-configure">page FITS des réglages de &kstars;</link>.

source: <screeninfo>FITS Settings</screeninfo>
fr: <screeninfo>Réglages FITS</screeninfo>

source: <phrase>FITS Settings</phrase>
fr: <phrase>Réglages FITS</phrase>

source: Hovering over any option shall display a detailed tooltip that explains its function.
fr: Le survol d'une option affichera une infobulle détaillée expliquant sa fonction.

source: Features
fr: Fonctionnalités

source: <term>Histogram</term>
fr: <term>Histogramme</term>

source: <screeninfo>Histogram</screeninfo>
fr: <screeninfo>Histogramme</screeninfo>

source: <phrase>Histogram</phrase>
fr: <phrase>Histogramme</phrase>

source: Displays multi-channel FITS histogram. The user can rescale the image by optionally defining an upper and lower limit for the cutoff region. The rescaling operation (linear, logarithmic, or square-root) may then be applied to the region enclosed by the upper and lower limits.
fr: Affiche un histogramme FITS à plusieurs canaux. L'utilisateur peut changer l'échelle de l'image en définissant facultativement une limite supérieure et inférieure pour la région coupée. L'opération de changement de l'échelle (linéaire, logarithmique ou racine carrée) peut ensuite être appliquée à la région entourée par les limites supérieure et inférieure.

source: FITS Header
fr: En-tête FITS

source: Displays a read-only table listing FITS header keywords and values.
fr: Affiche les valeurs et les mots-clés FITS dans une table en lecture seule.

source: Statistics
fr: Statistiques

source: Provides simple statistics for minimum and maximum pixel values and their respective locations. FITS depth, dimension, mean, and standard deviation.
fr: Fournit des statistiques simples pour les valeurs minimales et maximales de pixel et leurs emplacements respectifs. La profondeur, la dimension, la moyenne et l'écart-type FITS.

source: <title>FITS Viewer Solver</title>
fr: <title>Résolveur de l'afficheur FITS</title>

source: <screeninfo>FITS Viewer Solver</screeninfo>
fr: <screeninfo>Résolveur de l'afficheur FITS</screeninfo>

source: <phrase>FITS Viewer Solver</phrase>
fr: <phrase>Résolveur de l'afficheur FITS</phrase>

source: The FITS Viewer Solver is used to plate-solve the image loaded in the FITS Viewer's tab. It only works with the internal StellarSolver. You get the RA and DEC coordinates for the center of the image, the image's scale, the angle of rotation, and the number of stars detected in the image. Its main use case is debugging plate-solving issues in Ekos, though the information displayed can be generally useful. The controls and displays are described below.
fr: Le résolveur de l'afficheur FITS est utilisé pour résoudre l'image chargée dans l'onglet de l'afficheur FITS. Cela ne fonctionne qu'avec StellarSolver. Vous obtenez les coordonnées en AD et DEC du centre de l'image, son échelle, l'angle de rotation et le nombre d'étoiles détectées. Son utilisation principale est le débogage de problème dans Ekos, bien que l'information affichée peut être utile. Les boutons et affichage sont décrits ci-dessous.

source: Solve Button. Pressing this button starts plate solving. When the system is plate solving, the button becomes an abort button.
fr: Bouton Résoudre. Appuyer sur ce bouton déclenche la résolution. En cours de résolution, ce bouton devient un bouton Interrompre.
