Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_commands.po
Languages: fr

source: <guimenuitem>Add to Observing WishList</guimenuitem>: Add the selected object to <guimenu>Observation Planner</guimenu>'s Wish List. You can see the Wish List, by selecting the <menuchoice><guimenu>Observation</guimenu> <guimenuitem>Observation Planner</guimenuitem></menuchoice> menu item. If the object is already in the Observing WishList, then this item will become <guilabel>Remove Label</guilabel>.
fr: <guimenuitem>Ajouter à la liste de souhaits</guimenuitem> : ajouter l'objet sélectionné au <guimenu>planificateur d'observation</guimenu>. Vous pouvez voir la liste de souhaits dans le menu <menuchoice><guimenu>Observations</guimenu> <guimenuitem>Planificateur d'observation</guimenuitem></menuchoice>. Si cet objet est déjà dans la liste de souhaits, alors cet élément deviendra <guilabel>Supprimer étiquette</guilabel>.

source: [Solar system objects]
fr: [Objets du système solaire]

source: <guimenuitem>Add Trail</guimenuitem>: Add a trail to current Solar system object. A star trail is the continuous path created by the star in the night sky due to the rotation of the Earth. If the object already has a trail, this item will become <guilabel>Remove Trail</guilabel>.
fr: <guimenuitem>Ajouter une trace</guimenuitem> : ajoute une trace à l'objet courant du système solaire. Une trace d'étoile est le chemin continu créé par l'étoile dans le ciel de la nuit dû à la rotation de la Terre. Si un objet a déjà une trace, cet élément deviendra <guilabel>Supprimer Trace</guilabel>.

source: <guimenuitem>Simulate eyepiece view</guimenuitem>: Eyepiece View feature renders the view through the eyepiece of various telescope types. Firstly, an input dialog is shown, which asks you to select one of the visible FOVs to use as a FOV for the eyepiece view. The user also has the option of trying to determine it from the image (accurate if image has metadata, otherwise it will be random). After you set the FOV, the "Eyepiece Field View" window will pop up. You can easily rotate the view using the "Rotation" slider. You can also flip and invert the view to help match the view through a telescope/camera. "Eyepiece view" tool can help you locate many objects with ease, instead of trying to work with relative positions and relative orientations. This is an important advantage, especially when you are star hopping. Note that for getting best results, time must be synced with current time in &kstars;, and &kstars; must be in horizontal coordinates mode.
fr: <guimenuitem>Simuler un affichage à l'oculaire</guimenuitem> : cette fonctionnalité présente une vue à travers un oculaire de différents types de télescope. Une première fenêtre de dialogue vous demande de choisir un champ de vue à utiliser comme oculaire. L'utilisateur a l'option de le déterminer à partir de l'image (précis si l'image possède des métadonnées, sinon ce sera aléatoire). Après avoir choisi ce champ de vue, la fenêtre <quote>Affichage du champ de vue de l'oculaire</quote> apparaîtra. Vous pouvez facilement faire une rotation de l'affichage en utilisant le curseur <quote>Rotation</quote>. Vous pouvez également retourner et inverser l'affichage afin de le faire correspondre à l'affichage du télescope ou de la caméra. L'outil <quote>Affichage oculaire</quote> vous aide grandement à localiser les objets, plutôt que de travailler avec des positions et des orientations relatives. Cela est d'un grand avantage surtout quand vous faites du saute-mouton astronomique. Veuillez noter que pour obtenir les meilleurs résultats, l'heure doit être synchronisée avec l'heure courante de &kstars; et &kstars; doit se trouver dans le mode de coordonnées horizontales.

source: <guimenuitem>Image Resources</guimenuitem>: gives a list of image links for current Solar system object. The images are displayed in &kstars; Image Viewer tool. Image Viewer tool allows you to invert the colors and save the image in your computer.
fr: <guimenuitem>Ressources de l'image</guimenuitem> : donne une liste de liens d'image pour l'objet courant du système solaire. Les images sont affichées dans l'outil d'affichage d'images de &kstars;. Cet outil vous permet d'inverser les couleurs et d'enregistrer les images sur votre ordinateur.

source: <guimenuitem>Information Resources</guimenuitem>: gives a list of documentation links for current Solar system object. The links are opened in your default browser.
fr: <guimenuitem>Ressources Informations</guimenuitem> : donne une liste de liens d'informations pour l'objet courant du système solaire. Les liens sont ouverts dans votre navigateur par défaut.

source: [All objects without Solar system objects]
fr: [Tous les objets sauf ceux du système solaire]

source: <guimenuitem>Show SDSS Image</guimenuitem>: download a SDSS (Sloan Digital Sky Survey) image of the object from the Internet, and display it in the Image Viewer tool.
fr: <guimenuitem>Affiche Image SDSS</guimenuitem> : télécharge à partir de l'Internet une image SDSS (Sloan Digital Sky Survey) de l'objet et l'affiche dans l'outil d'afficheur d'images.

source: <guimenuitem>Show DSS Image</guimenuitem>: download a DSS (Digitized Sky Survey) image of the object from the Internet, and display it in the Image Viewer tool.
fr: <guimenuitem>Affiche Image DSS</guimenuitem> : télécharge à partir de l'Internet une image DSS (Digitized Sky Survey) de l'objet et l'affiche dans l'outil d'afficheur d'images.

source: Keyboard Commands
fr: Commandes à partir du clavier

source: Keyboard
fr: Clavier

source: Navigation Keys
fr: Touches de navigation

source: Navigation Controls
fr: Contrôles de navigation

source: Arrow Keys
fr: Les touche fléchées

source: Use the arrow keys to pan the display. Holding down the &Shift; key doubles the scrolling speed.
fr: Les flèches de votre clavier servent à déplacer l'écran. L'écran se déplacera plus rapidement si vous maintenez la touche &Maj; enfoncée en même temps.

source: <keycap>+</keycap> / <keycap>-</keycap>
fr: <keycap>+</keycap> et <keycap>-</keycap>

source: Zoom In/Out.
fr: Zoom avant et zoom arrière

source: &Ctrl;&Shift;<keycap>Z</keycap>
fr: &Ctrl;&Maj;<keycap>Z</keycap>

source: Center Display on a major Solar System body:
fr: Centre l'image sur un objet majeur du système solaire :

source: <keycap>0</keycap>: Sun
fr: <keycap>0</keycap> : Soleil

source: <keycap>1</keycap>: Mercury
fr: <keycap>1</keycap> : Mercure

source: <keycap>3</keycap>: Moon
fr: <keycap>3</keycap> : Lune

source: <keycap>6</keycap>: Saturn
fr: <keycap>6</keycap> : Saturne

source: <keycap>9</keycap>: Pluto
fr: <keycap>9</keycap> : Pluton

source: Center the display at the <link linkend="ai-zenith">Zenith</link> Point (straight up).
fr: Centre l'affichage au <link linkend="ai-zenith">Zénith</link> (juste à la verticale)

source: Toggle tracking mode.
fr: (Dés)active le mode de suivi.

source: Advance the simulation clock backwards by one time step.
fr: Recule l'horloge de simulation d'un pas de temps.

source: Advance the simulation clock forwards by one time step.
fr: Avance l'horloge de simulation d'un pas de temps.

source: Menu Shortcuts
fr: Raccourcis des menus

source: Keyboard Shortcuts
fr: Raccourcis clavier

source: Download extra data.
fr: Télécharge des données supplémentaires.

source: Open a FITS image in the FITS Editor.
fr: Ouvre une image FITS dans l'éditeur FITS.

source: Export sky image to a file.
fr: Exporte une image du ciel dans un fichier.

source: Run a &kstars; <link linkend="tool-obsplanner">Observation Planner</link>.
fr: Exécute l'outil de <link linkend="tool-obsplanner">planificateur d'observations</link>.

source: Run a &kstars; &DBus; script.
fr: Exécute un script &DBus; de &kstars;.

source: Print the current sky map.
fr: Imprime la carte actuelle du ciel.

source: Sync the simulation clock with the current system time.
fr: Synchronise l'horloge de simulation avec l'heure courante du système.

source: Set the simulation clock to a specified Time and Date.
fr: Règle l'horloge de simulation sur une date et heure spécifiée.

source: &Ctrl;&Shift;<keycap>F</keycap>
fr: &Ctrl;&Maj;<keycap>F</keycap>

source: Define equipment (telescope, eyepiece, lens and filter) characteristics for observation logs.
fr: Définit les caractéristiques des équipement (télescope, oculaire, objectif et filtre) pour les fichiers journaux des observations.

source: Add a new observer item for your observation logs.
fr: Ajoute un nouvel élément d'observateur pour vos fichiers journaux d'observations.

source: &Space;
fr: <keysym>Espace</keysym>

source: Open the &kstars; Handbook.
fr: Ouvre le manuel de &kstars;.

source: Actions for the Selected Object
fr: Actions pour l'objet sélectionné

source: Objects in the Sky
fr: Objets dans le ciel

source: Keyboard Actions
fr: Commandes à partir du clavier

source: Each of the following keystrokes performs an action on the <firstterm>selected object</firstterm>. The selected object is the last object which was clicked on (identified in the status bar). Alternatively, if you hold down the &Shift; key, then the action is performed on the centered object instead.
fr: Chacune des actions sur le clavier effectue une action sur l'<firstterm>objet sélectionné</firstterm>. L'objet sélectionné est le dernier objet sur lequel on a cliqué (identifié dans la barre d'état). Autrement, si vous maintenez enfoncée la touche &Maj;, l'action sera effectuée sur l'objet centré.

source: Center and Track on the selected object.
fr: Centre et suit l'objet sélectionné.

source: Open the Details window for the selected object.
fr: Ouvre la fenêtre des détails pour l'objet sélectionné.

source: Toggle a name label for the selected object.
fr: (Dés)active l'étiquette pour l'objet sélectionné.

source: Add the selected object to the observing list.
fr: Ajoute l'objet sélectionné à la liste d'observations.

source: Open the selected object's popup menu.
fr: Ouvre le menu contextuel pour l'objet sélectionné.

source: Toggle a trail on the selected object (solar system bodies only).
fr: (Dés)active une trace sur l'objet sélectionné (objets du système solaire seulement).

source: Tools Shortcuts
fr: Raccourcis des outils

source: Open the <link linkend="findobjects">Find Object window</link>, for specifying a sky object on which to center.
fr: Ouvre la <link linkend="findobjects">fenêtre de recherche d'objet</link> pour spécifier un objet du ciel sur lequel centrer.

source: Open the <guilabel>Set Coordinates Manually</guilabel> tool, for specifying RA/Dec or Az/Alt coordinates on which to center. The tool defaults to <link linkend="ai-epoch">J2000 epoch</link> for the RA/Dec.
fr: Ouvre l'outil <guilabel>Définir les coordonnées manuellement</guilabel> pour spécifier les coordonnées « AD / DEC » ou « Az / Alt » sur lesquelles centrer. L'outil applique par défaut une <link linkend="ai-epoch">époque « J2000 »</link> pour « AD / DEC ».

source: Start an Angular Distance measurement at the current mouse cursor position. The angular distance between start and end points is displayed at the endpoint.
fr: Commence une mesure de distance angulaire à la position actuelle du pointeur de la souris. La distance angulaire entre les points de départ et d'arrivée est affichée au point d'arrivée.

source: Open the <link linkend="setgeo">Set Geographic Location</link> window.
fr: Ouvre la fenêtre de <link linkend="setgeo">position géographique</link>.

source: Open the <link linkend="tool-calculator">AstroCalculator</link>.
fr: Ouvre la <link linkend="tool-calculator">Calculatrice astronomique</link>.

source: Open the <link linkend="tool-altvstime">Altitude vs. Time</link> tool.
fr: Ouvre l'outil <link linkend="tool-altvstime">Élévation selon l'heure</link>.

source: Open the <link linkend="tool-whatsup">What's up Tonight?</link> tool.
fr: Ouvre l'outil <link linkend="tool-whatsup">Dans le ciel cette nuit</link>.

source: Open the <quote>What's Interesting</quote> tool.
fr: Ouvrir l'outil <quote>Digne d'intérêt</quote>.

source: Open the <link linkend="tool-scriptbuilder">Script Builder</link> tool.
fr: Ouvre l'outil <link linkend="tool-scriptbuilder">Constructeur de scripts</link>.

source: Open the <link linkend="tool-solarsys">Solar System Viewer</link>.
fr: Ouvre l'<link linkend="tool-solarsys">Afficheur du système solaire</link>.

source: Open the <link linkend="tool-jmoons">Jupiter Moons</link> tool.
fr: Ouvre l'outil <link linkend="tool-jmoons">des lunes de Jupiter</link>.

source: Mouse Commands
fr: Commandes à partir de la souris

source: Mouse
fr: Souris

source: Moving the mouse
fr: Déplacements de la souris

source: The sky coordinates (Az/Alt, RA/Dec and J2000.0 RA/Dec) of the mouse cursor are updated in the status bar. The status bar is located in the right bottom corner of the screen. The status bar can be customized by selecting <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Statusbar</guimenuitem></menuchoice> submenu. Here you may choose what coordinates systems &kstars; will display in the status bar. Furthermore, you can hide the status bar by unchecking the <guilabel>Show Statusbar</guilabel> checkbox.
fr: Les coordonnées du ciel (Az/Alt, AD/DEC et J2000.0 AD/DEC) sous le pointeur de la souris sont mises à jour dans la barre d'état dans le coin du bas à droite de l'écran. La barre d'état peut être personnalisée dans le sous-menu <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Barre d'état</guimenuitem></menuchoice>. Vous pourrez ainsi choisir le système de coordonnées que &kstars; affichera dans la barre d'état. De plus, vous pouvez la cacher en décochant <guilabel>Afficher la barre d'état</guilabel>.

source: "Hovering" the mouse
fr: Survol de la souris

source: A temporary name label is attached to the object nearest to the mouse cursor.
fr: Une étiquette temporaire est attachée à l'objet le plus proche du pointeur de la souris.

source: Left-clicking
fr: Clic gauche

source: Identifying
fr: Identification

source: The object nearest the mouse click is identified in the status bar.
fr: L'objet le plus proche du clic de la souris est identifié dans la barre d'état.

source: Double-clicking
fr: Double clic

source: Centering
fr: Centrage

source: Center and track on the location or object nearest the mouse click. Double-clicking on an Info Box will <quote>shade</quote> it to show/hide extra information.
fr: Centre et suit la position ou l'objet le plus proche du clic de la souris. Un double clic sur une zone d'information l'<quote>enroulera</quote> pour révéler ou cacher des informations supplémentaires.

source: Right-clicking
fr: Clic droit

source: Invoking Popup Menu for
fr: Invocation du menu contextuel pour

source: Open the <link linkend="popup-menu">popup menu</link> for the location or object nearest the mouse cursor.
fr: Ouvre le <link linkend="popup-menu">menu contextuel</link> de la position ou de l'objet le plus proche du pointeur de la souris.

source: Scrolling the mouse wheel
fr: Actions sur la molette de la souris

source: Zoom the display in or out. If you do not have a mouse <mousebutton>wheel</mousebutton>, you can hold the middle mouse button and drag vertically.
fr: Zoom l'affichage vers l'avant ou l'arrière. Si vous n'avez pas de souris <mousebutton>à molette</mousebutton>, vous pouvez maintenir le bouton central de la souris et la déplacer verticalement.

source: Click-and-dragging
fr: Cliquer et déplacer

source: Dragging the sky map
fr: Tirer la carte du ciel

source: Pan the display, following the drag motion.
fr: Déplace l'affichage, en suivant le mouvement du tirage.

source: &Ctrl;+dragging the sky map
fr: &Ctrl; + tirer la carte du ciel

source: Define a rectangle in the map. When the mouse button is released, the display is zoomed in to match the field-of-view to the bounds of the rectangle.
fr: Définit un rectangle dans la carte. Lorsque le bouton de la souris est relâché, l'affichage est agrandi pour correspondre au champ d'affichage inclus dans le rectangle.

source: Dragging an Info Box
fr: Tirer une boîte d'informations

source: The Info Box is repositioned in the map. Info Boxes will <quote>stick</quote> to window edges, so that they remain on the edge when the window is resized.
fr: La boîte d'informations est repositionnée sur la carte. Les boîtes d'information seront <quote>collées</quote> aux bords de la fenêtre, de telle manière qu'elles restent sur le bord lorsque la fenêtre est redimensionnée.
