Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_darkmatter.po
Languages: fr

source: <title>Dark Matter</title>
fr: <title>Matière sombre</title>

source: <primary>Dark Matter</primary>
fr: <primary>Matière sombre</primary>

source: Scientists are now quite comfortable with the idea that 90% of the mass in the universe is in a form of matter that cannot be seen.
fr: Les scientifiques sont maintenant convaincus que 90 % de la masse de l'univers est une forme de matière qui ne peut être vue.

source: Despite comprehensive maps of the nearby universe that cover the spectrum from radio to gamma rays, we are only able to account of 10% of the mass that must be out there. As Bruce H. Margon, an astronomer at the University of Washington, told the New York Times in 2001: <quote>It's a fairly embarrassing situation to admit that we can't find 90 percent of the universe.</quote>
fr: En dépit de cartes exhaustives de l'univers voisin qui couvrent le spectre depuis les ondes radio jusqu'aux rayons gamma, nous ne pouvons comptabiliser que 10 % de la masse qui doit s'y trouver. Comme Bruce H. Margon, un astronome de l'université de Washington, l'a dit au New York Times en 2001 : <quote>Il est très embarrassant d'admettre que nous ne pouvons trouver 90 % de l'univers</quote>.

source: The term given this <quote>missing mass</quote> is <firstterm>Dark Matter</firstterm>, and those two words pretty well sum up everything we know about it at this point. We know there is <quote>Matter</quote>, because we can see the effects of its gravitational influence. However, the matter emits no detectable electromagnetic radiation at all, hence it is <quote>Dark</quote>. There exist several theories to account for the missing mass ranging from exotic subatomic particles, to a population of isolated black holes, to less exotic brown and white dwarfs. The term <quote>missing mass</quote> might be misleading, since the mass itself is not missing, just its light. But what is exactly dark matter and how do we really know it exists, if we cannot see it?
fr: Le terme donné à cette <quote>masse manquante</quote> est <firstterm>matière sombre</firstterm>, et ces deux mots résument plutôt bien nos connaissances actuelles à ce sujet. Nous savons qu'il y a de la <quote>matière</quote>, car nous pouvons voir les effets de son influence gravitationnelle. Cependant la matière n'émet pas de radiation électromagnétique du tout, donc elle est <quote>sombre</quote>. Il existe plusieurs théories pour comptabiliser la masse manquante, allant des particules subatomiques à une population de trous noirs isolés, à des moins exotiques naines blanches et brunes. Le terme <quote>masse manquante</quote> pourrait tromper, car ce n'est pas la masse elle-même qui manque mais seulement la lumière. Mais de quoi est composée cette matière sombre et comment savons-nous vraiment qu'elle existe, si nous ne pouvons pas la voir ?

source: The story began in 1933 when Astronomer Fritz Zwicky was studying the motions of distant and massive clusters of galaxies, specifically the Coma cluster and the Virgo cluster. Zwicky estimated the mass of each galaxy in the cluster based on their luminosity, and added up all of the galaxy masses to get a total cluster mass. He then made a second, independent estimate of the cluster mass, based on measuring the spread in velocities of the individual galaxies in the cluster. To his surprise, this second <firstterm>dynamical mass</firstterm> estimate was <emphasis>400 times</emphasis> larger than the estimate based on the galaxy light.
fr: L'histoire commença en 1933, quand l'astronome suisse Fritz Zwicky étudia les mouvements d'amas de galaxies lointains et massifs, spécialement l'amas de la Chevelure et l'amas de la Vierge. Zwicky a estimé la masse de chaque galaxie dans l'amas selon leur luminosité et en a calculé la somme pour obtenir la masse totale de l'amas. Il a fait ensuite une seconde estimation indépendante de la masse de l'amas, en fonction de la mesure de l'étalement des vitesses des galaxies individuelles dans l'amas. À sa surprise, cette deuxième <firstterm>masse dynamique</firstterm> estimée était <emphasis>400 fois</emphasis> plus importante que la masse estimée à partir de la luminosité des galaxies.

source: Although the evidence was strong at Zwicky's time, it was not until the 1970s that scientists began to explore this discrepancy comprehensively. It was at this time that the existence of Dark Matter began to be taken seriously. The existence of such matter would not only resolve the mass deficit in galaxy clusters; it would also have far more reaching consequences for the evolution and fate of the universe itself.
fr: Bien que la preuve fut solide à l'époque de Zwicky, ce n'est que dans les années 1970 que les scientifiques commencèrent à explorer cette différence. C'est à cette époque que l'existence de la matière sombre fut considérée sérieusement. L'existence d'une telle matière ne résoudrait pas seulement le déficit de masse dans les amas de galaxies, il aurait aussi d'autres conséquences pour l'évolution et le destin de l'Univers lui-même.

source: Another phenomenon that suggested the need for dark matter is the rotational curves of <firstterm>Spiral Galaxies</firstterm>. Spiral Galaxies contain a large population of stars that orbit the Galactic center on nearly circular orbits, much like planets orbit a star. Like planetary orbits, stars with larger galactic orbits are expected to have slower orbital speeds (this is just a statement of Kepler's 3rd Law). Actually, Kepler's 3rd Law only applies to stars near the perimeter of a Spiral Galaxy, because it assumes the mass enclosed by the orbit to be constant.
fr: Un autre phénomène qui suggère le besoin de matière sombre est la courbe rotationnelle des <firstterm>galaxies spirales</firstterm>. Les galaxies spirales contiennent une grande population d'étoiles qui orbitent autour du centre galactique, sur des orbites presque circulaires, presque comme les orbites des planètes d'une étoile. Comme les orbites des planètes, les étoiles avec des orbites plus grandes sont supposées avoir des vitesses orbitales plus lentes (c'est juste une application de la 3<superscript>ème</superscript> loi de Kepler). En fait, cette loi de Kepler ne s'applique qu'aux étoiles proches du périmètre d'une galaxie spirale, car elle suppose que la masse interne à l'orbite soit constante.

source: However, astronomers have made observations of the orbital speeds of stars in the outer parts of a large number of spiral galaxies, and none of them follow Kepler's 3rd Law as expected. Instead of falling off at larger radii, the orbital speeds remain remarkably constant. The implication is that the mass enclosed by larger-radius orbits increases, even for stars that are apparently near the edge of the galaxy. While they are near the edge of the luminous part of the galaxy, the galaxy has a mass profile that apparently continues well beyond the regions occupied by stars.
fr: Cependant, les astronomes ont fait des observations des vitesses orbitales des étoiles dans le pourtour d'un grand nombre de galaxies spirales, et aucune d'entre elles n'obéissait à la troisième loi de Kepler conformément aux attentes. Au lieu de diminuer aux grands rayons, les vitesses orbitales restaient remarquablement constantes. L'implication est que la masse encerclée par les grandes orbites augmente, même pour les étoiles qui sont apparemment proches du bord de la galaxie. Pendant qu'elles sont proches du bord de la partie lumineuse de la galaxie, la galaxie a un profil de masse qui continue apparemment bien au-delà des régions occupées par les étoiles.

source: Here is another way to think about it: Consider the stars near the perimeter of a spiral galaxy, with typical observed orbital velocities of 200 kilometers per second. If the galaxy consisted of only the matter that we can see, these stars would very quickly fly off from the galaxy, because their orbital speeds are four times larger than the galaxy's escape velocity. Since galaxies are not seen to be spinning apart, there must be mass in the galaxy that we are not accounting for when we add up all the parts we can see.
fr: Voici une autre manière d'aborder la question. Considérez que les étoiles proches de la périphérie d'une galaxie spirale, avec des vitesses orbitales typiquement observées de 200 kilomètres par seconde. Si la galaxie ne consistait qu'en matière que nous pouvons voir, ces étoiles seraient rapidement éjectées de la galaxie, car leur vitesse orbitale est quatre fois plus grande que la vitesse de libération de la galaxie. Comme les galaxies ne sont pas vues tournant à part, il doit y avoir une masse dans la galaxie que nous ne comptabilisons pas quand nous ajoutons les parties que nous pouvons voir.

source: Several theories have surfaced in literature to account for the missing mass such as <acronym>WIMP</acronym>s (Weakly Interacting Massive Particles), <acronym>MACHO</acronym>s (MAssive Compact Halo Objects), primordial black holes, massive neutrinos, and others; each with their pros and cons. No single theory has yet been accepted by the astronomical community, because we so far lack the means to conclusively test one theory against the other.
fr: Plusieurs théories ont émergé dans la littérature pour comptabiliser la masse manquante, telles que <acronym>WIMP</acronym> (acronyme anglais pour <quote>particules massives interagissant faiblement</quote>), <acronym>MACHO</acronym>s (acronyme anglais pour <quote>objets hypothétiques compacts et sombres</quote>), les trous noirs primordiaux, les neutrinos massifs et autres, chacune avec ses pour et ses contre. Aucune théorie seule n'a encore été acceptée par la communauté astronomique, car nous manquons jusqu'à maintenant de moyens pour tester valablement une théorie contre une autre.

source: You can see the galaxy clusters that Professor Zwicky studied to discover Dark Matter. Use the &kstars; <guilabel>Find Object</guilabel> window (<keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>) to center on <quote>M 87</quote> to find the Virgo Cluster, and on <quote>NGC 4884</quote> to find the Coma Cluster. You may have to zoom in to see the galaxies. Note that the Virgo Cluster appears to be much larger on the sky. In reality, Coma is the larger cluster; it only appears smaller because it is further away.
fr: Vous pouvez voir les amas de galaxies que le professeur Zwicky a étudiés pour découvrir la matière sombre. Utilisez la fenêtre de &kstars; <guilabel>Trouvez un objet</guilabel> (<keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>) pour centrer sur <quote>M 87</quote> pour trouver l'amas de la Vierge et sur <quote>NGC 4884</quote> pour trouver l'amas de la Chevelure. Vous pouvez avoir à zoomer pour voir les galaxies. Notez que l'amas de la Vierge apparaît être bien plus grand dans le ciel. En réalité, la Chevelure est plus grande. Elle n'apparaît plus petite que parce qu'elle est plus loin.
