Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: The <guibutton>Toggle Full Screen</guibutton> button pops the window displaying the focus frame out to a separate window. Pressing it again returns it within the focus window.
fr: Le bouton <guibutton>Mode plein écran</guibutton> ouvre une fenêtre séparée affichant l'image de mise au point. Un nouveau clic bascule vers l'affichage intégré.

source: The <guibutton>Show in FITS Viewer</guibutton> button pops-up a separate FITS Viewer window to display the focus frame, in addition to the focus frame displayed within the focus window.
fr: Le bouton <guibutton>Afficher dans l'afficheur FITS</guibutton> ouvre une fenêtre séparée de l'afficheur FITS pour l'affichage de l'image de mise au point, en plus de celle affichée dans la fenêtre de mise au point.

source: The <guibutton>Live Video</guibutton> button brings up the associated popup.
fr: Le bouton <guibutton>Vidéo en direct</guibutton> ouvre la fenêtre associée.

source: The next row of controls allows Camera parameters to be set. Choose a value from the binning dropdown and then set either the camera gain or ISO.
fr: La ligne suivante de réglages permet de régler les paramètres de la caméra. Choisissez une valeur pour le groupement de pixels (binning) puis réglez le gain de la caméra ou son ISO.

source: <guilabel>Binning</guilabel>: Increasing the binning will change the image scale as well as resulting in brighter pixels. It is generally only worth binning above 1x1 if your image scale is oversampled where the increase in image scale does not lead to a loss of resolution. If you wish to increase star brightness try increasing the exposure and / or gain. If you are unsure bin 1x1.
fr: <guilabel>Groupement de pixels</guilabel> : l'augmentation du groupement de pixels modifie l'échelle de l'image et permet d'obtenir des pixels plus clairs. Il n'est en général utile de grouper plus que 1x1 que si l'échelle de l'image est sur-échantillonnée et qu'une augmentation ne conduit pas à une perte de résolution.

source: <guilabel>Gain</guilabel>: Set the Gain for the Camera being used to focus. The value needs to be high enough to give a clear star pattern but not so high as to create too much noise to interfere with the focus operation. Some experimentation will be required to find an optimum value. If you are unsure where to start try unity gain for your camera and adjust from there.
fr: <guilabel>Gain</guilabel> : régler le gain de la caméra utilisée pour la mise au point. Cette valeur doit être assez grande pour donner un motif d'étoile clair mais pas trop grande pour éviter que le bruit ajouté interfère avec l'opération de mise au point. Il sera nécessaire de tester plusieurs valeurs pour trouver la valeur optimale. Si vous ne savez pas où commencer, réglez le gain à un et ajuster depuis là.

source: <guilabel>ISO</guilabel>: Set the ISO for the Camera being used to focus. Some experimentation will be required to find an optimum value.
fr: <guilabel>ISO</guilabel> : règle l'ISO de la caméra utilisée pour la mise au point. Un peu de tâtonnement sera nécessaire pour trouver la valeur optimale.

source: The third row of controls deals with the Temperature Source and Filter, if there is one:
fr: La troisième ligne de boutons de contrôle gère la source de température et les filtres :

source: <guilabel>TS</guilabel>: Select the temperature source from the dropdown. Underneath are displayed the current temperature from the selected temperature source and the change in temperature between when the last successful Autofocus run completed and the current temperature. It is common practice to redo focus after significant temperature changes that alter the telescope's focus point.
fr: <guilabel>TS</guilabel> : choisissez la source de température depuis la liste déroulante. La température actuelle est affichée juste en dessous ainsi que la variation de température depuis la dernière mise au point automatique. C'est une pratique courante de relancer une mise au point quand la température varie significativement puisque cela altère la position de mise au point du télescope.

source: <guilabel>Filter</guilabel>: Select the filter to use.
fr: <guilabel>Filtre</guilabel> : choix du filtre à utiliser

source: To start focusing it will probably be easier to select the filter that allows the most light through, for example the Lum filter. Click the filter icon <inlinemediaobject><imageobject><imagedata fileref="view-filter.png" format="PNG"/></imageobject></inlinemediaobject> to launch the <link linkend="focus-filter-settings">Filter Settings</link> popup. This allows a number of parameters to be set per filter to be used during an Autofocus run.
fr: La mise au point sera probablement plus aisée à obtenir en choisissant un filtre laissant passer le plus de lumière comme par exemple le filtre Lum. Cliquez sur l'icône de filtre <inlinemediaobject><imageobject><imagedata fileref="view-filter.png" format="PNG"/></imageobject></inlinemediaobject> pour ouvrir la fenêtre de dialogue des <link linkend="focus-filter-settings">Réglages de filtres</link>. Cela permet de régler un certain nombre de paramètres par filtre durant la mise au point automatique.

source: <guibutton>Reset</guibutton> button will reset the focusing subframe to full frame.
fr: Le bouton <guibutton>Réinitialiser</guibutton> permet de réinitialiser les réglages.

source: Tools Group
fr: Groupe d'outils

source: <screeninfo>Focus Tools Group</screeninfo>
fr: <screeninfo>Groupe d'outils de la mise au point</screeninfo>

source: <phrase>Focus Tools Group</phrase>
fr: <phrase>Groupe d'outils de la mise au point</phrase>

source: This section describes the focus tools that are currently available.
fr: Cette section décrit les outils de la mise au point actuellement disponibles.

source: The <guibutton>Aberration Inspector</guibutton> button starts an <link linkend="focus-aberration-inspector">Aberration Inspector</link> run. The <guibutton>Stop</guibutton> button can be used to stop the run.
fr: Le bouton <guibutton>Inspecteur</guibutton> démarre l'exécution de <link linkend="focus-aberration-inspector">l'inspecteur d'aberration</link>. Le bouton <guibutton>Arrêter</guibutton> peut être utilisé pour l'arrêter.

source: The <guibutton>CFZ</guibutton> button launches the <link linkend="focus-cfz">Critical Focus Zone</link> tool.
fr: Le bouton <guibutton>CFZ</guibutton> lance l'outil de la <link linkend="focus-cfz">zone critique de mise au point</link>.

source: The <guibutton>Advisor</guibutton> button launches the <link linkend="focus-advisor">Focus Advisor</link> tool.
fr: Le bouton <guibutton>Conseiller</guibutton> lance l'outil <link linkend="focus-advisor">Conseiller de mise au point</link>.

source: <title>Focus Options</title>
fr: <title>Options de la mise au point</title>

source: <screeninfo>Focus Options</screeninfo>
fr: <screeninfo>Options de la mise au point</screeninfo>

source: <phrase>Focus Options</phrase>
fr: <phrase>Options de la mise au point</phrase>

source: Parameters to configure Focus are accessed by pressing the <guibutton>Options...</guibutton> button. This launches the Options dialog with three panes:
fr: Les paramètres de configuration de la mise au point s'affichent en cliquant sur le bouton <guibutton>Options…</guibutton>. Une boîte de dialogue avec trois panneaux s'ouvre :

source: <link linkend="focus-settings">Settings</link>: These are general Focus settings.
fr: <link linkend="focus-settings">Réglages</link> : ce sont les réglages principaux de la mise au point.

source: <link linkend="focus-process">Process</link>: Parameters associated with the Autofocus process.
fr: <link linkend="focus-process">Processus</link> : ce sont les paramètres associés au processus de mise au point automatique.

source: <link linkend="focus-mechanics">Mechanics</link>: Parameters associated with the focuser mechanics.
fr: <link linkend="focus-mechanics">Mécanique</link> : ce sont les paramètres associées à la partie mécanique du moteur de mise au point.

source: The parameters are stored for each Optical Train. This allows different configurations to be stored for different equipment. Parameters are stored when they are changed, so on startup the last used configuration for the selected Optical Train is loaded.
fr: Les paramètres sont spécifiques à chaque train optique. Cela permet d'avoir différentes configurations pour différents équipements. Les paramètres sont enregistrés quand ils sont modifiés, ainsi, au démarrage, c'est la dernière configuration du train optique sélectionné qui est chargée.

source: <title>Focus Settings</title>
fr: <title>Réglages de la mise au point</title>

source: <screeninfo>Focus Settings</screeninfo>
fr: <screeninfo>Réglages de la mise au point</screeninfo>

source: <phrase>Focus Settings</phrase>
fr: <phrase>Réglages de la mise au point</phrase>

source: General section parameters:
fr: Paramètres de la section principale :

source: <guilabel>Auto Select Star</guilabel>: This setting is only relevant if <guilabel>Sub Frame</guilabel> is selected. In this case if <guilabel>Auto Select Star</guilabel> is selected then Ekos will select the star to use for focus; otherwise the user will have to manually select the star using FitsViewer.
fr: <guilabel>Sélection automatique d'étoile</guilabel> : ce réglage n'est activé que si <guilabel>Sous-trame</guilabel> est sélectionné. Dans ce cas, Ekos sélectionnera automatiquement une étoile pour la mise au point ; dans le cas contraire, l'opérateur devra choisir lui-même l'étoile en utilisant l'afficheur FITS.

source: <guilabel>Suspend Guiding</guilabel>: Set this option to suspend guiding during an Autofocus run. The purpose of this is to prevent guiding from having problems with defocused stars during the focus process where, for example, the guide scope is attached to the main telescope using an OAG.
fr: <guilabel>Suspendre le guidage</guilabel> : cochez cette option pour suspendre le guidage durant la procédure de mise au point automatique. La raison est de prévenir le guidage d'avoir des problèmes avec des étoiles dont la mise au point n'est pas faite lors de la procédure de mise au point, comme par exemple avec un guide hors axe (OAG) monté sur le télescope primaire.

source: <guilabel>Dark Frame</guilabel>: Check this option to perform dark-frame subtraction. This option can be useful in noisy images, where a pretaken dark is subtracted from the focus image before further processing.
fr: <guilabel>Trame Dark</guilabel> : cochez cette option pour réaliser une soustraction d'une trame Dark. Cette option peut être utile pour les images contenant beaucoup de bruit où un Dark préalablement acquis est soustrait de l'image de mise au point avant tout autre traitement.

source: If hot pixels are causing problems with focus, select Dark Frames and either setup a regular Master Dark frame or a Defect Map.
fr: Si des pixels chauds causent des problèmes de mise au point, sélectionnez des images Dark et utilisez soit un master Dark ou une carte de défauts.

source: Dark frames are used by Focus, Alignment and Guiding. See the Dark Library feature within the <link linkend="ekos-capture">Capture Module</link> for more details on how to setup Dark Frames.
fr: Les trames Dark sont utilisées pour la mise au point, l'alignement et le guidage. Veuillez consulter la fonctionnalité de bibliothèques de Dark dans le <link linkend="ekos-capture">module d'acquisition</link> pour davantage de détails sur l'utilisation des trames Dark.

source: <guilabel>Full Field</guilabel>: Select to use the full field of the camera. In this mode, focus will automatically select multiple stars for use in an Autofocus run. The alternative to this is <guilabel>Sub Frame</guilabel>.
fr: <guilabel>Plein Champ</guilabel> : utilise le plein champ de l'appareil. Dans ce mode, la mise au point va automatiquement sélectionner plusieurs étoiles pour la procédure de mise au point automatique. Une alternative à cela est <guilabel>Sous-trame</guilabel>.

source: <guilabel>Sub Frame</guilabel>: Select to use a single star for the Autofocus process. The alternative to this is <guilabel>Full Field</guilabel> where multiple stars will be used by Autofocus. Depending on the setting of <guilabel>Auto Select Star</guilabel> either the user or Ekos will select the star.
fr: <guilabel>Sous-trame</guilabel> : sélectionner pour utiliser une seule étoile pour la procédure de mise au point automatique. Une alternative à cela est d'utiliser <guilabel>Plein Champ</guilabel> où plusieurs étoiles seront utilisées. Selon les réglages de <guilabel>Sélection automatique d'étoile</guilabel>, soit l'opérateur aura à choisir l'étoile soit Ekos s'en chargera.

source: <guilabel>Box</guilabel>: Sets the box size used to enclose the focus star when using <emphasis role="bold">Sub Frame</emphasis>. Increase if you have very large stars. For Bahtinov focus the box size can be increased even more to better enclose the Bahtinov diffraction pattern.
fr: <guilabel>Taille de la boîte</guilabel> : règle la taille de la boîte qui délimite l'étoile de mise au point lors de l'utilisation d'une <emphasis role="bold">sous-trame</emphasis>. Augmentez si vous avez de très grosses étoiles. Pour la mise au point avec un masque de Bathinov, vous pouvez encore plus l'augmenter pour inclure les motifs de diffraction.

source: <guilabel>Display Units</guilabel>: Select the units for display on the Autofocus V-Curve when HFR or FWHM is selected. <emphasis role="bold">Pixels</emphasis> and <emphasis role="bold">Arc Seconds</emphasis> are supported.
fr: <guilabel>Afficher les unités</guilabel> : sélectionnez les unités à afficher sur la courbe en V de la procédure de mise au point automatique quand la méthode HFR ou FWHM est sélectionnée.

source: <guilabel>Guide Settle</guilabel>: This option is used in conjunction with <guilabel>Suspend Guiding</guilabel>. It allows any vibrations in the optical train to settle by waiting this many seconds after the Autofocus process has completed, before restarting guiding.
fr: <guilabel>Stabilisation du guide</guilabel> : cette option est utilisée conjointement avec <guilabel>Suspendre le guidage</guilabel>. Elle permet d'attendre ce nombre de secondes pour que le train optique se stabilise après la procédure de mise au point automatique avant de reprendre le guidage.

source: Mask Section Parameters:
fr: Paramètres de la section sur les masques :

source: These controls relate to <emphasis role="bold">Masking Options</emphasis> to be used when in <guilabel>Full Field</guilabel> mode. The effect of Masking Options can be seen in the <link linkend="focus-display">FITS Viewer</link>.
fr: L'ensemble suivant de boutons radio est associé aux <emphasis role="bold">Options de masquage</emphasis> qui sont utilisées dans le mode <guilabel>Plein champ</guilabel>. L'effet des options de masquage peut être vu dans l'<link linkend="focus-display">Afficheur FITS</link>.

source: <guilabel>Use all stars for focusing</guilabel>: Select this option if all stars of the field should be considered for focusing.
fr: <guilabel>Utiliser toutes les étoiles pour la mise au point</guilabel> : choisissez cette option si toutes les étoiles du champ doivent participer à la mise au point.

source: <guilabel>Ring Mask</guilabel>: This option provides two input fields that together define a doughnut over the FOV of the camera. Stars falling outside of the doughnut are discounted from processing. Setting an inner value above 0% causes stars in the centre of the FOV to be discarded. This could be useful to avoid using stars in the target of the image (for example a galaxy) for focusing purposes. Setting an outer value below 100% causes stars in the edges of the FOV to be discarded during focusing. This could be useful if you do not have a flat field out to the edges of your FOV.
fr: <guilabel>Masque annulaire</guilabel> : cette option fournit deux champs d'entrée qui définissent une surface en forme de beignet recouvrant le champ de vue (CdV) de l'appareil. Les étoiles en dehors de cette région ne sont pas prise en compte dans le traitement. En réglant la valeur intérieure au dessus de 0 %, les étoiles au centre du CdV sont rejetées. Cela peut être utile pour éviter d'utiliser des étoiles de la cible de l'image (par exemple une galaxie) pour la procédure de mise au point. En réglant la valeur extérieure sous 100 %, les étoiles se trouvant sur les bords du CdV sont rejetées. Cela peut être utile si vous ne disposez pas d'une image flat allant jusqu'aux coins du CdV.

source: <guilabel>Mosaic Mask</guilabel>: A 3x3 mosaic is composed with tiles from the image center, its corners and from the edges. This option is useful if you want to inspect the optics performance - you might know this from the PixInsight Aberration Inspector script. The tile size can be configured in percent of the frame width, with the spacer value specifying the space between the tiles.
fr: <guilabel>Masque de mosaïque</guilabel> : une mosaïque 3x3 est composée de tuiles du centre de l'image, de ses coins et de ses côtés. Cette option est utile si vous souhaitez inspecter la performance des optiques (vous connaissez peut-être ceci du script de l'inspecteur d'aberrations de PixInsight). La taille des tuiles peut être configurée en pourcent de la largeur de l'image avec la valeur du séparateur spécifiant l'espace entre les tuiles.

source: There are four use-cases for the Mosaic Mask:
fr: Il existe quatre cas d'utilisation pour le masque de mosaïque :

source: Checking focus in all parts of the sensor: The mask allows an easy visual inspection and comparisons of stars in the center, corners and edges of the sensor. This is especially useful for optics that show aberration if the focus is not 100% met.
fr: La vérification de la mise au point sur toute la surface du capteur : le masque permet une inspection visuelle facile et la comparaison des étoiles au centre, sur les bords et dans le coin du capteur. Cela est particulièrement utile pour les optiques présentant une aberration lorsque la mise au point n'est pas réalisée à 100%.

source: Correcting image tilt: especially large sensors are very sensitive to incorrect distance and tilting of the sensor. In such cases, the image shows aberration, especially in the image corners. If all corners show the same effect, the distance needs to be corrected. If the aberrations in the corners differ, this is typically the result of a tilted sensor.
fr: La correction de l'inclinaison de l'image : les grands capteurs sont particulièrement sensibles à une distance et une inclinaison du capteur. Dans de tels cas, l'image présente une aberration, surtout dans les coins. Si tous les coins sont touchés par le même effet, alors il est alors nécessaire de corriger les distances. Si ces aberrations sont différentes dans les coins, cela est typique d'une inclinaison du capteur.

source: Collimating Newtonians: inspecting frames in a defocused state is typically used for collimating Newtonians. See, for example, Tommy Nawratil's <ulink url="https://teleskop-austria.at/information/pdf/JUS_Photonewton_Collimation_Primer_EN.pdf"> The Photonewton Collimation Primer</ulink> for more details.
fr: La collimation des télescopes de Newton : l'inspection des images à une position légèrement éloignée de la mise au point est typiquement utilisée pour régler ces télescopes. Référez-vous par exemple à l'article de Tommy Nawratil <ulink url="https://teleskop-austria.at/information/pdf/JUS_Photonewton_Collimation_Primer_EN.pdf">The Photonewton Collimation Primer</ulink> pour davantage de détails.

source: Running the <link linkend="focus-aberration-inspector">Aberration Inspector</link> tool.
fr: Exécution de l'outil de <link linkend="focus-aberration-inspector">l'inspecteur d'aberration</link>

source: Adaptive Focus Parameters:
fr: Paramètres de la mise au point adaptative :

source: The next set of controls relate to <emphasis role="bold">Adaptive Focus</emphasis>. The idea here is to keep the telescope focused by adapting the focuser position based on changes in environmental conditions without having to perform a full Autofocus run. See the <link linkend="focus-adaptive">Adaptive Focus</link> section for more details.
fr: L'ensemble suivant de boutons est associé à la <emphasis role="bold">mise au point adaptative</emphasis>. L'idée ici est de conserver la mise au point du télescope en adaptant la position du moteur de mise au point en fonction de conditions environnementales sans avoir à lancer une procédure complète de mise au point automatique. Voir la section <link linkend="focus-adaptive">Mise au point adaptative</link> pour davantage de détails.

source: For example, as temperature changes during an imaging session so the focus point will change. By sampling the temperature between subframes it is possible to firstly calculate the change in temperature and then to convert this to a number of ticks of focuser movement to apply between subframes.
fr: Par exemple, la position de mise au point va varier en fonction de la température durant une session d'acquisition. En enregistrant la température entre les prises, il est possible de calculer la différence de température et ensuite de la convertir en un nombre de pas du moteur de mise au point à appliquer entre les prises.

source: In order to use <emphasis role="bold">Adaptive Focus</emphasis> it is necessary to setup some data for your system. In particular you need to tell Ekos how many ticks (and in which direction) to move the focuser when the environmental conditions change. This is covered in the <link linkend="focus-filter-settings">Filter Settings</link> popup. The popup is launched by clicking the filter icon <inlinemediaobject><imageobject><imagedata fileref="view-filter.png" format="PNG"/></imageobject></inlinemediaobject>.
fr: Afin d'utiliser la <emphasis role="bold">mise au point adaptative</emphasis> il est nécessaire de régler certaines données de votre système. Vous devez en particulier indiquer à Ekos le nombre de pas (et dans quelle direction) de déplacement lorsque les conditions environnementales changent. Cela est expliqué dans la fenêtre popup du <link linkend="focus-filter-settings">réglages du filtre</link>. Cette fenêtre est ouverte en cliquant sur l'icône du filtre <inlinemediaobject><imageobject><imagedata fileref="view-filter.png" format="PNG"/></imageobject></inlinemediaobject>.

source: The following controls are available:
fr: Les boutons de contrôle suivants sont disponibles :

source: <guilabel>Adaptive Focus</guilabel>: Select this option to activate <emphasis role="bold">Adaptive Focus</emphasis>.
fr: <guilabel>Mise au point adaptative</guilabel> : sélectionnez cette option pour activer ce mode.

source: <guilabel>Min Move</guilabel>: The minimum Adaptive Focus movement allowed.
fr: <guilabel>Déplacement minimale</guilabel> : le déplacement minimale de la mise au point adaptative autorisé.

source: <guilabel>Adapt Start Pos</guilabel>: Check to allow Adaptive Focus to calculate the start position for an Autofocus run. The starting position is the last good solve position for the selected filter, adapted for environmental changes.
fr: <guilabel>Position de départ</guilabel> : cochez pour permettre à la mise au point adaptative de calculer la position de départ d'une passe de mise au point automatique. Cette position est la dernière position de bonne résolution pour un filtre donné, adaptées aux changements de conditions.
