Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-capture.po
Languages: fr

source: <title>Capture</title>
fr: <title>Acquisition</title>

source: Tools
fr: Outils

source: <tertiary>Capture</tertiary>
fr: <tertiary>Acquisition</tertiary>

source: <screeninfo>Ekos Capture</screeninfo>
fr: <screeninfo>Acquisition Ekos</screeninfo>

source: <phrase>Ekos Capture</phrase>
fr: <phrase>Acquisition Ekos</phrase>

source: The Capture Module is your primary image and video acquisition module in Ekos. It enables you to capture single (Preview), multiple images (Sequence Queue), or record <ulink url="https://sites.google.com/site/astropipp/ser-player">SER</ulink> videos along with a selection of filter wheel and rotator, if available.
fr: Le module Acquisition est le module principal d'acquisition d'images et de vidéos d'Ekos. Il permet l'acquisition d'image unique (aperçu), d'images multiples (file de séquence) et d'enregistrer des vidéos au format <ulink url="https://sites.google.com/site/astropipp/ser-player">SER</ulink> tout en gérant éventuellement une roue à filtres et un rotateur si ces périphériques sont disponibles.

source: CCD &amp; Filter Wheel Group
fr: CCD et roue à filtres

source: Select the desired CCD/DSLR and Filter Wheel (if available) for capture. Set CCD temperature and filter settings.
fr: Veuillez sélectionner le CCD/APN et la roue à filtres (si disponible) pour l'acquisition. Réglez la température du CDD et la configuration des filtres.

source: <guilabel>CCD</guilabel>: Select the active CCD camera. If your camera has a guide head, you can select it from here as well.
fr: <guilabel>Caméra</guilabel> : sélectionnez la caméra CCD active. Si la caméra possède un guide, vous pouvez également le sélectionner ici.

source: <guilabel>FW</guilabel>: Select the active Filter Wheel device. If your camera has a built-in filter wheel, the device would be the same as the camera.
fr: <guilabel>Roue à filtres (RF)</guilabel> : sélectionnez le périphérique actif de roue à filtre. Si votre caméra possède une roue à filtres intégrée, le périphérique sera le même que la caméra.

source: <guilabel>Cooler</guilabel>: Toggle Cooler On/Off. Set the desired temperature, if your camera is equipped with a cooler. Check the option to force temperature setting before any capture. Capture process is only started after the measured temperature is within requested temperature tolerance. The <emphasis>default</emphasis> tolerance is 0.1 degrees Celsius but can be adjusted in <guilabel>Capture</guilabel> options under Ekos configuration.
fr: <guilabel>Refroidissement</guilabel> : (dés)activez le refroidisseur. Vous pouvez régler la température souhaitée de la caméra si elle possède un refroidisseur. Cochez cette option pour forcer les réglages de température avant l'acquisition. Celle-ci ne débute que lorsque la température mesurée se trouve dans la plage de tolérance de température. La tolérance <emphasis>par défaut</emphasis> est de 0,1 degrés Celsius mais peut être modifiée dans les options du module d'<guilabel>Acquisition</guilabel> d'Ekos.

source: <title>Capture Settings</title>
fr: <title>Réglages de l'acquisition</title>

source: <screeninfo>Capture Settings</screeninfo>
fr: <screeninfo>Réglages de l'acquisition</screeninfo>

source: <phrase>Capture Settings</phrase>
fr: <phrase>Réglages de l'acquisition</phrase>

source: Set all capture parameters as detailed below. Once set, you can capture a preview by click on <guibutton>Preview</guibutton> or add a job to the sequence queue.
fr: Configurez tous les paramètres d'acquisition comme détaillé ci-dessous. Une fois réglé, vous pouvez acquérir un aperçu en cliquant sur le bouton <guibutton>Aperçu</guibutton> ou ajouter une tâche à la séquence.

source: <guilabel>Exposure</guilabel>: Specify exposure duration in seconds.
fr: <guilabel>Durée d'exposition</guilabel> : spécifie la durée d'exposition en secondes.

source: <guilabel>Filter</guilabel>: Specify the desired filter.
fr: <guilabel>Filtre</guilabel> : spécifie le filtre désiré.

source: <guilabel>Count</guilabel>: Number of images to capture
fr: <guilabel>Nombre</guilabel> : spécifie le nombre d'images à acquérir.

source: <guilabel>Delay</guilabel>: Delay in seconds between image captures.
fr: <guilabel>Délai</guilabel> : spécifie la durée entre deux acquisitions en secondes.

source: <guilabel>Type</guilabel>: Specify the type of desired CCD frame. Options are <guimenuitem>Light</guimenuitem>, <guimenuitem>Dark</guimenuitem>, <guimenuitem>Bias</guimenuitem>, and <guimenuitem>Flat</guimenuitem> frames.
fr: <guilabel>Type</guilabel> : spécifie le type de trames CCD. Les options sont <guimenuitem>Light</guimenuitem>, <guimenuitem>Dark</guimenuitem>, <guimenuitem>Bias</guimenuitem> et <guimenuitem>Flat</guimenuitem>.

source: <guilabel>ISO</guilabel>: For DSLR cameras, specify the ISO value.
fr: <guilabel>ISO</guilabel> : spécifie la valeur ISO (seulement pour les APN).

source: <guilabel>Format</guilabel>: Specify capture save format. For all CCDs, only <guimenuitem>FITS</guimenuitem> option is available. For DSLR cameras, you can an additional option to save in <guimenuitem>Native</guimenuitem> format (&eg; RAW or JPEG).
fr: <guilabel>Format</guilabel> : spécifie le format d'enregistrement des images. Pour tous les CCD, seule l'option <guimenuitem>FITS</guimenuitem> est disponible. Pour les APN, vous pouvez enregistrer les images au format <guimenuitem>Natif</guimenuitem> (c'est-à-dire RAW ou JPEG, mais préférez RAW) en plus du format <guimenuitem>FITS</guimenuitem>.

source: <guilabel>Custom Properties</guilabel>: Set extended properties available in the camera to the job settings.
fr: <guilabel>Propriétés personnalisables</guilabel> : permet de régler les propriétés étendues disponibles dans la caméra pour la configuration des tâches.

source: <guilabel>Calibration</guilabel>: For Dark &amp;s; Flat frames, you can set additional options explained in the <link linkend="capture-calibration-frames">Calibration Frames section below</link>.
fr: <guilabel>Calibration</guilabel> : pour les trames Dark et Flat, vous pouvez spécifier des options additionnelles expliquées dans la section de la <link linkend="capture-calibration-frames">calibration des trames</link> ci-dessous.

source: <guilabel>Frame</guilabel>: Specify the left (X), top (Y), width (W), and height (H) of the desired CCD frame. If you changed the frame dimensions, you can reset it to default values by clicking on the reset button.
fr: <guilabel>Trame</guilabel> : spécifie l'origine gauche (X), haute (Y), la largeur (W) et la hauteur (H) des trames du CCD. Si vous avez modifié la dimension des trames, vous pouvez la réinitialiser en cliquant sur le bouton <guibutton>Réinitialiser</guibutton>.

source: <guilabel>Binning</guilabel>: Specify horizontal (X) and vertical (Y) binning.
fr: <guilabel>Groupement de pixels</guilabel> : spécifie le groupement de pixels horizontal (X) et vertical (Y) (binning en anglais).

source: Custom Properties
fr: Propriétés personnalisables

source: Many cameras offer additional properties that cannot be directly set in the capture settings using the common control. The capture controls described above represent the most common settings shared among different cameras, but each camera is unique and may offer its own extended properties. While you can use INDI Control Panel to set any property in the driver; it is important to be able to set such property for each job in the sequence. When you click <guibutton>Custom Properties</guibutton>, a dialog is shown divided into <guilabel>Available Properties</guilabel> and <guilabel>Job Properties</guilabel>. When you move an <guilabel>Available Properties</guilabel> to the <guilabel>Job Property</guilabel> list, its current value can be recorded once you click <guibutton>Apply</guibutton>. When you add a job to the <guilabel>Sequence Queue</guilabel>, the properties values selected in the <guilabel>Job Properties</guilabel> list shall be recorded and saved.
fr: Beaucoup de caméras proposent des propriétés additionnelles qui ne peuvent pas être directement contrôlées dans les réglages de l'acquisition en utilisant les commandes communes. Les commandes d'acquisition décrites ci-dessus représentent les réglages les plus courants qui sont partagés par les différentes caméras mais chaque caméra est unique et peut proposer des propriétés étendues propres. Bien que vous puissiez utiliser le tableau de bord d'INDI pour régler les propriétés du pilote, il est important de pouvoir régler ces propriétés pour chaque tâche de la séquence. Quand vous cliquez sur le bouton <guibutton>Propriétés personnalisables</guibutton>, une boîte de dialogue apparaît divisée en <guilabel>Propriétés disponibles</guilabel> et <guilabel>Propriétés de la tâche</guilabel>. En déplaçant une <guilabel>Propriétés disponibles</guilabel> vers la liste des <guilabel>Propriétés de la tâche</guilabel>, sa valeur courante peut être enregistrée en cliquant sur le bouton <guibutton>Appliquer</guibutton>. Quand vous ajoutez une tâche à la <guilabel>file d'attente des séquences</guilabel>, les valeurs des propriétés sélectionnées dans la liste des <guilabel>Propriétés de la tâche</guilabel> seront enregistrées.

source: The following video explains this concept is more detail with a live example:
fr: La prochaine vidéo explique ce concept en détails avec un exemple concret :

source: Custom Properties feature
fr: Fonctionnalité des propriétés personnalisables

source: <title>File Settings</title>
fr: <title>Réglages des fichiers</title>

source: <screeninfo>File Settings</screeninfo>
fr: <screeninfo>Réglages des fichiers</screeninfo>

source: <phrase>File Settings</phrase>
fr: <phrase>Réglages des fichiers</phrase>

source: Settings for specifying where captured images are saved to, and how to generate unique file names in addition to upload mode settings.
fr: Les réglages qui spécifient le dossier d'enregistrement des images et la manière de générer des noms de fichier unique et également les modes de téléversement.

source: <guilabel>Target</guilabel>: The name of the celestial target to be captured &eg; M42. Can be preloaded by the Scheduler Module and by selection with KStars.
fr: <guilabel>Cible</guilabel> : le nom de la cible à acquérir, par exemple M42. Peut être préchargée par le module Ordonnanceur ou par sélection dans KStars.

source: <guilabel>Format</guilabel>: The Format string defines the path and filename of the captured images by the use of placeholder tags that are filled in with the selected item of data at save time.
fr: <guilabel>Format</guilabel> : la chaîne format définit l'emplacement et le nom du fichier des images acquises grâce à l'utilisation d'étiquettes réservées renseignées de l'élément sélectionné à l'heure d'enregistrement.

source: A tag is identified by the % character. All tags have a single letter short form, and a self descriptive long form.
fr: Une étiquette est identifiée par le caractère %. Toutes les étiquettes ont la forme d'une seule lettre ainsi qu'une description longue.

source: Arbitrary text may also be included within the Format string, <emphasis role="bold">except the % and \ characters.</emphasis> The / path character can be used to define arbitrary directories.
fr: Du texte libre peur être inclus dans la chaîne format, <emphasis role="bold">sauf les caractères % et \</emphasis>. Le caractère d'emplacement / peut être utilisé pour définir des dossiers arbitraires.

source: Note: Tags are case sensitive in both their short and long forms.
fr: Remarque : les étiquettes sont sensibles à la casse dans leur forme courte et longue.

source: Available placeholder tags:
fr: Étiquettes réservées disponibles :

source: <emphasis role="bold">%f</emphasis> or <emphasis role="bold">%filename</emphasis>: The name of the sequence .esq file, without extension.
fr: <emphasis role="bold">%f</emphasis> ou <emphasis role="bold">%filename</emphasis> : le nom du fichier de séquence .seq, sans extension.

source: <emphasis role="bold">%D</emphasis> or <emphasis role="bold">%Datetime</emphasis>: The current time and date <emphasis role="bold">when the file is saved. Only use this tag in the filename portion of the format, not in the path portion.</emphasis>
fr: <emphasis role="bold">%D</emphasis> ou <emphasis role="bold">%Datetime</emphasis> : l'heure et la date courante <emphasis role="bold">au moment de l'enregistrement. N'utilisez cette étiquette que dans la portion du nom de fichier du format, et non dans celle de l'emplacement</emphasis>.

source: <emphasis role="bold">%T</emphasis> or <emphasis role="bold">%Type</emphasis>: The frame type &eg; 'Light', 'Bias', 'Dark', 'Flat'...
fr: <emphasis role="bold">%T</emphasis> ou <emphasis role="bold">%Type</emphasis>: le type de trame, par exemple 'Light', 'Bias', 'Dark', 'Flat'…

source: <emphasis role="bold">%e</emphasis> or <emphasis role="bold">%exposure</emphasis>: The exposure duration in seconds.
fr: <emphasis role="bold">%e</emphasis> ou <emphasis role="bold">%exposure</emphasis>: la durée d'exposition en secondes.

source: <emphasis role="bold">%F</emphasis> or <emphasis role="bold">%Filter</emphasis>: The active filter name.
fr: <emphasis role="bold">%F</emphasis> ou <emphasis role="bold">%Filter</emphasis>: le nom du filtre actif.

source: <emphasis role="bold">%t</emphasis> or <emphasis role="bold">%target</emphasis>: The Target name.
fr: <emphasis role="bold">%t</emphasis> ou <emphasis role="bold">%target</emphasis>: le nom de la cible.

source: <emphasis role="bold">%s*</emphasis> or <emphasis role="bold">%sequence*</emphasis>: The image sequence identifier where * is the number of digits used (1-9). <emphasis role="bold">This tag is mandatory and must be the last element in the format.</emphasis>
fr: <emphasis role="bold">%s*</emphasis> ou <emphasis role="bold">%sequence*</emphasis> : l'identifiant de la séquence d'images où * est le nombre de chiffres utilisés (1-9). <emphasis role="bold">Cette étiquette est obligatoire et doit être le dernier élément du format</emphasis>.

source: <guilabel>Directory Browse Button</guilabel>: Opens a browse dialog to allow selection of the directory location used in the Format string. Use when first defining a Capture job.
fr: <guilabel>Bouton de navigation de dossier</guilabel> : ouvre une fenêtre permettant de choisir l'emplacement du dossier utilisé dans la chaîne Format. Utilisé lors de la première définition de la tâche d'acquisition.

source: <guilabel>Preview</guilabel>: Shows a preview of the resulting filename according to the Format string and other job settings.
fr: <guilabel>Aperçu</guilabel> : affiche un aperçu du nom de fichier en fonction du format de chaîne défini et des configurations des autre tâches.

source: Placeholder tags that are specified by the sequence .seq file can only be displayed once the sequence file has been saved.
fr: Les étiquettes réservées spécifiées par le fichier de séquence .seq ne peuvent être affichées que lorsque le fichier de séquence a été enregistré.

source: The Datetime tag is previewed with the current system time and will be replaced by the time at point of image save.
fr: L'étiquette horaire est affichée avec l'heure système courante et sera remplacée par l'heure d'enregistrement de l'image.

source: The sequence tag is always previewed as image 1 in the sequence and will be automatically incremented when the job is in progress.
fr: L'étiquette de séquence est toujours affichée en tant que première image de la séquence et sera automatiquement incrémentée avec la progression des tâches.

source: <guilabel>Upload</guilabel>: Select how captured images are uploaded:
fr: <guilabel>Téléversement</guilabel> : spécifie comment les images doivent être téléversées.

source: <guilabel>Client</guilabel>: Captured images are only uploaded to Ekos and saved to the local directory specified above.
fr: <guilabel>Client</guilabel> : les images sont téléversées vers Ekos et enregistrées dans le dossier local spécifié ci-dessus.

source: <guilabel>Local</guilabel>: Captured images are only saved locally on the remote computer.
fr: <guilabel>Local</guilabel> : les images sont enregistrées en local sur l'ordinateur distant.

source: <guilabel>Both</guilabel>: Captured images are saved on the remote device <emphasis role="bold">and</emphasis> uploaded to Ekos.
fr: <guilabel>Les deux</guilabel> : les images sont enregistrées sur l'ordinateur distant <emphasis role="bold">et</emphasis> téléversées vers Ekos.

source: When selecting <guimenuitem>Local</guimenuitem> or <guimenuitem>Both</guimenuitem>, you must specify the remote directory where the remote images are saved to. By default, all captured images are uploaded to Ekos.
fr: Si vous spécifiez <guimenuitem>Local</guimenuitem> ou <guimenuitem>Les deux</guimenuitem>, vous devez indiquer le dossier distant pour l'enregistrement des images. Par défaut, toutes les images sont téléversées vers Ekos.

source: <guilabel>Remote</guilabel>: When selecting either <guimenuitem>Local</guimenuitem> or <guimenuitem>Both</guimenuitem> modes above, you must specify the remote directory where remote images are saved to.
fr: <guilabel>À distance</guilabel> : si vous sélectionnez <guimenuitem>Local</guimenuitem> ou <guimenuitem>Les deux</guimenuitem>, vous devez indiquer le dossier distant d'enregistrement des images.

source: <guilabel>Preview</guilabel>: Shows a preview of the resulting filename according the provided path job settings. The file name format for saving remotely is pre-defined, placeholder tags may not be used. The file sequence number is always previewed as image 1 in the sequence and will be automatically incremented when the job is in progress.
fr: <guilabel>Aperçu</guilabel> : affiche un aperçu du nom de fichier résultant de la configuration de l'emplacement de la tâche. Le format du nom de fichier des enregistrements à distance est prédéfini (les étiquettes réservées ne peuvent être utilisées). Le numéro de la séquence de fichiers commence toujours à 1 et sera automatiquement incrémenté avec la progression de la séquence.

source: <title>Limit Settings</title>
fr: <title>Réglages des limites</title>

source: <screeninfo>Limit Settings</screeninfo>
fr: <screeninfo>Réglages des limites</screeninfo>

source: <phrase>Limit Settings</phrase>
fr: <phrase>Réglages des limites</phrase>

source: Limit settings are applicable to all the images in the sequence queue. When a limit is exceeded, Ekos shall command the appropriate action to remedy the situation as explained below.
fr: Les réglages des limites sont applicables à toutes les images dans la file d'attente des séquences. Quand une limite est dépassée, Ekos déclenchera l'action appropriée pour remédier à la situation comme expliqué ci-dessous.

source: <guilabel>Guiding Deviation</guilabel>: If checked, it enforces a limit of maximum allowable guiding deviation for the exposure, if autoguiding is used. If the guiding deviation exceeds this limit in arcseconds, it aborts the exposure sequence. It will automatically resume the exposure sequence again once the guiding deviation goes below this limit.
fr: <guilabel>Déviation de guidage</guilabel> : si cette option est cochée, la déviation maximale de guidage pour une exposition est appliquée. Si la déviation de guidage (mesurée en secondes d'arc) est dépassée, la séquence est interrompue. Elle reprendra dès que la déviation de guidage redeviendra inférieure à la limite.

source: <guilabel>Autofocus if HFR &gt;</guilabel>: If autofocus is enabled in the <link linkend="ekos-focus">focus module</link> and at least one autofocus operation was completed successfully, you can set the maximum acceptable HFR value. If this option is enabled then between consecutive exposures, the HFR value is recalculated, and if found to exceed the maximum acceptable HFR value, then an autofocus operation is automatically triggered. If the autofocus operation is completed successfully, the sequence queue resumes, otherwise, the job is aborted.
fr: <guilabel>Mise au point automatique si HFR &gt;</guilabel> : si la mise au point automatique est activée dans le <link linkend="ekos-focus">module de mise au point</link> et qu'au moins une opération de mise au point automatique s'est terminée avec succès, vous pouvez indiquer la valeur maximale de HFR acceptable. Si cette option est activée, alors la valeur HFR est recalculée entre chaque acquisition ; si cette valeur dépasse la valeur limite acceptable, une mise au point automatique est déclenchée. En cas de succès, la séquence reprend, sinon elle est interrompue.

source: <guilabel>Meridian Flip</guilabel>: If supported by the mount, set the hour angle limit (in hours) before a <ulink url="https://astronomy.mdodd.com/gem_movement.html">meridian flip</ulink> is commanded. For example, if you set the meridian flip duration to 0.1 hours, Ekos shall wait until the mount passes the meridian by 0.1 hours (6 minutes), then it commands the mount to perform a meridian flip. After the meridian flip is complete, Ekos re-aligns using astrometry.net (if <link linkend="ekos-align">the alignment</link> was used) and resumes guiding (if it was started before) and then resumes the capture process automatically.
fr: <guilabel>Retournement au méridien</guilabel> : si cela est géré par la monture, spécifie l'angle horaire limite (en heures) avant qu'un <ulink url="https://astronomy.mdodd.com/gem_movement.html">retournement au méridien</ulink> soit déclenché. Par exemple si vous spécifiez la durée de retournement au méridien à 0,1 heure, alors Ekos attendra que la monture dépasse le méridien de 0,1 heure (6 minutes) pour déclencher le retournement au méridien. Ensuite Ekos réalisera un alignement en utilisant astrometry.net (si <link linkend="ekos-align">l'alignement</link> est utilisé) et reprendra le guidage (s'il était démarré avant cette opération) et l'acquisition.

source: <title>Sequence Queue</title>
fr: <title>File d'attente des séquences</title>

source: Sequence Queue is the primary hub of the Ekos Capture Module. This is where you can plan and execute jobs using the sequence queue built-in powerful editor. To add a job, simply select all the parameters from the capture and file settings as indicated above. Once you selected your desired parameters, click on the add button <inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject> in the sequence queue to add it to the queue.
fr: La file d'attente des séquences est la plate-forme principale du module d'acquisition d'Ekos. C'est l'endroit où vous planifiez et exécutez les tâches en utilisant le puissant ordonnanceur intégré. Pour ajouter une tâche, il suffit de sélectionner tous les paramètres des réglages de l'acquisition et du nommage de fichier comme indiqué ci-dessus. Ensuite, cliquez sur le bouton d'ajout <inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject> de la file d'attente des séquences pour l'ajouter à la file d'attente.

source: <screeninfo>Sequence Queue</screeninfo>
fr: <screeninfo>File d'attente des séquences</screeninfo>

source: <phrase>Sequence Queue</phrase>
fr: <phrase>File d'attente des séquences</phrase>
