Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_commands.po
Languages: fr

source: Command Reference
fr: Liste des commandes

source: Menu Commands
fr: Commandes des menus

source: Commands
fr: Commandes

source: File Menu
fr: Menu Fichier

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open Image...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Ouvrir Image…</guimenuitem>

source: Open an image in the FITS Viewer.
fr: Ouvre une image dans l'afficheur FITS.

source: <guimenu>File</guimenu> <guimenuitem>Save Sky Image...</guimenuitem>
fr: <guimenu>Fichier</guimenu> <guimenuitem>Enregistrer l'image du ciel…</guimenuitem>

source: Create image on disk from current display.
fr: Crée une image de l'affichage courant sur le disque.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Run Script...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Exécuter un script…</guimenuitem>

source: Run the specified &kstars; script.
fr: Exécute le script de &kstars; spécifié.

source: <guimenu>File</guimenu> <guimenuitem>Printing Wizard...</guimenuitem>
fr: <guimenu>Fichier</guimenu> <guimenuitem>Assistant d'impression…</guimenuitem>

source: Starts a wizard to configure capturing sky objects images using telescope and printing the results as a good looking printout for further use or catalogization.
fr: Démarre l'assistant de configuration pour l'acquisition d'images d'objets du ciel en utilisant un télescope et pour l'impression des résultats comme tirage de bonne qualité pour une utilisation ultérieure ou la constitution d'un catalogue.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Imprimer…</guimenuitem>

source: Send the current sky map to the printer (or to a &PostScript;/&PDF; file).
fr: Envoie la carte actuelle du ciel à l'imprimante (ou dans un fichier &PostScript;/&PDF;)

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Quitter</guimenuitem>

source: Quit &kstars;.
fr: Quitte &kstars;.

source: Time Menu
fr: Menu Heure

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Set Time to Now</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Heure</guimenu> <guimenuitem>Régler l'heure à maintenant</guimenuitem>

source: Sync time to system clock.
fr: Synchronise l'heure avec l'horloge du système.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Set Time...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Heure</guimenu> <guimenuitem>Régler l'heure…</guimenuitem>

source: Set time and date.
fr: Régler l'heure et la date.

source: <shortcut> <keycap>&lt;</keycap> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Advance One Step Backward in Time</guimenuitem>
fr: <shortcut> <keycap>&lt;</keycap> </shortcut> <guimenu>Heure</guimenu> <guimenuitem>Recule d'un pas dans le temps</guimenuitem>

source: Advance one step backward in time in the &kstars; simulation of the sky chart. The duration of the time step can be configured after pressing the little <guilabel>&gt;</guilabel> button on the &kstars; toolbar.
fr: Recule d'un pas dans le temps dans la simulation de la carte du ciel de &kstars;. La durée d'un pas temporel peut être réglée en appuyant sur le petit bouton <guilabel>|&lt;</guilabel> dans la barre d'outils de &kstars;.

source: <guimenu>Time</guimenu> <guimenuitem>Stop Clock</guimenuitem>
fr: <guimenu>Heure</guimenu> <guimenuitem>Arrêter l'horloge</guimenuitem>

source: Toggle whether time passes.
fr: (Dés)active le défilement du temps.

source: <shortcut> <keycap>&gt;</keycap> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Advance One Step Forward in Time</guimenuitem>
fr: <shortcut> <keycap>&gt;</keycap> </shortcut> <guimenu>Heure</guimenu> <guimenuitem>Avance d'un pas dans le temps</guimenuitem>

source: Advance one step forward in time in the &kstars; simulation of the sky chart. The duration of the time step can be configured after pressing the little <guilabel>&gt;</guilabel> button on the &kstars; toolbar.
fr: Avance d'un pas dans le temps dans la simulation de la carte du ciel de &kstars; La durée d'un pas temporel peut être réglée en appuyant sur le petit bouton <guilabel>&gt;|</guilabel> dans la barre d'outils de &kstars;.

source: Pointing Menu
fr: Menu Pointage

source: <shortcut> <keycap>Z</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Zenith</guimenuitem>
fr: <shortcut> <keycap>Z</keycap></shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Zénith</guimenuitem>

source: Center the display at the <link linkend="ai-zenith">Zenith</link> point (straight up).
fr: Centre l'affichage au <link linkend="ai-zenith">Zénith</link> (juste à la verticale).

source: <shortcut> <keycap>N</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>North</guimenuitem>
fr: <shortcut> <keycap>N</keycap></shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Nord</guimenuitem>

source: Center the display above the North point on the horizon.
fr: Centre l'affichage au-dessus de l'horizon nord.

source: <shortcut> <keycap>E</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>East</guimenuitem>
fr: <shortcut> <keycap>E</keycap> </shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Est</guimenuitem>

source: Center the display above the East point on the horizon.
fr: Centre l'affichage au-dessus de l'horizon est.

source: <shortcut> <keycap>S</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>South</guimenuitem>
fr: <shortcut> <keycap>S</keycap> </shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Sud</guimenuitem>

source: Center the display above the South point on the horizon.
fr: Centre l'affichage au-dessus de l'horizon sud.

source: <shortcut> <keycap>W</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>West</guimenuitem>
fr: <shortcut> <keycap>W</keycap> </shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Ouest</guimenuitem>

source: Center the display above the West point on the horizon.
fr: Centre l'affichage au-dessus de l'horizon ouest.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Set Coordinates Manually...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Définir les coordonnées manuellement…</guimenuitem>

source: Center the display on specific <link linkend="ai-skycoords">sky coordinates</link>.
fr: Centre l'affichage sur des <link linkend="ai-skycoords">coordonnées célestes</link> spécifiques.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Find Object...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Chercher un objet…</guimenuitem>

source: Locate an object by name using the <link linkend="findobjects">Find Object Window</link>.
fr: Cherche un objet par son nom en utilisant la fenêtre <link linkend="findobjects">Chercher un objet</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Engage/Stop Tracking</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Pointage</guimenu> <guimenuitem>Démarrer/Arrêter le suivi</guimenuitem>

source: Toggle tracking on/off. While tracking, the display will remain centered on the current position or object.
fr: (Dés)active le suivi. Lors du suivi, l'affichage restera centré sur la position courante de l'objet.

source: View Menu
fr: Menu Affichage

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Zoom avant</guimenuitem>

source: Zooms view in.
fr: Zoom avant de l'affichage.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Zoom arrière</guimenuitem>

source: Zooms view out.
fr: Zoom arrière de l'affichage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Default Zoom</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Zoom par défaut</guimenuitem>

source: Restore the default Zoom setting.
fr: Restaure le réglage par défaut du zoom.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom to Angular Size...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;&Maj;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Zoomer à la dimension angulaire…</guimenuitem>

source: Zoom to specified field-of-view angle.
fr: Fait un zoom à l'angle de champ de vision spécifié.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;&Maj;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Mode Plein écran</guimenuitem>

source: Toggle full-screen mode.
fr: (Dés)active le mode plein écran.

source: <shortcut> &Space; </shortcut> <guimenu>View</guimenu> <guimenuitem>Switch to Star Globe View / Switch to Horizontal View</guimenuitem>
fr: <shortcut> <keysym>Espace</keysym> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Passer à la vue du globe céleste (Coordonnées équatoriales) / Passer à la vue horizontale (Coordonnées azimutales)</guimenuitem>

source: Toggle between the <link linkend="horizontal">Horizontal</link> and <link linkend="equatorial">Equatorial</link> <link linkend="ai-skycoords">Coordinate Systems</link>.
fr: (Dés)active la vue des <link linkend="ai-skycoords">systèmes de coordonnées</link> <link linkend="horizontal">azimutales</link> et <link linkend="equatorial">équatoriales</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Terrain</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;&Maj;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Afficher le terrain</guimenuitem>

source: Toggle the <link linkend="terrain">terrain image</link> visibility.
fr: (Dés)active l'affichage de <link linkend="tool-obsplanner">l'image du terrain</link>.

source: <guimenu>View</guimenu> <guisubmenu>Projection</guisubmenu>
fr: <guimenu>Affichage</guimenu> <guisubmenu>Projection</guisubmenu>

source: A submenu that lists all projections.
fr: Un sous-menu qui liste toutes les projections.

source: <shortcut><keycap>F5</keycap></shortcut><guimenuitem>Lambert Azimuthal Equal-area</guimenuitem>
fr: <shortcut> <keycap>F5</keycap></shortcut> <guimenuitem>Azimutale équivalente de Lambert</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Lambert_azimuthal_equal-area_projection">Lambert azimuthal equal-area</ulink> projection.
fr: Passe l'affichage de la carte du ciel à la projection <ulink url="https://fr.wikipedia.org/wiki/Projection_azimutale_%C3%A9quivalente_de_Lambert">azimutale équivalente de Lambert</ulink>.

source: <shortcut><keycap>F6</keycap></shortcut><guimenuitem>Azimuthal Equidistant</guimenuitem>
fr: <shortcut> <keycap>F6</keycap> </shortcut> <guimenuitem>Azimutale équidistante</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Azimuthal_equidistant_projection">azimuthal equidistant</ulink> projection.
fr: Passe l'affichage de la carte du ciel à la projection <ulink url="https://https://fr.wikipedia.org/wiki/Projection_de_Postel">azimutale équidistante</ulink> (ou projection de Postel).

source: <shortcut><keycap>F7</keycap></shortcut><guimenuitem>Orthographic</guimenuitem>
fr: <shortcut> <keycap>F7</keycap></shortcut> <guimenuitem>Orthographique</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Orthographic_projection_(cartography)">orthographic</ulink> projection.
fr: Passe l'affichage de la carte du ciel à la projection <ulink url="https://fr.wikipedia.org/wiki/Projection_orthographique">orthographique</ulink>.

source: <shortcut><keycap>F8</keycap></shortcut><guimenuitem>Equirectangular</guimenuitem>
fr: <shortcut> <keycap>F8</keycap> </shortcut> <guimenuitem>Équi-rectangulaire</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Equirectangular_projection">equirectangular</ulink> projection.
fr: Passe l'affichage de la carte du ciel à la projection <ulink url="https://fr.wikipedia.org/wiki/Projection_cylindrique_%C3%A9quidistante">équi-rectangulaire </ulink> (appelée encore cylindrique équidistante).

source: <shortcut><keycap>F9</keycap></shortcut><guimenuitem>Stereographic</guimenuitem>
fr: <shortcut> <keycap>F9</keycap></shortcut> <guimenuitem>Stéréographique</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Stereographic_projection">stereographic</ulink> projection.
fr: Passe l'affichage de la carte du ciel à la projection <ulink url="https://fr.wikipedia.org/wiki/Projection_st%C3%A9r%C3%A9ographique">stéréographique</ulink>.

source: <shortcut><keycap>F10</keycap></shortcut><guimenuitem>Gnomonic</guimenuitem>
fr: <shortcut> <keycap>F10</keycap> </shortcut> <guimenuitem>Gnomonique</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Gnomonic_projection">gnomonic</ulink> projection.
fr: Passe l'affichage de la carte du ciel à la projection <ulink url="https://fr.wikipedia.org/wiki/Projection_gnomonique">gnomonique</ulink>

source: <guimenu>View</guimenu> <guisubmenu>HiPS All Sky Overlay</guisubmenu>
fr: <guimenu>Affichage</guimenu> <guisubmenu>Superposition HiPS de tout le ciel</guisubmenu>

source: A submenu that lists the enabled surveys. Select the <guimenuitem>HiPS Settings...</guimenuitem> menu item for configure the <link linkend="hips">HiPS</link> sky overlays.
fr: Un sous-menu qui liste les superpositions activées. Sélectionnez <guimenuitem>Paramètres HiPS…</guimenuitem> pour configurer les superpositions du ciel <link linkend="hips">HiPS</link>.

source: Tools Menu
fr: Menu Outils

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Calculator</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;&Maj;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Calculatrice</guimenuitem>

source: Opens the <link linkend="tool-calculator">AstroCalculator</link> Tool, which provides full access to many of the mathematical functions used by &kstars;.
fr: Ouvre l'outil <link linkend="tool-calculator">Calculatrice astronomique</link> vous donnant accès à un grand nombre de fonctions mathématiques utilisées par &kstars;.

source: <guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu>
fr: <guimenu>Outils</guimenu> <guisubmenu>Périphériques</guisubmenu>

source: A submenu for control supported devices.
fr: Un sous-menu pour contrôler les périphériques gérés.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>0</keycap></keycombo></shortcut> <guimenuitem>List your Equipment...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>0</keycap></keycombo> </shortcut> <guimenuitem>Liste de votre équipement…</guimenuitem>

source: Allows you to define your equipment characteristics for observation logs. The Configure Equipment window is divided into four tabs: <guilabel>Telescope</guilabel>, <guilabel>Eyepiece</guilabel>, <guilabel>Lens</guilabel> and <guilabel>Filter</guilabel>. You can add a new equipment by completing its characteristics and pressing <guibutton>Add New...</guibutton> button. You can also save or remove an equipment from the list.
fr: Permet de définir les caractéristiques de votre équipement pour les fichiers journaux d'observations. La fenêtre Configurer équipement est divisée en quatre onglets : <guilabel>Télescope</guilabel>, <guilabel>Oculaire</guilabel>, <guilabel>Objectif</guilabel> et <guilabel>Filtre</guilabel>. Vous pouvez ajouter un nouvel équipement en complétant ses caractéristiques et en appuyant sur le bouton <guibutton>Ajouter nouveau…</guibutton>. Vous pouvez également enregistrer ou supprimer un équipement depuis la liste.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenuitem>Device Manager...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenuitem>Gestionnaire de périphériques…</guimenuitem>

source: Opens up the device manager, which allows you to start/shutdown device drivers and connect to remote INDI servers.
fr: Ouvre le gestionnaire de périphériques qui vous permet de démarrer/arrêter les pilotes de périphériques et à les connecter à des serveurs INDI distants.

source: Custom Drivers...
fr: Pilotes personnalisés…

source: A dialog to customize the drivers.
fr: Une boîte de dialogue pour personnaliser les pilotes…

source: INDI Control Panel...
fr: Tableau de bord INDI…

source: Opens up INDI Control Panel, which allows you to control all the features supported by a device.
fr: Ouvre le tableau de bord INDI qui vous permet de contrôler toutes les fonctions gérées par un périphérique.

source: <guimenu>Tools</guimenu> <guimenuitem>Sky Calendar</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Agenda du ciel</guimenuitem>

source: Opens the <guilabel>Sky Calendar</guilabel> Tool, which allows you to plan observations of Solar System planets by giving graphical data on sets and rises of these objects.
fr: Ouvre l'outil de <guilabel>Agenda du ciel</guilabel> qui vous permet de planifier les observations des planètes du système solaire en donnant des données graphiques sur le lever et le coucher de ces objets.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Altitude vs. Time</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Élévation selon l'heure</guimenuitem>

source: Opens the <link linkend="tool-altvstime">Altitude vs. Time</link> Tool, which can plot curves representing the altitude of any object as a function of time. This is useful for planning observing sessions.
fr: Ouvre l'outil <link linkend="tool-altvstime">Élévation selon l'heure</link>, qui peut tracer des courbes qui représentent l'altitude de n'importe quel objet en fonction de l'heure. C'est utile pour planifier les sessions d'observation.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>What's up Tonight</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Dans le ciel cette nuit</guimenuitem>

source: Opens the <link linkend="tool-whatsup">What's up Tonight</link> Tool, which presents a summary of the objects which are observable from your location on a given date.
fr: Ouvre l'outil <link linkend="tool-whatsup">Dans le ciel cette nuit</link>, qui présente un résumé des objets qui sont observables de votre position à un moment donné.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>What's Interesting...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Digne d'intérêt…</guimenuitem>

source: Opens the <guilabel>What's Interesting</guilabel> Tool, which allows you to be informed about the most interesting observations that can be made from your current location using the given equipment.
fr: Ouvre l'outil <guilabel>Digne d'intérêt</guilabel> qui vous informe sur les observations les plus intéressantes que vous pouvez faire depuis votre position et avec un équipement donné.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>XPlanet Solar System Simulator</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Simulateur de système solaire XPlanet</guimenuitem>

source: This menu item will appear only if you have installed the <application>XPlanet</application> optional package.
fr: Ce menu n'apparaît que si le programme optionnel <application>XPlanet</application> est installé.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Script Builder</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Constructeur de scripts</guimenuitem>

source: Opens the <link linkend="tool-scriptbuilder">Script Builder</link> Tool, which provides a GUI interface for building &kstars; &DBus; scripts.
fr: Ouvre l'outil <link linkend="tool-scriptbuilder">Constructeur de scripts</link>, qui fournit une interface graphique pour construire des scripts &DBus; pour &kstars;.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Solar System</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Système solaire</guimenuitem>

source: Opens the <link linkend="tool-solarsys">Solar System Viewer</link>, which displays an overhead view of the solar system on the current simulation date.
fr: Ouvre l'<link linkend="tool-solarsys">afficheur du système solaire</link>, qui affiche une vue aérienne du système solaire à la date de simulation courante.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Ekos</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Ekos</guimenuitem>
