Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_indi.po
Languages: fr

source: <guilabel>INDI drivers XML directory:</guilabel> Specify the &XML; directory where INDI drivers are located in your system. By default, &kstars; uses <quote>/usr/share/indi</quote> directory.
fr: <guilabel>Répertoire XML des pilotes INDI</guilabel> : spécifie le répertoire &XML; sur votre système contenant les pilotes INDI. Par défaut &kstars; utilise le répertoire <quote>/usr/share/indi</quote>.

source: <guilabel>Default FITS directory:</guilabel> Specify the directory where all captured FITS images will be saved to. If no directory is specified, images will be stored in <varname>$HOME</varname>.
fr: <guilabel>Répertoire FITS par défaut : </guilabel> spécifie le dossier où toutes les images FITS seront enregistrées. S'il n'y a pas de répertoire spécifié, les images seront enregistrées dans <varname>$HOME</varname>.

source: Time &amp; Location Updates
fr: Synchronisation heure &amp; et emplacement

source: <guilabel>KStars updates all devices</guilabel>: KStars is the master source for time and location settings. All INDI devices time and locations settings are synchronized to KStars settings.
fr: <guilabel>&kstars; synchronise tous les périphériques</guilabel> : &kstars; est la source des réglages de l'heure et de l'emplacement. Tous les réglages d'heure et d'emplacement des périphériques INDI sont synchronisés avec les réglages de &kstars;.

source: <guilabel>Mount updates KStars</guilabel>: Mount handset is the master source of time and location settings. KStars time and location settings are synchronized with controller settings.
fr: <guilabel>La monture synchronise &kstars;</guilabel> : la télécommande de la monture est la source des réglages de l'heure et de l'emplacement. Les réglages de l'heure et de l'emplacement de &kstars; sont synchronisés avec les réglages de la télécommande de la monture.

source: <guilabel>GPS updates KStars</guilabel>: GPS driver is the master source of time and location settings. KStars time and location settings are synchronized with GPS settings.
fr: <guilabel>Le GPS synchronise &kstars;</guilabel> : le pilote du GPS est la source des réglages d'heure et d'emplacement. Les réglages de l'heure et de l'emplacement de &kstars; sont synchronisés avec les réglages du GPS.

source: <guilabel>Time</guilabel>: Synchronize KStars date and time automatically from the update source.
fr: <guilabel>Heure</guilabel> : la date et l'heure de &kstars; est synchronisé automatiquement à partir de la source de synchronisation.

source: <guilabel>Location</guilabel>: Synchronize KStars location settings from the update source.
fr: <guilabel>Emplacement</guilabel> : l'emplacement de &kstars; est synchronisé automatiquement à partir de la source de synchronisation.

source: Display
fr: Affichage

source: <guilabel>Telescope crosshair</guilabel>: When checked, &kstars; displays the telescope's target crosshair on the sky map. The crosshair is displayed upon a successful connection to the telescope and its location is updated periodically. The telescope's name is displayed next to the crosshair. &kstars; displays one crosshair per each connected telescope. To change the color of the telescope's crosshair, open the <link linkend="viewops">Configure - &kstars;</link> window. Select the <guilabel>Colors</guilabel> page, and then change the color of the <guimenuitem>Target Indicator</guimenuitem> item to the desired color.
fr: <guilabel>Réticule du télescope</guilabel> : lorsque cela est coché, &kstars; affiche le réticule du télescope sur la carte du ciel. La croix est affichée lors d'une connexion réussie au télescope, et son emplacement est actualisé périodiquement. Le nom du télescope est affiché à côté du réticule. &kstars; affiche un réticule pour chaque télescope connecté. Pour changer la couleur du réticule du télescope, ouvrez la fenêtre <link linkend="viewops">Configuration de &kstars;</link>. Sélectionnez l'onglet <guilabel>Couleurs</guilabel>, et changez la couleur de l'élément <guimenuitem>Indicateur de cible</guimenuitem> dans la couleur désirée.

source: <guilabel>Independent window</guilabel>: Make <guilabel>FITS Viewer</guilabel> window independent.
fr: <guilabel>Fenêtre indépendante</guilabel> : rendre la fenêtre de l'<guilabel>afficheur FITS</guilabel> indépendante.

source: <guilabel>Message notifications</guilabel>: Show INDI messages as desktop notifications instead of dialogs.
fr: <guilabel>Notifications des messages</guilabel> : montrer les messages d'INDI comme des notifications du bureau plutôt que dans des boîtes de dialogue.

source: Server Port
fr: Port du serveur

source: Specify range of ports that INDI Server will bind to when starting new drivers.
fr: Spécifiez une plage de ports que le serveur INDI puisse utiliser lors du démarrage de nouveaux pilotes.

source: INDI Concepts
fr: Concepts INDI

source: Telescope Control
fr: Contrôle de télescope

source: The main key concept in INDI is that devices have the ability to describe themselves. This is accomplished by using &XML; to describe a generic hierarchy that can represent both canonical and non-canonical devices. In INDI, all <emphasis>devices</emphasis> may contain one or more <emphasis>properties</emphasis>. Any <emphasis>property</emphasis> may contain one or more <emphasis>elements</emphasis>. There are four types of INDI properties:
fr: Le concept clé principal dans INDI est que les périphériques ont la possibilité de se décrire eux-mêmes. Ceci s'accomplit en utilisant le &XML; pour décrire une hiérarchie générique qui peut représenter à la fois les périphériques canoniques et non canoniques. Dans INDI, tous les <emphasis>périphériques</emphasis> peuvent contenir une ou plusieurs <emphasis>propriétés</emphasis>. Toute <emphasis>propriété</emphasis> peut contenir un ou plusieurs <emphasis>éléments</emphasis>. Il y a quatre types de propriétés INDI :

source: Text property.
fr: Propriétés de texte.

source: Number property.
fr: Propriété de nombre.

source: Switch property (Represented in &GUI; by buttons and checkboxes).
fr: Propriété d'activation (représenté dans l'interface graphique par des boutons et des cases à cocher).

source: Light property (Represented in &GUI; by colored LEDs).
fr: Propriétés de lumière (représenté dans l'interface graphique par des LED colorées).

source: For example, all INDI devices share the CONNECTION standard switch <emphasis>property</emphasis>. The CONNECTION property has two elements: CONNECT and DISCONNECT switches. &kstars; parses the generic &XML; description of properties and builds a &GUI; representation suitable for direct human interaction.
fr: Par exemple, tous les périphériques INDI partagent la <emphasis>propriété</emphasis> interrupteur standard CONNECTION. La propriété CONNECTION possède deux éléments : les interrupteurs CONNECT et DISCONNECT. &kstars; analyse la description générique &XML; des propriétés et construit une représentation graphique adaptée à l'interaction humaine directe.

source: The INDI control panel offers many device properties not accessible from the sky map. The properties offered differ from one device to another. Nevertheless, all properties share common features that constrains how they are displayed and used:
fr: Le tableau de bord INDI offre beaucoup de propriétés de périphériques inaccessibles de la carte du ciel. Les propriétés offertes diffèrent d'un périphérique à l'autre. Néanmoins, toutes les propriétés partagent des fonctionnalités communes qui déterminent comment elles sont affichées et utilisées.

source: Permission: All properties can either be read-only, write-only, or read and write enabled. An example of a read-write property is the telescope's Right Ascension. You can enter a new Right Ascension and the telescope, based on current settings, will either slew or sync to the new input. Furthermore, when the telescope slews, its Right Ascension gets updated and sent back to the client.
fr: Permissions : toutes les propriétés peuvent être soit en lecture seule, écriture seule ou les deux. Un exemple de propriété en écriture seule est l'ascension droite du télescope. Vous pouvez donner une nouvelle ascension droite et le télescope, selon sur les réglages courants, se déplacera obliquement ou se synchronisera à la nouvelle entrée. De plus, lorsque le télescope se déplace obliquement, son ascension droite se met à jour et est renvoyée au client.

source: State: Prefixed to each property is a state indicator (round LED). Each property has a state and an associated color code:
fr: État : avant pour chaque propriété se trouve un état d'indicateur (LED ronde). Chaque propriété a un état et un code de couleur associé :

source: INDI State color code
fr: Code de couleur d'état INDI

source: State
fr: État

source: Color
fr: Couleur

source: Idle
fr: En attente

source: Gray
fr: Gris

source: Device is performing no action with respect to this property
fr: Le périphérique ne réalise pas d'action respectant cette propriété

source: Green
fr: Vert

source: Last operation performed on this property was successful and active
fr: La dernière opération effectuée sur cette propriété a réussi et est active.

source: Busy
fr: Occupé

source: Yellow
fr: Jaune

source: The property is performing an action
fr: La propriété effectue une action

source: Alert
fr: Alerte

source: <entry>Red</entry>
fr: <entry>Rouge</entry>

source: The property is in critical condition and needs immediate attention
fr: La propriété est dans un état critique et a besoin d'une attention immédiate

source: The device driver updates the property state in real-time when necessary. For example, if the telescope is in the process of slewing to a target, then the RA/DEC properties will be signaled as <guilabel>Busy</guilabel>. When the slew process is completed successfully, the properties will be signaled as <guilabel>Ok</guilabel>.
fr: Le pilote de périphérique met à jour l'état de propriété en temps réel lorsque nécessaire. Par exemple, si le télescope est dans le processus de mouvement oblique vers une cible, alors les propriétés d'AD et de Déc seront signalées comme <guilabel>Occupé</guilabel>. Quand le processus de déplacement oblique est terminé avec succès, les propriétés seront signalées comme <guilabel>Ok</guilabel>.

source: Context: Numerical properties can accept and process numbers in two formats: decimal and sexagesimal. The sexagesimal format is convenient when expressing time or equatorial/geographical coordinates. You can use any format at your convenience. For example, all the following numbers are equal:
fr: Contexte : les propriétés numériques peuvent accepter et traiter des nombres en deux formats : décimal et sexagésimal. Le format sexagésimal est pratique lors de l'expression d'heures ou coordonnées équatoriales / galactiques. Vous pouvez utiliser n'importe quel format selon vos besoins. Par exemple, tous les nombres suivants sont égaux :

source: Time: The standard time for all INDI-related communications is Universal Time UTC specified as YYYY-MM-DDTHH:MM:SS in accord with ISO 8601. &kstars; communicates the correct UTC time with device drivers automatically. You can enable/disable automatic time updates from the <guilabel>INDI</guilabel> page in the settings dialog.
fr: Heure : l'heure standard pour toutes les communications en relation avec INDI est l'heure UTC, spécifié en AAAA-MM-JJTHH:MM:SS selon la norme ISO 8601. &kstars; communique l'heure UTC correcte avec les pilotes de périphériques automatiquement. Vous pouvez activer / désactiver la mise à jour automatique de l'heure depuis la page <guilabel>INDI</guilabel> de la boîte de dialogue de configuration.

source: Remote Device Control
fr: Contrôle de périphériques à distance

source: Remote Devices
fr: Périphériques distants

source: &kstars; provides a simple yet powerful layer for remote device control. A detailed description of the layer is described in the INDI <ulink url="https://www.clearskyinstitute.com/INDI/INDI.pdf">white paper</ulink>.
fr: &kstars; fournit une couche de contrôle de périphérique à distance simple, mais puissante. Une description détaillée de la couche est décrite dans <ulink url="https://www.clearskyinstitute.com/INDI/INDI.pdf">l'article</ulink> sur INDI.

source: You need to configure both the server and client machines for remote control:
fr: Vous avez besoin de configurer à la fois les machines serveur et client pour le contrôle à distance :

source: <guilabel>Server</guilabel>: To prepare a device for remote control, follow the same steps in the <link linkend="indi-kstars-setup">local/server</link> setup. When you start a device service in the <guilabel>Device Manager</guilabel>, a port number is displayed under the <guilabel>Port</guilabel> column. In addition to the port number, you also need the hostname or IP address of your server.
fr: <guilabel>Serveur</guilabel> : pour préparer un matériel pour le contrôle distant, suivez les mêmes étapes que dans le réglage <link linkend="indi-kstars-setup">local / serveur</link>. Lorsque vous lancez un service de matériel dans le <guilabel>gestionnaire de périphériques</guilabel>, un numéro de port s'affiche sous la colonne <guilabel>Port pour écouter</guilabel>. En plus du numéro de port, vous avez aussi besoin du nom d'hôte ou adresse IP de votre serveur.

source: <guilabel>Client</guilabel>: Select the <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>Device Manager...</guimenuitem></menuchoice> menu item and you can add, modify, or delete hosts into <guilabel>Client</guilabel> tab. Add a host by clicking on the <guibutton>Add</guibutton> button. Enter the hostname/IP address of the server in the <guilabel>Host:</guilabel> field, and enter the port number obtained from the <emphasis>server</emphasis> machine in step 1.
fr: <guilabel>Client</guilabel> : sélectionnez le <menuchoice><guimenuitem>gestionnaire de périphériques</guimenuitem> dans le menu <guimenu>Périphériques</guimenu></menuchoice> et cliquez sur l'onglet <guilabel>Client</guilabel>. Vous pouvez ajouter, modifier ou supprimer des hôtes sous l'onglet <guilabel>Client</guilabel>. Ajoutez un hôte en cliquant sur le bouton <guibutton>Ajouter</guibutton>. Donnez un nom d'hôte / adresse IP sur le serveur dans le champ <guilabel>Hôte</guilabel> et donnez le numéro de port obtenu de la machine <emphasis>serveur</emphasis> dans l'étape 1.

source: INDI Client
fr: Client INDI

source: After you add a host, right click on the host to <guimenuitem>Connect</guimenuitem> or <guimenuitem>Disconnect</guimenuitem>. If a connection is established, you can control the telescope from the <guilabel>Sky map</guilabel> or <guilabel>INDI Control Panel</guilabel> exactly as described in the <link linkend="indi-kstars-setup">local/server</link> section. It is as easy at that.
fr: Après que vous aurez ajouté un hôte, cliquez avec le bouton droit sur l'hôte à <guimenuitem>connecter</guimenuitem> ou <guimenuitem>déconnecter</guimenuitem>. Si une connexion est établie, vous pouvez contrôler le télescope depuis la <guilabel>Carte du ciel</guilabel> ou le <guilabel>tableau de bord INDI</guilabel> exactement comme décrit dans la section <link linkend="indi-kstars-setup">local / serveur</link>. c'est aussi facile que ça.

source: Running an INDI server from the command line
fr: Lancement d'un serveur INDI depuis la ligne de commande

source: While &kstars; allows you to easily deploy an INDI server; you can launch an INDI server from the command line.
fr: Comme &kstars; vous permet de déployer un serveur INDI, vous pouvez lancer un serveur INDI depuis la ligne de commande.

source: Since INDI is an independent backend component, you can run an INDI server on a host without &kstars;. INDI can be compiled separately to run on remote hosts. Furthermore, device drivers log messages to <constant>stderr</constant> and that can be helpful in a debugging situation. The syntax for INDI server is as following:
fr: Comme INDI est indépendant du composant d'arrière-plan, vous pouvez lancer un serveur INDI sur un hôte sans &kstars;. INDI peut être compilé séparément pour fonctionner sur des hôtes distants. De plus, les pilotes de périphériques écrivent dans un journal les messages dans <constant>stderr</constant>. Cela peut être utile pour les situations de recherche d'erreur. La syntaxe pour le serveur INDI est la suivante :

source: For example, if you want to start an INDI server running an LX200 GPS driver and listening to connections on port 8000, you would run the following command:
fr: Par exemple, si vous voulez démarrer un serveur INDI gérant un pilote LX200 GPS et écouter les connexions sur le port 8000, vous devez lancer la commande suivante :

source: Secure Remote Operation
fr: Sécurisation des opérations distantes

source: Suppose we want to run an indiserver with INDI drivers on a remote host, <constant>remote_host</constant>, and connect them to &kstars; running on the local machine.
fr: Supposons que nous voulions lancer un indiserver avec les pilotes INDI sur une machine distante, <constant>machine-distante</constant>, et les connecter à &kstars; qui fonctionne sur la machine locale.

source: From the local machine log onto the remote host, <constant>remote_host</constant>, by typing:
fr: Depuis la machine locale, connectez-vous sur la machine distante <constant>machine-distante</constant> en saisissant :

source: This binds the <varname>local_port</varname> on the local machine to the <varname>remote_port</varname> on the <constant>remote_host</constant>. After logging in, run indiserver on the remote host:
fr: Ceci lie le <varname>local-port</varname> de la machine locale au <varname>remote-port</varname> du <constant>remote-host</constant>. Après connexion, exécutez indiserver sur la machine distante :

source: Back on the local machine, start &kstars; then open the <guimenuitem>Device Manager</guimenuitem> and add a host under the <guilabel>Client</guilabel> tab. The host should be the local host (usually 127.0.0.1) and the port number should be the <varname>local_port</varname> used in the steps above. <mousebutton>Right</mousebutton>-click on the host and select <guimenuitem>Connect</guimenuitem> from the popup menu. &kstars; will connect to the remote INDI server securely. The host information will be saved for future sessions.
fr: De retour sur la machine locale, lancez &kstars;, puis ouvrez le <guimenuitem>Gestionnaire de périphériques</guimenuitem> et ajoutez un hôte sous l'onglet <guilabel>Client</guilabel>. L'hôte doit être localhost (habituellement 127.0.0.1) et le numéro de port doit être le <varname>local-port</varname> utilisé dans les étapes ci-dessus. Cliquez avec le bouton <mousebutton>droit</mousebutton> sur l'hôte et sélectionnez <guimenuitem>Connecter</guimenuitem> dans le menu contextuel. &kstars; se connectera au serveur INDI distant en sécurité. Les informations d'hôte seront enregistrées pour les sessions futures.

source: INDI Frequently Asked Questions
fr: Foire aux questions d'INDI

source: What is INDI?
fr: Qu'est INDI ?

source: <acronym>INDI</acronym> is the <ulink url="https://indilib.org"> Instrument-Neutral-Distributed-Interface</ulink> control protocol developed by <author><firstname>Elwood</firstname><surname>C. Downey</surname></author> of <ulink url="https://www.clearskyinstitute.com/">ClearSky Institute</ulink>. &kstars; employs device drivers that are compatible with the INDI protocol. INDI has many advantages including loose coupling between hardware devices and software drivers. Clients that use the device drivers (like &kstars;) are completely unaware of the device capabilities. In run time, &kstars; communicates with the device drivers and builds a completely dynamical &GUI; based on services provided by the device. Therefore, new device drivers can be written or updated and &kstars; can take full advantage of them without any changes on the client side.
fr: <acronym>INDI</acronym> est le protocole de contrôle <ulink url="http://indi.sourceforge.net">Instrument-Neutral-Distributed-Interface</ulink> développé par <author><firstname>Elwood</firstname><surname>C. Downey</surname></author> du <ulink url="http://www.clearskyinstitute.com/">ClearSky Institute</ulink>. &kstars; emploie des pilotes de périphériques qui sont compatibles avec le protocole INDI. INDI a beaucoup d'avantages, y compris le couplage non lié entre les périphériques et les pilotes logiciels. Les clients qui utilisent les pilotes de périphériques (comme &kstars;) sont complètement ignorants des possibilités du matériel. En fonctionnement, &kstars; communique avec les pilotes de périphériques et construit une interface graphique complètement dynamique utilisant les services fournis par le matériel. De ce fait, les nouveaux pilotes de périphériques peuvent être écrits ou mis à jour, et &kstars; peut en tirer avantage sans changement du côté client.

source: Do you plan to support more devices?
fr: Comptez-vous gérer plus de périphériques ?

source: Yes. We plan to support major CCD cameras and focusers and extend support for more telescopes. If you would like INDI to support a particular device, please send an email to <email>indi-devel@lists.sourceforge.net</email>
fr: Oui. Nous comptons gérer la plupart des caméras CCD et viseurs et étendre la gestion pour les télescopes. Si vous vouliez gérer un matériel particulier, veuillez envoyer un courrier électronique à <email>indi-devel@lists.sourceforge.net</email>

source: What operations does &kstars; provide to control the telescope?
fr: Quelles opérations &kstars; fournit-il pour contrôler le télescope ?

source: It depends on the particular telescope you're running, but the minimum three operations are <command>Slew</command>, <command>Track</command>, and <command>Sync</command>, which you can issue directly from the sky map. Your telescope must be aligned for those operations to perform correctly. Some telescopes offer you more operations like site management, slew modes, focusing, parking, and more. You can access the telescopes extended features from the <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>INDI Control Panel...</guimenuitem></menuchoice> menu item.
fr: Cela dépend du télescope que vous utilisez, mais les trois opérations minimales sont : <command>Pivoter</command>, <command>Suivre</command> et <command>Synchroniser</command>, que vous pouvez utiliser directement depuis la carte du ciel. Votre télescope doit être mis en station pour que ces opérations fonctionnent correctement. Certains télescopes fournissent davantage d'opérations comme la gestion des sites, les modes de pivotage, la mise au point, le stationnement, et plus encore. Vous pouvez accéder aux caractéristiques étendues des télescopes depuis le menu <menuchoice><guimenu>Outils</guimenu> <guisubmenu>Périphériques</guisubmenu> <guimenuitem>Panneau de contrôle INDI…</guimenuitem></menuchoice>.

source: What's the difference between <command>Slew</command>, <command>Track</command>, and <command>Sync</command> exactly?
fr: Quelle est exactement la différence entre <command>Pivoter</command>, <command>Suivre</command> et <command>Synchroniser</command> ?
