Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-analyze.po
Languages: fr

source: <title>Analyze</title>
fr: <title>Analyser</title>

source: Tools
fr: Outils

source: <tertiary>Analyze</tertiary>
fr: <tertiary>Analyse</tertiary>

source: <screeninfo>Ekos Analyze Module</screeninfo>
fr: <screeninfo>Module analyse Ekos</screeninfo>

source: <phrase>Ekos Analyze Module</phrase>
fr: <phrase>Module analyse Ekos</phrase>

source: The Analyze Module records and displays what happened in an imaging session. That is, it does not control any if your imaging, but rather reviews what occurred. Sessions are stored in an <filename class="directory">analyze</filename> folder, a sister folder to the main logging folder. The <literal role="extension">.analyze</literal> files written there can be loaded into the <guilabel>Analyze</guilabel> tab to be viewed. <guilabel>Analyze</guilabel> also can display data from the current imaging session.
fr: Le module Analyse enregistre et affiche ce qui s'est passé durant une session d'acquisition. C'est-à-dire qu'il ne contrôle pas la session mais plutôt analyse ce qui s'y est passé. Les sessions sont enregistrées dans le dossier <filename class="directory">analyze</filename> qui se trouve dans le même dossier que le dossier contenant les fichiers journaux. Les fichiers <literal role="extension">.analyze</literal> enregistrés peuvent être chargés dans l'onglet <guilabel>Analyse</guilabel> pour affichage. Le module <guilabel>Analyse</guilabel> peut également afficher les données de la session d'acquisition courante.

source: There are two main graphs, <guilabel>Timeline</guilabel> and <guilabel>Stats</guilabel>. They are coordinated&mdash;they always display the same time interval from the Ekos session, though the x-axis of the <guilabel>Timeline</guilabel> shows seconds elapsed from the start of the log, and <guilabel>Stats</guilabel> shows clock time. The x-axis can be zoomed in and out with the <guibutton>+/-</guibutton> buttons, as well as with standard keyboard shortcuts (&eg; zoom-in == <keycombo>&Ctrl;<keycap>+</keycap></keycombo>) The x-axis can be panned with the scroll bar as well as with the left and right arrow keys. You can view your current imaging session, or review old sessions by loading <literal role="extension">.analyze</literal> files using the <guilabel>Input</guilabel> dropdown. Checking <guilabel>Full Width</guilabel> displays all the data, and <guilabel>Latest</guilabel> displays the most recent data (you can control the width by zooming).
fr: Il y a deux graphiques principaux, <guilabel>Chronologie</guilabel> et <guilabel>Statistiques</guilabel>. Les deux sont synchronisés au sens où ils utilisent le même intervalle de temps de la session Ekos quoique l'axe de x du graphique <guilabel>Chronologie</guilabel> affiche les secondes depuis le début du fichier journal alors que le graphique des <guilabel>Statistiques</guilabel> montre le temps de l'horloge. Un zoom avant ou arrière est possible sur cet axe avec le bouton <guibutton>+/-</guibutton> ou la <mousebutton>molette</mousebutton> de la souris ou encore le raccourci clavier standard (c'est-à-dire zoom avant == <keycombo>&Ctrl;<keycap>+</keycap></keycombo>). L'axe temporel peut être déplacé avec la barre de défilement ou avec les touches flèches du clavier. Vous pouvez afficher votre session courante ou revoir d'anciennes sessions en ouvrant les fichiers <literal role="extension">.analyze</literal> avec la liste déroulante <guilabel>Entrée</guilabel>. En cochant la case <guilabel>Plein champ</guilabel>, vous verrez toutes les données alors que la case <guilabel>Dernier</guilabel> affichera les données les plus récentes (vous pouvez contrôler la largeur en zoomant).

source: The three main displays can be hidden to make more room for the other displays. There are checkboxes to the left of the section titles (Timeline, Statistics, and Details) that enable and hide the displays.
fr: Les trois affichages principaux peuvent être cachés pour laisser de la place aux autres affichages. Ce sont les cases à cocher à gauche du titre de la section (Chronologie, statistiques et détails) qui permettent d'afficher ou de cacher ces affichages.

source: Timeline
fr: Chronologie

source: Timeline shows the major Ekos processes, and when they were active. For instance, the <guilabel>Capture</guilabel> line shows when images were taken (wither green for RGB or color-coded by the filter) and when imaging was aborted (shown as red sections). Clicking on a capture section gives information about that image, and double clicking on one brings up the image taken then in a fitsviewer, if it is available.
fr: Le graphique Chronologie affiche les processus principaux d'Ekos et quand ils étaient actifs. Par exemple, la ligne <guilabel>Acquisition</guilabel> montre le moment où une image a été prise (verte pour RGB ou une couleur liée au filtre utilisé)) et quand l'acquisition a été arrêtée (en rouge). En cliquant sur une section d'acquisition, vous obtiendrez de l'information sur cette image et en double-cliquant vous ferez apparaître l'image dans l'afficheur FITS, s'il est disponible.

source: If you have moved your captured images, you can set <guilabel>alternate directory</guilabel> in the input menu to a directory which is the base of part of the original file path.
fr: Si vous avez déplacé vos images vous pouvez configurer un <guilabel>dossier alternatif</guilabel> dans le menu d'entrée en indiquant l'emplacement de base du fichier.

source: Clicking on a <guilabel>Focus</guilabel> segment shows focus session information and displays up the position vs HFR measurements from that session. Clicking on a <guilabel>Guider</guilabel> segment shows a drift plot from that session, (if it's guiding) and the session's RMS statistics. Other timelines show status information when clicked.
fr: En cliquant sur un segment de <guilabel>mise au point</guilabel>, vous ferez apparaître de l'information concernant la session et affiche les mesures de position selon le HFR de cette session. En cliquant sur un segment du <guilabel>guidage</guilabel>, c'est un graphique de la dérive de cette session qui sera affiché et, s'il le guidage est actif, ce sont les statistiques RMS qui seront affichées.

source: Statistics
fr: Statistiques

source: A variety of statistics can be displayed on the <guilabel>Statistics</guilabel> graph. There are too many for all to be shown in a readable way, so select among them with the checkboxes. A reasonable way to start might be to use <guilabel>rms</guilabel>, <guilabel>snr</guilabel> (using the internal guider with SEP Multistar), and <guilabel>hfr</guilabel> (if you have auto-compute HFR in the FITS options). Experiment with others.
fr: Toute une série de statistiques peut être affichée sur le graphique <guilabel>Statistiques</guilabel>. Elles sont trop nombreuses pour être toutes affichées de manière lisible, donc il vaut mieux en choisir un nombre réduit. Un bon choix est de commencer avec <guilabel>rms</guilabel>, <guilabel>snr</guilabel> (en utilisant le guidage interne avec le SEP mutlistars) et <guilabel>hfr</guilabel> (si vous avez sélectionné l'option de calcul automatique du HFR dans les options FITS). Vous pouvez tester les autres également.

source: The left axis shown is initially appropriate only for RA/DEC error, drift, RMS error, RA/DEC pulses, and HFR, plotted in arc-seconds and defaulting to a range of -2 to 5 arc-seconds. However, clicking on one of boxes below the Statistics graph (that shows a statistic's value) will set that statistic's range as the range shown on the left-axis. Double clicking on that box will bring up a menu allowing you to adjust the statistic's plotted y-range (e.g. setting it to auto, explicitly typing in the range, setting it back to its default value, and also changing the color of that statistic's plot).
fr: L'axe de gauche est initialement approprié pour les erreurs en AD/DEC, la dérive, l'erreur RMS, les pulsations AD/DEC et le HFR, tracés en secondes d'arc et avec des valeurs par défaut allant de -2 à -5 secondes d'arc. Toutefois, un clic sur une des boîtes sous le graphique des statistiques (qui montre une valeur de statistique) réglera la plage de statistiques sur la base de la plage affichée sur l'axe de gauche. Un double-clic sur cette boîte affichera une fenêtre dans laquelle il est possible d'ajuster cette plage de valeurs (soit en choisissant auto, soit en saisissant explicitement la plage ou encore en remettant les valeurs par défaut, ainsi que le choix de la couleur du graphique).

source: The statistic shown on the left axis can also be scaled (awkwardly) using the mouse <mousebutton>wheel</mousebutton>. It can be panned by dragging the mouse up or down over the left axis' numbers. Clicking anywhere inside the Statistics graph fills in the values of the displayed statistics. Checking the latest box causes the most recent values (from a live session) to be the statistics displayed. This graph is zoomed and panned horizontally in coordination with the timeline.
fr: Les valeurs de la statistique peuvent aussi (bizarrement) être mis à l'échelle en utilisant la <mousebutton>molette</mousebutton> de la souris. Il peut aussi être déplacé en glissant la souris vers le haut ou vers le bas sur l'axe de gauche. Un clic n'importe où dans le graphique des statistiques affiche les valeurs des statistiques affichées. En cochant la dernière case, on affiche les valeurs les plus récentes (à partir d'une session en direct). Ce graphique est zoomé et déplacé horizontalement en synchronisation avec la ligne temporelle.
