Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ellipticalgalaxies.po
Languages: fr

source: <title>Elliptical Galaxies</title>
fr: <title>Galaxies elliptiques</title>

source: <primary>Elliptical Galaxies</primary>
fr: <primary>Galaxies elliptiques</primary>

source: Elliptical galaxies are spheroidal concentrations of billions of stars that resemble Globular Clusters on a grand scale. They have very little internal structure; the density of stars declines smoothly from the concentrated center to the diffuse edge, and they can have a broad range of ellipticities (or aspect ratios). They typically contain very little interstellar gas and dust, and no young stellar populations (although there are exceptions to these rules). Edwin Hubble referred to Elliptical galaxies as <quote>early-type</quote> galaxies, because he thought that they evolved to become Spiral Galaxies (which he called <quote>late-type</quote> galaxies). Astronomers actually now believe the opposite is the case (&ie;, that Spiral galaxies can turn into Elliptical galaxies), but Hubble's early- and late-type labels are still used.
fr: Les galaxies elliptiques sont des concentrations sphéroïdales de milliards d'étoiles qui ressemblent à des amas globulaires à grande échelle. Elles ont une très petite structure interne ; la densité des étoiles diminue doucement du centre concentré vers des bords diffus et elles peuvent avoir une large plage d'ellipticité (ou proportions). Elles contiennent typiquement très peu de gaz et de poussière interstellaires et pas de population d'étoiles jeunes (bien qu'il y ait des exceptions à ces règles). Edwin Hubble rapporta les galaxies elliptiques comme des galaxies <quote>précoces</quote>, car il pensait qu'elles évoluaient pour devenir des galaxies spirales (qu'il appelait <quote>tardives</quote>). Les astronomes pensent maintenant le contraire dans ce cas (c'est-à-dire que les galaxies spirales peuvent se transformer en galaxies elliptiques), mais les types précoces et tardives de Hubble sont toujours utilisés.

source: Once thought to be a simple galaxy type, ellipticals are now known to be quite complex objects. Part of this complexity is due to their amazing history: ellipticals are thought to be the end product of the merger of two Spiral galaxies. You can view a computer simulation MPEG movie of such a merger at <ulink url="http://oposite.stsci.edu/pubinfo/pr/2002/11/vid/v0211d3.mpg"> this NASA HST webpage</ulink> (warning: the file is 3.4 MB).
fr: Supposées pendant un temps être un type de galaxies simple, les elliptiques sont maintenant connues comme étant des objets complexes. Une partie de cette complexité est due à leur histoire étonnante : les galaxies elliptiques sont supposées être le produit final de la fusion de deux galaxies spirales. Vous pouvez voir une simulation par ordinateur en film MPEG d'une telle fusion sur <ulink url="http://oposite.stsci.edu/pubinfo/pr/2002/11/vid/v0211d3.mpg">cette page HST de la NASA</ulink> (attention : le fichier fait 3,4 Mo).

source: Elliptical galaxies span a very wide range of sizes and luminosities, from giant Ellipticals hundreds of thousands of light years across and nearly a trillion times brighter than the sun, to dwarf Ellipticals just a bit brighter than the average globular cluster. They are divided to several morphological classes:
fr: Les galaxies elliptiques s'étalent sur une grande plage de taille et de luminosité, des géantes elliptiques, d'une taille de centaines de milliers d'années-lumière et presque un milliard de fois plus brillantes que le Soleil, aux naines elliptiques, juste un peu plus brillantes que l'amas globulaire moyen. Elles se divisent en plusieurs groupes morphologiques :

source: cD galaxies:
fr: Galaxies cD :

source: Immense and bright objects that can measure nearly 1 Megaparsec (3 million light years) across. These titans are only found near the centers of large, dense clusters of galaxies, and are likely the result of many galaxy mergers.
fr: Des objets immenses et brillants qui peuvent mesurer presque 1 mégaparsec (3 millions d'années-lumière). Ces titans ne sont trouvés que près du centre de grands et denses amas de galaxies et sont vraisemblablement le résultat de la fusion de plusieurs galaxies.

source: Normal Elliptical galaxies
fr: Galaxies elliptiques normales

source: Condensed Object with relatively high central surface brightness. They include the giant ellipticals (gE'e), intermediate-luminosity ellipticals (E's), and compact ellipticals.
fr: Objet condensé avec une surface centrale relativement brillante. Elles incluent les elliptiques géantes (gE), celles de luminosité intermédiaire (E) et les elliptiques denses.

source: Dwarf elliptical galaxies (dE's)
fr: Galaxies elliptiques naines (dE)

source: This class of galaxies is fundamentally different from normal ellipticals. Their diameters on the order of 1 to 10 kiloparsec with surface brightness that is much lower than normal ellipticals, giving them a much more diffuse appearance. They display the same characteristic gradual decline of star density from a relatively dense core out to a diffuse periphery.
fr: Cette classe de galaxies est fondamentalement différente des galaxies elliptiques normales. Leur diamètre est d'un ordre de 1 à 10 kiloparsec, avec une luminosité de surface qui est bien plus basse que les galaxies elliptiques normales, ce qui leur donne une apparence bien plus diffuse. Elles possèdent les mêmes caractéristiques de déclin graduel de la densité des étoiles d'un centre relativement dense vers une périphérie diffuse.

source: Dwarf spheroidal galaxies (dSph's)
fr: Galaxies sphéroïdes naines (dSph)

source: Extreme low-luminosity, low surface-brightness and have only been observed in the vicinity of the Milky Way, and possibly other very nearby galaxy groups, such as the Leo group. Their absolute magnitudes are only -8 to -15 mag. The Draco dwarf spheroidal galaxy has an absolute magnitude of -8.6, making it fainter than the average globular cluster in the Milky Way!
fr: Luminosité extrêmement basse, luminosité de surface basse et observées seulement au voisinage de la Voie Lactée, et peut-être d'autres groupes de galaxies très voisins, comme le groupe du Lion. Leur magnitude absolue n'est que de 8 à 15 mag. La galaxie sphéroïde naine du Dragon a une magnitude absolue de 8,6, ce qui la rend plus pâle que l'amas globulaire moyen dans la Voie Lactée !

source: Blue compact dwarf galaxies (BCD's)
fr: Galaxies naines bleues denses (BCD)

source: Small galaxies that are unusually blue. Thehave photometric colors of B-V = 0.0 to 0.30 mag, which is typical for relatively young stars of <firstterm>spectral type</firstterm> A. This suggests that BCDs are currently actively forming stars. These systems also have abundant interstellar gas (unlike other Elliptical galaxies).
fr: Les petites galaxies sont rarement bleues. Elles ont des couleurs photométriques de B-V = 0,0 à 0,30 mag, ce qui est typique pour des étoiles relativement jeunes de <firstterm>type spectral</firstterm> A. Cela suggère qu'à l'intérieur des galaxies naines bleues denses, des étoiles sont actuellement en cours de formation. Ces systèmes ont aussi un abondant gaz interstellaire (contrairement aux autres galaxies elliptiques).

source: You can see examples of Elliptical galaxies in &kstars;, using the <guilabel>Find Object</guilabel> window (<keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>). Search for NGC 4881, which is the Giant cD galaxy in the Coma cluster of galaxies. M 86 is a normal Elliptical galaxy in the Virgo cluster of galaxies. M 32 is a dwarf Elliptical that is a satellite of our neighbor, the Andromeda galaxy (M 31). M 110 is another satellite of M 31 that is a borderline dwarf spheroidal galaxy (<quote>borderline</quote> because it is somewhat brighter than most other dwarf spheroidals).
fr: Vous pouvez voir des exemples de galaxies elliptiques dans &kstars; en utilisant la fenêtre de <guilabel>Trouver objet</guilabel> (<keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>). Cherchez NGC 4881, qui est la galaxie géante cD dans l'amas de galaxies Coma. M 86 est une galaxie elliptique normale dans l'amas de galaxies de la Vierge. M 32 est une naine elliptique qui est un satellite de sa voisine, la galaxie Andromède (M 31). M 110 est un autre satellite de M 31 qui est pratiquement une galaxie sphéroïde naine (<quote>pratiquement</quote> parce qu'elle est plus brillante que la plupart des autres naines sphéroïdales).
