Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_magnitude.po
Languages: fr

source: <title>Magnitude Scale</title>
fr: <title>Échelle de magnitude</title>

source: <primary>Magnitude Scale</primary>
fr: <primary>Échelle de magnitude</primary>

source: <seealso>Flux</seealso> <seealso>Star Colors and Temperatures</seealso>
fr: <seealso>Flux</seealso> <seealso>Couleurs et températures des étoiles</seealso>

source: 2500 years ago, the ancient Greek astronomer Hipparchus classified the brightnesses of visible stars in the sky on a scale from 1 to 6. He called the very brightest stars in the sky <quote>first magnitude</quote>, and the very faintest stars he could see <quote>sixth magnitude</quote>. Amazingly, two and a half millenia later, Hipparchus's classification scheme is still widely used by astronomers, although it has since been modernized and quantified.
fr: Il y a 2 500 ans, l'astronome grec Hipparque classifia la luminosité des étoiles visibles dans le ciel sur une échelle de 1 à 6. Il qualifia les étoiles les plus brillantes du ciel de <quote>première magnitude</quote> et les plus pâles de <quote>sixième magnitude</quote>. Étonnamment, deux millénaires et demi plus tard, la classification d'Hipparque est toujours largement utilisée par les astronomes, bien qu'elle ait été depuis modernisée et quantifiée.

source: The magnitude scale runs backwards to what you might expect: brighter stars have <emphasis>smaller</emphasis> magnitudes than fainter stars).
fr: L'échelle de magnitude fonctionne à l'envers de ce qu'on attend : les étoiles les plus brillantes ont une magnitude <emphasis>plus petite</emphasis> que les étoiles pâles.

source: The modern magnitude scale is a quantitative measurement of the <firstterm>flux</firstterm> of light coming from a star, with a logarithmic scaling:
fr: L'échelle moderne de magnitude est une mesure quantitative du <firstterm>flux</firstterm> de lumière venant d'une étoile, avec une échelle logarithmique :

source: If you do not understand the math, this just says that the magnitude of a given star (m) is different from that of some standard star (m<subscript>0</subscript>) by 2.5 times the logarithm of their flux ratio. The 2.5 *log factor means that if the flux ratio is 100, the difference in magnitudes is 5 mag. So, a 6th magnitude star is 100 times fainter than a 1st magnitude star. The reason Hipparchus's simple classification translates to a relatively complex function is that the human eye responds logarithmically to light.
fr: Si vous ne comprenez pas les mathématiques, cela dit juste que la magnitude d'une étoile donnée (m) est différente d'une étoile standard (m<subscript>0</subscript>) d'un facteur 2,5 fois le logarithme de leur rapport de flux. Le facteur 2,5*log signifie que si le rapport de flux est 100, la différence de magnitude vaut 5. Ainsi, une étoile de magnitude 6 est 100 fois plus pâle qu'une étoile de magnitude 1. La raison pour laquelle la simple classification d'Hipparque se traduit en une fonction relativement complexe est que l'œil humain réagit de manière logarithmique à la lumière.

source: There are several different magnitude scales in use, each of which serves a different purpose. The most common is the apparent magnitude scale; this is just the measure of how bright stars (and other objects) look to the human eye. The apparent magnitude scale defines the star Vega to have magnitude 0.0, and assigns magnitudes to all other objects using the above equation, and a measure of the flux ratio of each object to Vega.
fr: Il y a plusieurs échelles de magnitude différentes en usage, chacune d'entre elles ayant un but différent. La plus commune est l'échelle de magnitude apparente, qui mesure la manière dont les étoiles brillent (ainsi que les autres objets) pour l'œil humain. L'échelle de magnitude apparente définit l'étoile Vega comme magnitude 0,0 et attribue des magnitudes à tous les autres objets en utilisant l'équation ci-dessus, et une mesure du rapport de flux de chaque objet par rapport à Vega.

source: It is difficult to understand stars using just the apparent magnitudes. Imagine two stars in the sky with the same apparent magnitude, so they appear to be equally bright. You cannot know just by looking if the two have the same <emphasis>intrinsic</emphasis> brightness; it is possible that one star is intrinsically brighter, but further away. If we knew the distances to the stars (see the <link linkend="ai-parallax">parallax</link> article), we could account for their distances and assign <firstterm>Absolute magnitudes</firstterm> which would reflect their true, intrinsic brightness. The absolute magnitude is defined as the apparent magnitude the star would have if observed from a distance of 10 parsecs (1 parsec is 3.26 light-years, or 3.1 x 10<superscript>18</superscript> cm). The absolute magnitude (M) can be determined from the apparent magnitude (m) and the distance in parsecs (d) using the formula:
fr: Il est difficile de comprendre les étoiles en utilisant simplement les magnitudes apparentes. Imaginez deux étoiles dans le ciel avec la même magnitude apparente, c'est-à-dire apparemment de même luminosité. Vous ne pouvez pas savoir simplement en regardant si elles ont la même luminosité <emphasis>intrinsèque</emphasis> ; il est possible qu'une des deux étoiles soit bien plus brillante mais aussi bien plus lointaine. Si nous connaissions les distances aux étoiles (voyez l'article <link linkend="ai-parallax">parallaxe</link>), nous pourrions en tenir compte et attribuer des <firstterm>magnitudes absolues</firstterm> qui refléteraient la réalité de la luminosité intrinsèque. La magnitude absolue est définie comme la luminosité apparente que l'étoile aurait si elle était observée d'une distance de 10 parsecs (1 parsec = 3,26 années-lumière, soit 3,1 x 10<superscript>18</superscript> cm). La magnitude absolue (M) peut être déterminée à partir de la magnitude apparente (m) et de la distance en parsecs (d) en utilisant la formule :

source: M = m + 5 - 5 * log(d) (note that M=m when d=10).
fr: M = m + 5 - 5 * log(d) (notez que M=m quand d=10).

source: The modern magnitude scale is no longer based on the human eye; it is based on photographic plates and photoelectric photometers. With telescopes, we can see objects much fainter than Hipparchus could see with his unaided eyes, so the magnitude scale has been extended beyond 6th magnitude. In fact, the Hubble Space Telescope can image stars nearly as faint as 30th magnitude, which is one <emphasis>trillion</emphasis> times fainter than Vega.
fr: L'échelle moderne de magnitude n'est plus fondée sur l'œil humain, mais sur les plaques photographiques et les photomètres photoélectriques. Avec les télescopes, nous pouvons voir des objets bien plus pâles qu'Hipparque ne pouvait voir à l'œil nu, ainsi, l'échelle de magnitude a été étendue au-delà de 6. Ainsi le télescope spatial Hubble peut voir des images d'étoiles proches d'une magnitude 30 qui est un <emphasis>mille milliards</emphasis> de fois plus pâle que Vega.

source: A final note: the magnitude is usually measured through a color filter of some kind, and these magnitudes are denoted by a subscript describing the filter (&ie;, m<subscript>V</subscript> is the magnitude through a <quote>visual</quote> filter, which is greenish; m<subscript>B</subscript> is the magnitude through a blue filter; m<subscript>pg</subscript> is the photographic plate magnitude, &etc;).
fr: Note finale : la magnitude est habituellement mesurée à travers un filtre de couleur d'une certaine sorte et ces magnitudes sont notées avec un indice décrivant le filtre (c'est-à-dire que m<subscript>V</subscript> est la magnitude à travers un filtre <quote>visuel</quote>, qui est vert, m<subscript>B</subscript> est la magnitude à travers un filtre bleu, m<subscript>pg</subscript> est la magnitude de plaque photographique, &etc;).
