Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_fitsviewer.po
Languages: fr

source: Scale: Checking the Use Scale checkbox constrains the solver to use approximately the pixel or image scale given. The scale is entered in the box and the units for the scale can be chosen from image width in degrees, image width in arc-minutes, and arc-seconds per pixel. When a solve successfully completes, it replaces the value in the box with solution's scale.
fr: Échelle : la case à cocher Utiliser Échelle force le résolveur à utiliser approximativement l'échelle indiquée de l'image ou du pixel. Elle est saisie dans la boîte et ses unités sont soit des degrés, soit la largeur de l'image en minutes d'arc ou en secondes d'arc par pixel. Quand une résolution aboutit, la valeur dans la boîte est remplacée par l'échelle de la solution.

source: Position: Checking the Use Position checkbox constrains the solver to search near the RA and DEC coordinates given. The extent of the search is given by the user in the Radius box in degrees. Note that RA is input in hours-minutes-seconds, e.g. 13h, and DEC is input in degrees-minutes-seconds, e.g. 85. When a solve successfully completes, it replaces the value in the RA and DEC boxes with solution's coordinates. In addition it fills in the Angle field with the solutions angle value in degrees.
fr: Position : la case à cocher Utiliser Position force le résolveur à chercher près des coordonnées en AD et DEC données. L'étendue de la recherche est donnée par l'utilisateur dans la boîte Rayon, en degrés. Veuillez noter que l'AD doit être donnée en heures-minutes-secondes, par exemple 13h, et la DEC en degrés-minutes-secondes, par exemple 85. Quand une résolution aboutit, les valeurs de la boîte sont remplacées par les coordonnées de la solution. De plus, le champ Angle sera rempli par la solution de l'angle en degrés.

source: Use SkyMap Position: There is a button just below the Use Position checkbox that fills in RA and DEC boxes with the current center of the SkyMap display.
fr: Utiliser Position de la carte du ciel : ce bouton, situé juste sous la boîte Utiliser Position rempli les boîtes AD et DEC avec les coordonnées actuelles du centre de la carte du ciel.

source: Profile: The Profile menu selects which StellarSolver preset, among those used in the Ekos Align module, should be used for plate solving. This is further discussed below.
fr: Profil : le menu Profil permet de choisir un préréglage pour StellarSolver parmi ceux utilisés dans le module Alignement et qui sera utilisé pour la résolution. Ce point est discuté plus en détails ci-dessous.

source: Solution: The Solution section will display the number of stars found and the time taken to solve. The solution values for RA, DEC, Scale and Angle are displayed in those boxes above.
fr: Solution : la section Solution affiche le nombre d'étoiles trouvé et le temps pris pour la résolution. Les valeurs de la solution pour l'AD, la DEC, l'échelle et l'angle sont affichées dans les boîtes supérieurs.

source: Image: For any image where stars were detected, if the Mark Stars button is activated above the image display, then the detected stars are circled in red.
fr: Image : avec le bouton Marquer Étoile activé au-dessus de l'affichage de l'image, les étoiles détectées seront entourées de rouge.

source: <screeninfo>FITS Viewer Mark Stars Button</screeninfo>
fr: <screeninfo>Bouton de marquage d'étoiles de l'afficheur FITS</screeninfo>

source: <phrase>FITS Viewer Mark Stars Button</phrase>
fr: <phrase>Bouton de marquage d'étoiles de l'afficheur FITS</phrase>

source: Using this tool the user can try and debug solving issues as follows.
fr: Cet outil permet à l'utilisateur de corriger les erreurs de résolution.

source: He/she might have the KStars -> Settings -> Developer -> <link linkend="developer">Save Failed Align Images checkbox</link> enabled.
fr: La case à cocher KStars -> Réglages -> Développeur - <link linkend="developer">Enregistrer les images d'alignement en échec</link>.

source: Then a difficult image (for whom alignment failed) <link linkend="developer">could be located</link> and loaded into the fitsviewer.
fr: Une image difficile (dont l'alignement a échoué) <link linkend="developer">pourrait être retrouvée</link> et chargée dans l'afficheur FITS.

source: The image could be inspected to see if there were obvious visual issues.
fr: Cette image pourra être inspectée afin de déterminer s'il y existe des problèmes évidents.

source: Clicking Solve in this tool for that image would show how many stars were detected, and the user could then decide if it is a star detection issue and experiment with adjusting the profile or star-detection parameters.
fr: En cliquant sur Résoudre dans cet outil montrera le nombre d'étoiles détectées et l'utilisateur pourra ensuite décider si le problème se situe au niveau de la détection et essayer avec d'autres paramètres.

source: The user could manually upload the image to astrometry.net to get scale and position values (or just see if it is a problematic image).
fr: L'utilisateur pourrait également téléverser cette image sur le site astrometry.net pour obtenir l'échelle et la position (ou simplement voir si cette image est problématique).

source: The user could experiment with Use Position and Use Scale, using accurate values for those constraints (or disabling them) to see if those were the problem, or adjust the parameters in the align profile being used.
fr: Il pourrait modifier la valeur des paramètres Utiliser Position et Utiliser Échelle pour utiliser des valeurs très précises pour ces contraintes (ou simplement les désactiver) pour voir si ce sont ces valeurs qui posent problème ou les ajuster dans le profil d'alignement utilisé.

source: To inspect or modify the profile, the user would open the align tab in Ekos, go to the Options menu, select the StellarSolver Options tab, make sure the right Options profile is selected, and click the pencil to view or edit that profile.
fr: Pour inspecter ou modifier le profil, l'utilisateur se rendra sur l'onglet Alignement d'Ekos, et, dans le menu des options, sélectionnera les options pour StellarSolver, en faisant attention que les bonnes options du profil sont bien sélectionnées et cliquera sur le stylo pour l'afficher ou le modifier.

source: Embedded FITS Viewer
fr: Afficheur FITS intégré

source: <screeninfo>FITS Viewer embedded</screeninfo>
fr: <screeninfo>Afficheur FITS intégré</screeninfo>

source: <phrase>FITS Viewer embedded</phrase>
fr: <phrase>Afficheur FITS intégré</phrase>

source: In Ekos <link linkend="ekos-focus">Focus</link>, <link linkend="ekos-guide">Guide</link>, and <link linkend="ekos-align">Align</link> modules, captured images are displayed in the embedded FITS Viewer. The embedded viewer includes a <emphasis>floating bar</emphasis> that can be used to perform several functions:
fr: Dans les modules de <link linkend="ekos-focus">mise au point</link>, de <link linkend="ekos-guide">guidage</link> et d'<link linkend="ekos-align">alignement</link>, les images acquises sont affichées dans l'afficheur FITS intégré. Il inclut une <emphasis>barre flottante</emphasis> qui peut être utilisée pour effectuer plusieurs fonctions :

source: Zoom Out
fr: Zoom arrière

source: Zoom In
fr: Zoom avant

source: Default Zoom
fr: Zoom par défaut

source: Zoom To Fit
fr: Zoom pour ajuster

source: Toggle Cross Hairs
fr: Basculer le réticule

source: Toggle Pixel Gridlines
fr: Basculer la grille de pixel

source: Toggle Detected Stars: Highlight detected stars with red circles.
fr: Afficher les étoiles détectées : mise en valeur des étoiles détectées avec des cercles rouges.

source: Star Profile: View detailed 3D star profile.
fr: Profile d'étoile : affiche le profile 3D détaillé de l'étoile.

source: The floating bar is automatically hidden once the mouse leaves the embedded viewer area. You can use the mouse to pan and zoom just like the standalone FITS Viewer. The green tracking box can be used to select a specific star or region within the image, for example, to select a guide star.
fr: La barre flottante est automatiquement cachée dès que la souris quitte la zone de l'afficheur intégré. Vous pouvez utiliser la souris pour déplacer et zoomer comme avec l'afficheur FITS. La boîte de suivi verte peut être utilisée pour sélectionner une étoile particulière ou une région de l'image, par exemple pour choisir une étoile guide.

source: 3D Star Profile &amp; Data Visualization Tool
fr: Profil 3D de l'étoile &amp; outil d'affichage des données

source: <screeninfo>Star Profile main page</screeninfo>
fr: <screeninfo>Page principale du profil de l'étoile</screeninfo>

source: <phrase>Star Profile main page</phrase>
fr: <phrase>Page principale du profil de l'étoile</phrase>

source: The 3D data visualization tool can plot 3D graphs of the selected region of the image. This is particularly useful for astrophotographers who want to visualize the profile of a star they are considering focusing or guiding on. For scientists, it enables them to examine a cross-section of the data to understand the relative brightness of different objects in the image. Additionally, it empowers imagers who want to visually see what is going on in their data collection in a new way.
fr: L'outil d'affichage de données 3D peut tracer un graphique 3D d'une région sélectionnée de l'image. Cela est particulièrement utile pour les astrophotographes qui souhaite afficher le profil d'une étoile qu'ils envisagent d'utiliser comme étoile guide. Pour les scientifiques, cela leur permet d'étudier un échantillon des données pour comprendre la luminosité relative des différents objets de l'image. De plus, cela permet aux personnes qui souhaitent comprendre visuellement ce qui se passe dans leurs données d'une nouvelle manière.

source: To use the new feature, the user needs to select the <guiicon>View Star Profile</guiicon> icon in one of the Ekos Module Views, or in the FITS Viewer. Then, the region selected in the green tracking box will show up in the 3D graph as shown above. The user will then have one of the following toolbars at the bottom.
fr: Pour utiliser cette nouvelle fonctionnalité, l'utilisateur doit sélectionner l'icône <guiicon>Voir profil de l'étoile</guiicon> dans une des vues des modules Ekos ou directement dans l'afficheur FITS. Ensuite la région sélectionnée dans la boîte de suivi verte apparaîtra dans le graphe 3d comme montré ci-dessus. L'utilisateur aura ensuite une des barre suivantes d'outils en bas.

source: <screeninfo>Star Profile toolbar 1</screeninfo>
fr: <screeninfo>Barre d'outils du profil d'étoile 1</screeninfo>

source: <phrase>Star Profile toolbar 1</phrase>
fr: <phrase>Barre d'outils du profil d'étoile 1</phrase>

source: <screeninfo>Star Profile toolbar 2</screeninfo>
fr: <screeninfo>Barre d'outils du profil d'étoile 2</screeninfo>

source: <phrase>Star Profile toolbar 2</phrase>
fr: <phrase>Barre d'outils du profil d'étoile 2</phrase>

source: At the far left, the sample size combo box will let the user select the size of the image crop shown in the graph. This option is only available in the <guilabel>Summary Screen</guilabel>, the <link linkend="ekos-align">Align Module</link>, and the FITS Viewer. The second combo box lets the user control whether they are selecting an individual item, or a row, or a column of pixels. The slice button will be enabled if the user selects <guimenuitem>Row</guimenuitem> or <guimenuitem>Column</guimenuitem>. It will put the graph in slice mode so that the user can see a cross-section view of the image. Third, is a checkbox that will open up two sliders that will let the user drag the slider to change the selection. This is extremely useful in the slide mode to change the selected point and to move the cross section around the graph. It is also useful in the normal view when in <guilabel>Explore Mode</guilabel> so that the user can zoom around the image examining the pixels.
fr: Tout à gauche, la boîte d'échantillon permet à l'utilisateur de choisir la taille de l'image rognée affichée dans le graphe. Cette option n'est disponible que dans <guilabel>Écran résumé</guilabel>, le module <link linkend="ekos-align">Alignement</link> et l'afficheur FITS. La deuxième boîte permet à l'utilisateur de contrôler s'il souhaite un élément individuel, un rangée ou une colonne de pixels. Le bouton Tranche sera activé si l'utilisateur sélectionne <guimenuitem>Rangée</guimenuitem> ou <guimenuitem>Colonne</guimenuitem>. Cela mettra le graphe en mode Tranche pour permettre à l'utilisateur de voir une vue transversale de l'image. Troisièmement, il y a une case à cocher qui ouvrira deux curseurs qui permettent de changer de sélection. Cela est extrêmement utile pour changer de point sélectionné et se déplacer dans la coupe transversale autour du graphe. Cela est aussi utile dans l'affichage normal du <guilabel>Mode exploration</guilabel> pour zoomer dans l'image et examiner les pixels.

source: <screeninfo>Star Profile, examine pixels</screeninfo>
fr: <screeninfo>Profil d'étoile, examiner les pixels</screeninfo>

source: <phrase>Star Profile, examine pixels</phrase>
fr: <phrase> Profil d'étoile, examiner les pixels</phrase>

source: Then the user has the <guilabel>Zoom To</guilabel> combo box, which the user can use to zoom the graph to different preset locations. Next is the combo box that lets the user select the color scheme of the graph. Then are the HFR and the Peak checkboxes, which will both turn on the HFR and Peak labels on each found star in the image, but will also display one of them at the bottom of the screen. And finally comes the Scaling checkbox, which enables the <guilabel>Scaling</guilabel> Side Panel. There are three sliders in that panel, one to control the minimum value displayed on the graph or <quote>black point</quote>, one to control the maximum value displayed in the graph or the <quote>white point</quote>, and a third that is disabled by default that lets the user control the cutoff value for data displayed on the graph.
fr: Ensuite l'utilisateur a la boîte <guilabel>Zoomer vers</guilabel> qui permet de zoomer vers des endroits préréglés. Puis il y a la boîte de choix de la couleur du graphe. Ensuite, les cases à cocher pour activer les étiquettes pour l'HFR et le pic pour chaque étoile de l'image mais affichera aussi l'une d'entre elles au bas de l'écran. Et enfin il y a la case à cocher des échelles qui active le panneau latéral <guilabel>Échelles</guilabel>. Il y a trois curseurs dans ce panneau, un pour contrôle la valeur minimale affichée sur le graphe ou le <quote>point noir</quote>, un pour la valeur maximale affichée sur le graphe ou le <quote>point blanc</quote> et le troisième qui est désactivé par défaut et qui contrôle la valeur limite des données à afficher sur le graphe.

source: Star Profile vertical page
fr: Page vertical du profil de l'étoile

source: Star Profile vertical
fr: Vertical du profil de l'étoile

source: This third slider is very useful to get really big peaks out of the way so you can study the finer details in the image. There is a checkbox at the top to enable/disable the cutoff slider. And finally at the bottom of the sliders is the <guibutton>Auto scale</guibutton> button. This will auto scale the sliders as you sample different areas in the image. It will not only optimize the display of the data but will also affect the minimum and maximum points of the slider. If you disable auto scale, then as you sample different parts of the image, they will be displayed at the same scale. A particularly useful way to use this is to select an area of your image using auto scale, tweak the min, max, and cutoff sliders to your liking, and then turn off the auto scale feature to explore other areas of the graph.
fr: Ce troisième curseur est vraiment utile pour se débarrasser des gros pics afin d'étudier les détails de l'image. Il y a une case à cocher en haut pour activer ou désactiver le curseur de la limite. Et enfin, juste en dessous du curseur il y a le bouton <guibutton>Échelle automatique</guibutton>. Cela ajustera les curseurs alors que vous parcourez les différentes régions de l'image. Cela ne fera pas qu'optimiser l'affichage des données mais affectera aussi les points minimaux et maximaux du curseur. Si vous désactivez la mise à l'échelle automatique, alors toutes les parties de l'image seront affichées à la même échelle. Une manière particulièrement utile d'utiliser cette fonction est de choisir une partie de l'image avec la mise à l'échelle automatique activée, puis de fignoler les réglages des trois curseurs, et enfin de désactiver la mise à l'échelle automatique pour explorer les autres parties de l'image.

source: <screeninfo>Star Profile final page</screeninfo>
fr: <screeninfo>Page finale du profile de l'image</screeninfo>

source: <phrase>Star Profile final page</phrase>
fr: <phrase>Page finale du profil de l'étoile</phrase>
