Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_lightcurves.po
Languages: fr

source: AAVSO Light Curves
fr: Courbes de luminosité de l'AAVSO

source: Tools
fr: Outils

source: AAVSO Lightcurve Generator
fr: Générateur de courbes de luminosité de l'AAVSO

source: The AAVSO Lightcurves Tool
fr: L'outil de courbes de luminosité de l'AAVSO

source: AAVSO Lightcurves
fr: Courbes de luminosité de l'AAVSO

source: &kstars; can display light curves for variable stars from the observing program of the <ulink url="https://www.aavso.org">American Association of Variable Star Observers</ulink> (<abbrev>AAVSO</abbrev>). This program monitors over 6,000 variable stars and consists of 10 million observations going back almost a century. &kstars; downloads the very latest data directly from the <abbrev>AAVSO</abbrev> database via the Internet, so a network connection is required to use this tool.
fr: &kstars; peut afficher les courbes de luminosité des étoiles variables du programme d'observations de l'<ulink url="http://www.aavso.org">American Association of Variable Star Observers</ulink> (<abbrev>AAVSO</abbrev>). Ce programme surveille plus de 6 000 étoiles variables et consiste en 10 millions d'observations qui remontent à presque un siècle. &kstars; télécharge les toutes dernières données directement de la base de données de l'<abbrev>AAVSO</abbrev> par l'Internet, une connexion au réseau est donc nécessaire.

source: To use the tool, select a variable star either by <firstterm>designation</firstterm> or name in the left panel, and set the start and end dates to be plotted. In the right panel, select the type of data that should be plotted (see below). When you have made you selections, press the <guibutton>Retrieve Curve</guibutton> button. &kstars; will automatically connect to the AAVSO server, which will generate the lightcurve plot and send it to your computer for display. A sample lightcurve plot is shown below:
fr: Pour utiliser l'outil, sélectionnez une étoile variable, soit par sa <firstterm>désignation</firstterm>, soit par son nom dans le panneau de gauche, et déterminez les dates de début et de fin à tracer. Dans le panneau de droite, sélectionnez le type de données qui doit être tracé (voir ci-dessous). Quand vous avez fait vos sélections, actionnez le bouton <guibutton>Extraire la courbe</guibutton>. &kstars; se connectera automatiquement au serveur de l'AAVSO, qui générera une courbe de luminosité et l'enverra à votre ordinateur pour affichage. Un exemple de courbe de luminosité est affiché ci-dessous.

source: A Sample Lightcurve
fr: Exemple de courbe de luminosité

source: Sample Lightcurve
fr: Exemple de courbe de luminosité

source: Please not these light curves should <emphasis>NEVER</emphasis> be used in research, papers, presentations, publications, &etc; They are only meant to be used as a source of info for &kstars;. They have not been validated and passed the <abbrev>AAVSO</abbrev>'s strict quality control measures. We will be glad to give you good raw data simply by requesting it at <ulink url="http://www.aavso.org/adata/onlinedata/">http://www.aavso.org/adata/onlinedata/</ulink>.
fr: Veuillez noter que ces courbes ne doivent <emphasis>JAMAIS</emphasis> être utilisées pour la recherche, les articles, les présentations, les publications, &etc; Elles ne sont supposées qu'être une source d'informations pour &kstars;. Elles n'ont pas été validées et passées au contrôle de qualité des mesures de l'<abbrev>AAVSO</abbrev>. Nous serons heureux de vous donner de bonnes données brutes simplement en interrogeant <ulink url="http://www.aavso.org/adata/onlinedata/">http://www.aavso.org/adata/onlinedata/</ulink>.

source: Specific questions about the data in the light curves can be sent to <email>aavso@aavso.org</email>.
fr: Il est possible d'envoyer des questions sur les données dans les courbes de luminosité à <email>aavso@aavso.org</email>.

source: About Variable Stars
fr: À propos des étoiles variables

source: <firstterm>Variable stars</firstterm> are stars that change in brightness. A <firstterm>light curve</firstterm> is a plot of a variable star's brightness over time. By looking at a light curve you can see how the star has behaved in the past and try to predict how it will behave in the future. Astronomers also use this data to model astrophysical processes in the star. This important to help us understand how stars work.
fr: Les <firstterm>étoiles variables</firstterm> sont des étoiles qui changent de luminosité. Une <firstterm>courbe de luminosité</firstterm> est un graphique de la luminosité de l'étoile variable en fonction du temps. En regardant la courbe de luminosité, vous pouvez voir comment l'étoile s'est comportée dans le passé et essayer de prédire comment elle sera dans l'avenir. Les astronomes utilisent aussi ces données pour modéliser les processus d'astrophysique dans l'étoile. C'est important pour nous aider à comprendre comment les étoiles fonctionnent.

source: The Data
fr: Les données

source: Here is a summary of the various types of data available in the light curves:
fr: Voilà un résumé des différents types de données disponibles dans les courbes de luminosité :

source: <firstterm>Visual Observation</firstterm>: This is an observation of a variable star by an observer with a regular telescope. It means that an observer saw the star at Y brightness on X date and time.
fr: <firstterm>Visuel</firstterm> : c'est une observation d'une étoile variable par un observateur équipé d'un télescope ordinaire. Cela signifie qu'un observateur a vu l'étoile à la luminosité Y aux date et heure X.

source: <firstterm>Fainter than</firstterm>: Sometimes the star is too faint to be seen by the observer. When that happens, the observer reports the faintest star seen in the field. These are called <quote>fainter thans</quote> because the variable star was fainter than the brightness reported.
fr: <firstterm>Plus faible que</firstterm> : quelquefois, l'étoile est trop faible pour être vue par l'observateur. Lorsque cela arrive, l'observateur rapporte l'étoile la plus faible vue dans le champ. Elles sont nommées <quote>plus faibles que</quote> car l'étoile variable était plus faible que la luminosité rapportée.

source: <firstterm>Average</firstterm>: This is a computed running average of all the data reported. The <firstterm>bin</firstterm> number tells the computer how many days to use in each average calculation. This will need to be adjusted based on the frequency of observations. The error bars represent the 1 sigma standard deviation of error.
fr: <firstterm>Moyenne sur</firstterm> : c'est une moyenne calculée de toutes les données rapportées. Le nombre <firstterm>bin</firstterm> dit à l'ordinateur combien de jours utiliser dans chaque calcul de moyenne. C'est nécessaire pour l'ajuster en fonction de la fréquence des observations. Les barres d'erreur représentent la déviation standard à un sigma d'erreur.

source: <firstterm>CCDV</firstterm>: These are observations reported using a <abbrev>CCD</abbrev> with a Johnson <abbrev>V</abbrev> filter. <abbrev>CCDV</abbrev> observations tend to be more accurate than visual (but not always).
fr: <firstterm>CCDV</firstterm> : ce sont les observations rapportées en utilisant un <abbrev>CCD</abbrev> avec un filtre <abbrev>V</abbrev> Johnson. Les observations <abbrev>CCDV</abbrev> tendent à être plus précises que les visuelles (mais pas toujours).

source: <firstterm>CCDB</firstterm>: <abbrev>CCD</abbrev> observations with a Johnson <abbrev>B</abbrev> filter.
fr: <firstterm>CCDB</firstterm> : observations <abbrev>CCD</abbrev> avec un filtre <abbrev>B</abbrev> Johnson.

source: <firstterm>CCDI</firstterm>: <abbrev>CCD</abbrev> observations with a Cousins <abbrev>Ic</abbrev> filter.
fr: <firstterm>CCDI</firstterm> : observations <abbrev>CCD</abbrev> avec un filtre <abbrev>IC</abbrev> Cousins.

source: <firstterm>CCDR</firstterm>: <abbrev>CCD</abbrev> observations with a Cousins <abbrev>R</abbrev> filter.
fr: <firstterm>CCDR</firstterm> : observations <abbrev>CCD</abbrev> avec un filtre <abbrev>R</abbrev> Cousins.

source: <firstterm>Discrepant Data</firstterm>: This is data that has been flagged by an <abbrev>AAVSO</abbrev> staff member as being discrepant following <abbrev>HQ</abbrev> rules for data validation. Contact <email>aavso@aavso.org</email> for more information.
fr: <firstterm>Autres données</firstterm> : ce sont les données qui ont été validées par un membre de l'équipe de l'<abbrev>AAVSO</abbrev> comme autres, en suivant les règles de validation de données <abbrev>HQ</abbrev>. Contactez <email>aavso@aavso.org</email> pour d'autres informations.

source: <firstterm>Dates</firstterm>: The observational database the light curves are based on is updated every 10 minutes so you can get data in near real-time. Right now light curve data is only available back to 1961, but this will likely be expanded further back in time in the future.
fr: <firstterm>Dates</firstterm> : la base de données d'observations sur laquelle les courbes sont basées est mise à jour toutes les 10 minutes, de telle manière que vous puissiez obtenir des données quasiment en temps réel. Pour le moment, les courbes de luminosité ne sont disponibles qu'à partir de 1961, mais cela sera vraisemblablement augmenté à l'avenir.

source: Updating your local copy of Variable Stars
fr: Mise à jour de votre copie locale des étoiles variables

source: The <abbrev>AAVSO</abbrev> publishes the <ulink url="http://www.aavso.org/valnam.txt">full list of variable stars</ulink> in their monitoring program. This file is updated monthly with newly discovered variable stars. To sync the list that &kstars; uses with the <abbrev>AAVSO</abbrev> master list, click on the <guibutton>Update List</guibutton> button in the <abbrev>AAVSO</abbrev> dialog. &kstars; will then attempt to connect to the <abbrev>AAVSO</abbrev> database and download the latest list.
fr: L'<abbrev>AAVSO</abbrev> publie la <ulink url="http://www.aavso.org/valnam.txt">liste complète des étoiles variables</ulink> dans son programme de surveillance. Ce fichier est mis jour tous les mois avec les étoiles nouvellement découvertes. Pour synchroniser la liste utilisée par &kstars; avec la liste principale de l'<abbrev>AAVSO</abbrev>, cliquez sur le bouton <guibutton>Rafraîchir la liste</guibutton> dans la boîte de dialogue <abbrev>AAVSO</abbrev>. &kstars; tentera une connexion à la base de données de l'<abbrev>AAVSO</abbrev> et téléchargera la dernière liste.

source: The customized data stream provided by the AAVSO was implemented for &kstars; by Aaron Price. Thank you, Aaron!
fr: Le flux de données personnalisées fournies par l'AAVSO a été introduit dans &kstars; par Aaron Price, à qui l'on doit un grand merci.
