Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_geocoords.po
Languages: fr

source: Geographic Coordinates
fr: Coordonnées géographiques

source: <primary>Geographic Coordinate System</primary>
fr: <primary>Système de coordonnées géographiques</primary>

source: <see>Geographic Coordinate System</see>
fr: <see>Système de coordonnées géographiques</see>

source: Locations on Earth can be specified using a spherical coordinate system. The geographic (<quote>earth-mapping</quote>) coordinate system is aligned with the spin axis of the Earth. It defines two angles measured from the center of the Earth. One angle, called the <firstterm>Latitude</firstterm>, measures the angle between any point and the Equator. The other angle, called the <firstterm>Longitude</firstterm>, measures the angle <emphasis>along</emphasis> the Equator from an arbitrary point on the Earth (Greenwich, England is the accepted zero-longitude point in most modern societies).
fr: Une position sur Terre peut être spécifiée à l'aide d'un système de coordonnées sphériques. Le système de coordonnées géographiques (<foreignphrase>earth-mapping</foreignphrase>) est aligné avec l'axe de rotation de la Terre. Il utilise deux angles mesurés à partir du centre de la Terre. Le premier angle, appelé <firstterm>latitude</firstterm>, est l'angle entre un endroit sur Terre et l'équateur. Le deuxième angle, qu'on appelle la <firstterm>longitude</firstterm>, mesure l'angle <emphasis>le long</emphasis> de l'équateur à partir d'un point sur Terre (Greenwich en Angleterre possède une longitude de zéro degré dans la plupart des sociétés modernes).

source: By combining these two angles, any location on Earth can be specified. For example, Baltimore, Maryland (USA) has a latitude of 39.3 degrees North, and a longitude of 76.6 degrees West. So, a vector drawn from the center of the Earth to a point 39.3 degrees above the Equator and 76.6 degrees west of Greenwich, England will pass through Baltimore.
fr: En combinant ces deux angles, on peut spécifier tout endroit sur Terre. Par exemple, Baltimore dans le Mariland (USA) possède une latitude de 39,3 degrés nord et une longitude de 76,6 degrés ouest. En d'autres mots, si l'on dessine une ligne entre le centre de la Terre et un point qui se trouve à 39,3 degrés au-dessus de l'équateur et à 76,6 degrés à l'ouest de Greenwich, alors elle passera à travers Baltimore.

source: The Equator is obviously an important part of this coordinate system; it represents the <emphasis>zeropoint</emphasis> of the latitude angle, and the halfway point between the poles. The Equator is the <firstterm>Fundamental Plane</firstterm> of the geographic coordinate system. <link linkend="ai-skycoords">All Spherical Coordinate Systems</link> define such a Fundamental Plane.
fr: L'équateur est important pour le système de coordonnées géographiques. Il représente le <emphasis>point zéro</emphasis> de l'angle de latitude, et le point milieu entre les pôles. L'équateur est le <firstterm>plan fondamental</firstterm> du système de coordonnées géographiques. <link linkend="ai-skycoords">Tous les systèmes de coordonnées sphériques</link> utilisent un plan fondamental.

source: Lines of constant Latitude are called <firstterm>Parallels</firstterm>. They trace circles on the surface of the Earth, but the only parallel that is a <link linkend="ai-greatcircle">Great Circle</link> is the Equator (Latitude=0 degrees). Lines of constant Longitude are called <firstterm>Meridians</firstterm>. The Meridian passing through Greenwich is the <firstterm>Prime Meridian</firstterm> (longitude=0 degrees). Unlike Parallels, all Meridians are great circles, and Meridians are not parallel: they intersect at the north and south poles.
fr: Les lignes possédant la même latitude sont appelées les <firstterm>parallèles</firstterm>. Les parallèles tracent des cercles sur la surface de la Terre, mais un seul parallèle, l'équateur (latitude de 0 degrés), est un <link linkend="ai-greatcircle">grand cercle</link>. Les lignes possédant la même longitude sont appelées les <firstterm>méridiens</firstterm>. Le méridien qui passe par Greenwich est le <firstterm>méridien principal</firstterm> (longitude de 0 degré). Contrairement aux parallèles, les méridiens sont tous des grands cercles, et les méridiens ne sont pas parallèles entre eux : ils se rejoignent tous au pôle Nord et au pôle Sud.

source: Exercise:
fr: Exercice

source: What is the longitude of the North Pole? Its latitude is 90 degrees North.
fr: Quelle est la longitude du pôle Nord ? Sa latitude est de 90 degrés nord.

source: This is a trick question. The Longitude is meaningless at the north pole (and the south pole too). It has all longitudes at the same time.
fr: C'est une question piège. Le longitude n'a aucune signification au Pôle Nord (ou au Pôle Sud). Il possède toutes les longitudes à la fois.
