Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_scriptbuilder.po
Languages: fr

source: <title>The Script Builder Tool</title>
fr: <title>L'outil de construction de scripts</title>

source: Tools
fr: Outils

source: Script Builder
fr: Construction de scripts

source: &kde; applications can be controlled externally from another program, from a console prompt, or from a shell script using the Inter-process communication protocol (&DBus;). &kstars; takes advantage of this feature to allow rather complex behaviors to be scripted and played back at any time. This can be used, for example, to create a classroom demo to illustrate an astronomical concept.
fr: Les applications &kstars; peuvent être pilotées de l'extérieur par un autre programme, depuis une invite de console ou depuis un script shell en utilisant le protocole de communication interprocessus (&DBus;). &kstars; utilise cette fonction pour permettre à des comportements plutôt complexes d'être traités par scripts et rejoués à n'importe quel moment. Ceci peut être utilisé par exemple pour créer une démonstration en salle de classe pour illustrer un concept astronomique.

source: The problem with &DBus; scripts is, writing them is a bit like programming, and can seem a daunting task to those who do not have programming experience. The Script Builder Tool provides a <abbrev>GUI</abbrev> point-and-click interface for constructing &kstars; &DBus; scripts, making it very easy to create complex scripts.
fr: Le problème avec les scripts &DBus; est que leur écriture ressemble à de la programmation et peut sembler difficile à ceux qui n'ont pas l'expérience de la programmation. L'outil de génération de scripts fournit une interface graphique de type pointer-cliquer pour construire des scripts &DBus; pour &kstars;, rendant très facile l'écriture de scripts complexes.

source: Introduction to the Script Builder
fr: Introduction au constructeur de scripts

source: Before explaining how to use the Script Builder, I provide a very brief introduction to all of the <abbrev>GUI</abbrev> components; for more infomation, use the "What's This?" function.
fr: Avant d'expliquer comment utiliser le générateur de scripts, voici une très brève introduction de tous les composants d'interface graphique ; pour plus d'informations, utilisez la fonction <quote>Qu'est-ce que c'est ?</quote> du menu <quote>Aide</quote>.

source: <screeninfo>The Script Builder Tool</screeninfo>
fr: <screeninfo>L'outil de construction de scripts</screeninfo>

source: Script Builder Tool
fr: Outil de construction de scripts

source: The Script Builder is shown in the above screenshot. The box on the left is the <firstterm>Current Script box</firstterm>; it shows the list of commands that comprise the current working script. The box on the right is the <firstterm>Function Browser</firstterm>; it displays the list of all available script functions. Below the Function Browser, there is a small panel which will display short documentation about the script function highlighted in the Function Browser. The panel below the Current Script box is the <firstterm>Function Arguments panel</firstterm>; when a function is highlighted in the Current Script box, this panel will contain items for specifying values for any arguments that the highlighted function requires.
fr: Le constructeur de scripts est visible dans la capture d'écran ci-dessus. La zone à gauche est la zone de <firstterm>script actuel</firstterm> ; elle affiche la liste des commandes que comprend le script actuellement en fonctionnement. La zone à droite est le <firstterm>navigateur de fonctions</firstterm> ; il affiche la liste de toutes les fonctions de script disponibles. Sous le navigateur de fonctions se trouve un petit panneau qui affiche une courte documentation sur la fonction de script surlignée dans le navigateur de fonction. Le panneau sous la zone de script courante est le panneau des <firstterm>paramètres de fonctions</firstterm> ; quand une fonction est surlignée dans la zone de script courant, ce panneau contient des éléments pour spécifier les valeurs pour n'importe quel argument que la fonction surlignée nécessite.

source: Along the top of the window, there is a row of buttons which operate on the script as a whole. From left to right, they are: <guibutton>New Script</guibutton>, <guibutton>Open Script...</guibutton>, <guibutton>Save Script</guibutton>, <guibutton>Save Script As...</guibutton>, and <guibutton>Test Script</guibutton>. The function of these buttons should be obvious, except perhaps the last button. Pressing <guibutton>Test Script</guibutton> will attempt to run the current script in the main &kstars; window. You should move the Script Builder window out of the way before pressing this, so you can see the results.
fr: Le long du haut de la fenêtre, il y a une rangée de boutons qui opèrent sur le script comme un tout. De la gauche vers la droite, il y a : <guibutton>Nouveau script</guibutton>, <guibutton>Ouvrir un script…</guibutton>, <guibutton>Enregistrer le script</guibutton>, <guibutton>Enregistrer le script sous…</guibutton> et <guibutton>Tester le script</guibutton>. La fonction de ces boutons devrait être évidente, sauf peut-être le dernier bouton. En actionnant <guibutton>Tester le script</guibutton>, vous tenterez de lancer le script courant dans la fenêtre principale de &kstars;. Vous devriez déplacer la fenêtre de générateur de script hors de l'emplacement avant d'actionner cela, et ainsi, vous pourrez voir le résultat.

source: In the center of the window, there is a column of buttons which operate on individual script functions. From top to bottom, they are: <guibutton>Add Function</guibutton>, <guibutton>Remove Function</guibutton>, <guibutton>Copy Function</guibutton>, <guibutton>Move Up</guibutton>, and <guibutton>Move Down</guibutton>. <guibutton>Add Function</guibutton> adds the currently-highlighted function in the Function Browser to the Current Script box (you can also add a function by double-clicking on it). The rest of the buttons operate on the function highlighted in the Current Script box, either removing it, duplicating it, or changing its position in the current script.
fr: Au centre de la fenêtre se trouve une colonne de boutons qui opèrent sur une fonction individuelle du script. De haut en bas, ce sont : <guibutton>Ajouter la fonction</guibutton>, <guibutton>Supprimer la fonction</guibutton>, <guibutton>Copier la fonction</guibutton>, <guibutton>Monter</guibutton> et <guibutton>Descendre</guibutton>. <guibutton>Ajouter la fonction</guibutton> ajoute la fonction actuellement sélectionnée dans le navigateur de fonctions à la zone de script courant (vous pouvez aussi ajouter une fonction en double-cliquant dessus). Le reste des boutons opère sur la fonction surlignée dans la zone de script courant, soit en l'enlevant, soit en la dupliquant, soit en changeant sa position dans le script courant.

source: Using the Script Builder
fr: Utilisation du constructeur de scripts

source: In order to illustrate using the Script Builder, we present a small tutorial example where we make a script that tracks the Moon while the clock runs at an accelerated rate.
fr: Pour illustrer l'utilisation du constructeur de scripts, nous présentons un petit tutoriel où nous faisons un script qui suit la Lune, alors que l'horloge fonctionne à une vitesse accélérée.

source: If we are going to track the Moon, we will need to point the display at it first. The <firstterm>lookToward</firstterm> function is used to do this. Highlight this function in the Function Browser, and note the documentation displayed in the panel below the Browser. Press the <guibutton>Add Function</guibutton> button to add this function to the Current Script box. The Function Arguments panel will now contain a combobox labeled <quote>Dir</quote>, short for direction. This is the direction in which the display should be pointed. The combobox contains only the cardinal compass points, not the Moon or any other objects. You can either enter <quote>Moon</quote> in the box manually, or press the <guibutton>Object...</guibutton> button to use the <guilabel>Find Object...</guilabel> window to select the Moon from the list of named objects. Note that, as usual, centering on an object automatically engages object-tracking mode, so there is no need to add the <firstterm>setTracking</firstterm> function after lookToward.
fr: Si nous voulons suivre la Lune, nous aurons besoin de pointer l'affichage dessus d'abord. La fonction <firstterm>lookToward</firstterm> est utilisée pour faire cela. Surlignez cette fonction dans le navigateur de fonctions et notez la documentation affichée dans le panneau au-dessous. Actionnez le bouton <guibutton>Ajouter une fonction</guibutton> pour ajouter cette fonction à la zone de script courante. Le panneau des paramètres de fonctions comportera maintenant une liste combinée libellée <quote>Dir</quote>, abréviation de direction. C'est la direction dans laquelle l'affichage doit être pointé. La liste combinée ne contient que les points cardinaux, pas la Lune ni d'autres objets. Vous pouvez soit écrire <quote>Lune</quote> dans la zone à la main, soit actionner le bouton <guibutton>Objet…</guibutton> pour utiliser la fenêtre de <guilabel>recherche d'objet</guilabel> pour sélectionner la Lune dans la liste des objets nommés. Notez que, comme d'habitude, un centrage sur un objet engage automatiquement le mode de suivi, de telle manière qu'il n'y a pas besoin d'ajouter la fonction <firstterm>setTracking</firstterm> après lookToward.

source: Now that we have taken care of pointing at the Moon, we next want to make time pass at an accelerated rate. Use the <firstterm>setClockScale</firstterm> function for this. Add it to the script by double-clicking on it in the Function Browser. The Function Arguments panel contains a timestep spinbox for setting the desired time step for the simulation clock. Change the timestep to 3 hours.
fr: Maintenant que nous avons pris soin de pointer la Lune, nous voulons ensuite faire passer le temps en accéléré. Utilisez la fonction <firstterm>setClockScale</firstterm> pour cela. Ajoutez-la au script en double-cliquant dessus dans le navigateur de fonctions. Le panneau des paramètres de fonctions contient un compteur de pas du temps pour régler le pas désiré pour l'horloge de simulation. Changez le pas sur 3 heures.

source: OK, we have pointed at the Moon and accelerated the clock. Now we just want the script to wait for several seconds while the display tracks on the Moon. Add the <firstterm>waitFor</firstterm> function to the script, and use the Function Arguments panel to specify that it should wait for 20 seconds before continuing.
fr: Bien. Nous avons pointé la Lune et accéléré l'horloge. Maintenant, nous voulons simplement que le script attende plusieurs secondes pendant que l'affichage suit la Lune. Ajoutez la fonction <firstterm>waitFor</firstterm> au script et utilisez le panneau des paramètres de fonctions pour spécifier qu'il devrait attendre 20 secondes avant de continuer.

source: To finish up, let us reset the clock's timestep to the normal value of 1 second. Add another instance of setClockScale, and set its value to 1 sec.
fr: Pour finir, réinitialisons le pas d'horloge à la valeur normale d'une seconde. Ajoutez une autre instance de setClockScale et positionnez sa valeur sur 1 sec.

source: Actually, we are not quite done yet. We should probably make sure that the display is using Equatorial coordinates before the script tracks the Moon with an accelerated time step. Otherwise, if the display is using Horizontal coordinates, it will rotate very quickly through large angles as the Moon rises and sets. This can be very confusing, and is avoided by setting the View Option <firstterm>UseAltAz</firstterm> to <quote>false</quote>. To change any View Option, use the <firstterm>changeViewOption</firstterm> function. Add this function to the script, and examine the Function Arguments panel. There is a combobox which contains the list of all options which can be adjusted by changeViewOption. Since we know we want the UseAltAz option, we could simply select it from the combobox. However, the list is quite long, and there is no explanation of what each item is for. It therefore may be easier to press the <guibutton>Browse Tree...</guibutton> button, which will open a window containing a tree view of the available options, organized by topic. In addition, each item has a short explanation of what the option does, and the data type of the option's value. We find UseAltAz under the <guilabel>Skymap Options</guilabel> category. Just highlight this item and press <guibutton>OK</guibutton>, and it will be selected in the combobox of the Function Arguments panel. Finally, make its value <quote>false</quote> or <quote>0</quote>.
fr: En fait, tout n'est pas fini. Nous devons probablement nous assurer que l'affichage utilise les coordonnées équatoriales avant que le script ne suive la Lune avec le pas accéléré. Sinon, si l'affichage utilise les coordonnées horizontales, il tournera très vite sur de grands angles au lever et au coucher de la Lune. Cela peut être troublant, et on l'évite en réglant l'option d'affichage <firstterm>UseAltAz</firstterm> sur <quote>false</quote>. Pour changer une option d'affichage, utilisez la fonction <firstterm>changeViewOption</firstterm>. Ajoutez cette fonction au script et examinez le panneau des paramètres de fonctions. Il y a une liste combinée qui contient la liste de toutes les options d'affichage qui peuvent être ajustées par changeViewOption. Comme nous savons que nous voulons l'option UseAltAz, nous pouvons simplement la sélectionner dans la liste combinée. Cependant, la liste est assez longue, et il n'y a pas d'explication sur l'utilisation de chaque élément. Pour cela, il peut être plus facile d'actionner le bouton <guibutton>Parcourir l'arborescence…</guibutton>, qui ouvrira une fenêtre contenant une vue arborescente des options disponibles, organisées par sujet. De plus, chaque élément dispose d'une courte explication sur ce que fait l'option, et le type de donnée de valeur de l'option. Nous trouvons UseAltAz sous la catégorie <guilabel>Options de carte du ciel</guilabel>. Surlignez simplement cet élément et actionnez <guibutton>Ok</guibutton> et elle sera sélectionnée dans la liste combinée du panneau des paramètres de fonctions. Enfin, rendez sa valeur <quote>false</quote> ou <quote>0</quote>.

source: One more step: changing UseAltAz at the end of the script does us no good; we need this to be changed before anything else happens. So, make sure this function is highlighted in the Current Script box, and press the <guibutton>Move Up</guibutton> button until it is the first function.
fr: Une dernière étape : le changement d'UseALtAz à la fin du script n'est pas bon ; nous avons besoin de le changer avant que quelque chose d'autre n'arrive. Ainsi, assurez-vous que cette fonction est surlignée dans la zone de script courant et actionnez le bouton <guibutton>Monter</guibutton> jusqu'à ce que ce soit la première fonction.

source: Now that we have finished the script, we should save it to disk. Press the <guibutton>Save Script</guibutton> button. This will first open a window in which you can provide a name for the script, and fill in your name as the author. Enter <quote>Tracking the Moon</quote> for a name, and your name as the author, and press <guibutton>OK</guibutton>. Next, you will see the standard &kde; Save File dialog. Specify a filename for the script and press <guibutton>OK</guibutton> to save the script. Note that if your filename does not end with <quote>.kstars</quote>, this suffix will be automatically attached. If you are curious, you can examine the script file with any text editor.
fr: Maintenant que nous avons fini le script, nous devrions l'enregistrer sur le disque. Actionnez le bouton <guibutton>Enregistrer le script</guibutton>. Cela ouvrira d'abord une fenêtre dans laquelle vous pouvez fournir un nom pour le script et saisir votre nom comme auteur. Écrivez <quote>Suivi de la Lune</quote> comme nom, et votre nom comme auteur et actionnez le bouton <guibutton>Ok</guibutton>. Ensuite, vous verrez la boîte de dialogue standard de &kde; d'enregistrement des fichiers. Donnez un nom de fichier pour le script et actionnez <guibutton>Ok</guibutton> pour enregistrer le script. Notez que si votre nom de fichier ne se termine pas par <quote>.kstars</quote>, ce suffixe sera automatiquement ajouté. Si vous êtes curieux, vous pouvez examiner le fichier de script avec un éditeur de texte.

source: Now that we have a completed script, we can run it in a couple of ways. From a console prompt, you can simply execute the script as long as an instance of &kstars; is currently running. Alternatively, you can execute the script from within &kstars; using the <menuchoice><guimenu>File</guimenu> <guimenuitem>Run Script...</guimenuitem></menuchoice> menu item.
fr: Maintenant que nous avons un script terminé, nous pouvons le lancer de plusieurs manières. De l'invite d'une console, vous pouvez simplement exécuter le script tant qu'une instance de &kstars; est en fonctionnement. Vous pouvez également exécuter le script depuis &kstars; en utilisant l'élément <menuchoice><guimenu>Fichier</guimenu> <guimenuitem>Exécuter un script…</guimenuitem></menuchoice>.
