Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_colorandtemp.po
Languages: fr

source: <title>Star Colors and Temperatures</title>
fr: <title>Couleurs et températures des étoiles</title>

source: <primary>Star Colors and Temperatures</primary>
fr: <primary>Couleurs et températures des étoiles</primary>

source: <seealso>Blackbody Radiation</seealso> <seealso>Magnitude Scale</seealso>
fr: <seealso>Radiation du corps noir</seealso> <seealso>Échelle de magnitude</seealso>

source: Stars appear to be exclusively white at first glance. But if we look carefully, we can notice a range of colors: blue, white, red, and even gold. In the winter constellation of Orion, a beautiful contrast is seen between the red Betelgeuse at Orion's "armpit" and the blue Bellatrix at the shoulder. What causes stars to exhibit different colors remained a mystery until two centuries ago, when Physicists gained enough understanding of the nature of light and the properties of matter at immensely high temperatures.
fr: Les étoiles apparaissent être exclusivement blanches au premier coup d'œil. Mais si nous regardons attentivement, nous pouvons noter une plage de couleurs : bleu, blanc, rouge et même doré. Dans la constellation d'hiver d'Orion, un beau contraste se voit entre la rouge Betelgeuse au coude d'Orion et la bleue Bellatrix à l'épaule. Ce qui fait que les étoiles montrent différentes couleurs resta longtemps un mystère jusqu'à il y a deux siècles, quand les physiciens eurent suffisamment de compréhension de la nature de la lumière et des propriétés de la matière aux très hautes températures.

source: Specifically, it was the physics of <link linkend="ai-blackbody">blackbody radiation</link> that enabled us to understand the variation of stellar colors. Shortly after blackbody radiation was understood, it was noticed that the spectra of stars look extremely similar to blackbody radiation curves of various temperatures, ranging from a few thousand Kelvin to ~50,000 Kelvin. The obvious conclusion is that stars are similar to blackbodies, and that the color variation of stars is a direct consequence of their surface temperatures.
fr: Spécifiquement, c'était la physique du <link linkend="ai-blackbody">rayonnement du corps noir</link> qui nous a permis de comprendre les variations de couleur des étoiles. Peu de temps après que le rayonnement du corps noir ait été comprise, on a remarqué que le spectre des étoiles était très semblable aux courbes de radiations du corps noir des différentes températures, allant de quelques milliers de Kelvin à environ 50 000 Kelvin. La conclusion évidente était que les étoiles étaient semblables à des corps noirs, et que les variations de couleur des étoiles était une conséquence directe de leur température de surface.

source: Cool stars (i.e., Spectral Type K and M) radiate most of their energy in the red and infrared region of the electromagnetic spectrum and thus appear red, while hot stars (i.e., Spectral Type O and B) emit mostly at blue and ultra-violet wavelengths, making them appear blue or white.
fr: Les étoiles froides (c'est-à-dire de types spectraux K et M) rayonnent le plus gros de leur énergie dans les régions rouges et infrarouges du spectre électromagnétique et ainsi apparaissent rouges, alors que les étoiles chaudes (c'est-à-dire de types spectraux O et B) émettent surtout dans les longueurs d'onde bleues et violettes, les faisant apparaître bleues ou blanches.

source: To estimate the surface temperature of a star, we can use the known relationship between the temperature of a blackbody, and the wavelength of light where its spectrum peaks. That is, as you increase the temperature of a blackbody, the peak of its spectrum moves to shorter (bluer) wavelengths of light. This is illustrated in Figure 1 where the intensity of three hypothetical stars is plotted against wavelength. The "rainbow" indicates the range of wavelengths that are visible to the human eye.
fr: Pour estimer la température de surface d'une étoile, nous pouvons utiliser la relation connue entre la température du corps noir et la longueur d'onde de la lumière dans les pics spectraux. C'est-à-dire que lorsque vous augmentez la température d'un corps noir, le pic de son spectre se déplace vers les longueurs d'onde (plus courtes) bleues de la lumière. Cela est illustré dans la figure 1 où l'intensité de trois étoiles hypothétiques est reliée aux longueurs d'onde. L'arc-en-ciel indique la zone de longueur d'onde qui est visible pour l'œil humain.

source: This simple method is conceptually correct, but it cannot be used to obtain stellar temperatures accurately, because stars are <emphasis>not</emphasis> perfect blackbodies. The presence of various elements in the star's atmosphere will cause certain wavelengths of light to be absorbed. Because these absorption lines are not uniformly distributed over the spectrum, they can skew the position of the spectral peak. Moreover, obtaining a usable spectrum of a star is a time-intensive process and is prohibitively inefficient for large samples of stars.
fr: Cette méthode simple est correcte en théorie mais il est impossible de l'utiliser pour obtenir la température des étoiles avec précision, car les étoiles <emphasis>ne</emphasis> sont <emphasis>pas</emphasis> de parfaits corps noirs. La présence d'éléments variés dans l'atmosphère de l'étoile fera que certaines longueurs d'onde de lumière seront absorbées. Du fait que ces lignes d'absorption ne sont pas uniformément distribuées dans le spectre, elles peuvent fausser la position du pic spectral. De plus, l'obtention d'un spectre utilisable d'une étoile est un processus qui prend du temps et est trop inefficace pour un grand échantillon d'étoiles.

source: An alternative method utilizes photometry to measure the intensity of light passing through different filters. Each filter allows <emphasis>only</emphasis> a specific part of the spectrum of light to pass through while rejecting all others. A widely used photometric system is called the <firstterm>Johnson UBV system</firstterm>. It employs three bandpass filters: U ("Ultra-violet"), B ("Blue"), and V ("Visible"); each occupying different regions of the electromagnetic spectrum.
fr: Une méthode alternative utilise la photométrie pour mesurer l'intensité de la lumière passant à travers différents filtres. Chaque filtre autorise <emphasis>seulement</emphasis> une partie spécifique du spectre lumineux à passer et rejette toutes les autres. Un système photométrique largement utilisé est nommé <firstterm>le système Johnson UBV</firstterm>. Il emploie trois filtres de bande passante : régions U (<quote>Ultra-violet</quote>), B (<quote>Bleu</quote>), et V (<quote>Visible</quote>), chacun occupant une région différente du spectre électromagnétique.

source: The process of UBV photometry involves using light sensitive devices (such as film or CCD cameras) and aiming a telescope at a star to measure the intensity of light that passes through each of the filters individually. This procedure gives three apparent brightnesses or <link linkend="ai-flux">fluxes</link> (amount of energy per cm<superscript>2</superscript> per second) designated by Fu, Fb, and Fv. The ratio of fluxes Fu/Fb and Fb/Fv is a quantitative measure of the star's "color", and these ratios can be used to establish a temperature scale for stars. Generally speaking, the larger the Fu/Fb and Fb/Fv ratios of a star, the hotter its surface temperature.
fr: Le procédé de la photométrie UBV implique l'utilisation de matériel sensible à la lumière (comme le film ou les caméras CCD) et la visée par un télescope d'une étoile dont on mesure l'intensité lumineuse qui passe à travers chaque filtre individuellement. Ce procédé donne trois brillances apparentes de <link linkend="ai-flux">flux</link> (quantité d'énergie par cm<superscript>2</superscript> par seconde) désigné par Fu, Fb et Fv. Le rapport de flux Fu/Fb et Fb/Fv est une mesure quantitative de la <quote>couleur</quote> de l'étoile et ces rapports sont utilisés pour établir une échelle de température des étoiles. En général, plus les rapports Fu/Fb et Fb/Fv sont grands, plus la température de la surface de l'étoile est élevée.

source: For example, the star Bellatrix in Orion has Fb/Fv = 1.22, indicating that it is brighter through the B filter than through the V filter. furthermore, its Fu/Fb ratio is 2.22, so it is brightest through the U filter. This indicates that the star must be very hot indeed, since the position of its spectral peak must be somewhere in the range of the U filter, or at an even shorter wavelength. The surface temperature of Bellatrix (as determined from comparing its spectrum to detailed models that account for its absorption lines) is about 25,000 Kelvin.
fr: Par exemple, l'étoile Bellatrix dans Orion a un Fb/Fv = 1,22 qui indique qu'elle est plus brillante à travers le filtre B qu'à travers le filtre V. Par ailleurs, son rapport Fu/Fb est 2,22 et donc elle est plus brillante à travers le filtre U. Cela indique que l'étoile doit être très chaude, car la position de son pic spectral doit être quelque part entre la plage du filtre U ou une longueur d'onde encore plus courte. La température de surface de Bellatrix (ainsi déterminée grâce à la comparaison de son spectre avec des modèles détailles expliquant les lignes d'absorption) est d'environ 25 000 degrés Kelvin.

source: We can repeat this analysis for the star Betelgeuse. Its Fb/Fv and Fu/Fb ratios are 0.15 and 0.18, respectively, so it is brightest in V and dimmest in U. So, the spectral peak of Betelgeuse must be somewhere in the range of the V filter, or at an even longer wavelength. The surface temperature of Betelgeuse is only 2,400 Kelvin.
fr: Nous pouvons répéter cette analyse pour l'étoile Betelgeuse. Ses rapports Fb/Fv et Fu/Fb sont respectivement 0,15 et 0,18 et ainsi elle est plus lumineuse en V et plus sombre en U. Son pic spectral doit donc être quelque part dans la zone du filtre V, ou même à une longueur d'onde plus grande. La température de surface de Betelgeuse est seulement 2 400 degrés Kelvin.

source: Astronomers prefer to express star colors in terms of a difference in <link linkend="ai-magnitude">magnitudes</link>, rather than a ratio of <link linkend="ai-flux">fluxes</link>. Therefore, going back to blue Bellatrix we have a color index equal to
fr: Les astronomes préfèrent exprimer la couleur des étoiles en termes de différence de <link linkend="ai-magnitude">magnitudes</link> plutôt qu'en proportion de <link linkend="ai-flux">flux</link>. Pour cela, en retournant à la bleue Bellatrix, nous avons un indice de couleur égal à

source: Similarly, the color index for red Betelgeuse is
fr: De même, l'indice de couleur pour la rouge Betelgeuse est

source: The color indices, like the <link linkend="ai-magnitude">magnitude scale</link>, run backward. <emphasis>Hot and blue</emphasis> stars have <emphasis>smaller and negative</emphasis> values of B-V than the cooler and redder stars.
fr: Les indices de couleur, comme l'<link linkend="ai-magnitude">échelle de magnitude</link>, fonctionnent à l'envers. Les étoiles <emphasis>chaudes et bleues</emphasis> ont des valeurs <emphasis>plus petites et négatives</emphasis> de B-V que les étoiles plus froides et plus rouges.

source: An Astronomer can then use the color indices for a star, after correcting for reddening and interstellar extinction, to obtain an accurate temperature of that star. The relationship between B-V and temperature is illustrated in Figure 2.
fr: Un astronome peut alors utiliser l'indice de couleur pour une étoile, après correction pour rougissement et extinction interstellaire pour obtenir une température précise de l'étoile. La relation entre B-V et la température est illustrée dans la figure 2.

source: The Sun with surface temperature of 5,800 K has a B-V index of 0.62.
fr: Le Soleil avec une température de surface de 5 800 K a un indice B-V de 0,62.
