Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: Setting an R² Limit could be useful for unattended observation if the focus run produces a bad result for a 1-off reason. Obviously if the reason is not transitory then rerunning will not improve anything.
fr: Régler une limite pour R² peut être utile pour les observatoires automatisés si la procédure de mise au point donne de mauvais résultats pour une raison isolée. Évidemment, si la raison n'est pas transitoire, une relance du processus n'apportera aucun gain.

source: If the R² Limit is not achieved and the focus process is rerun, and again fails to achieve the R² Limit, then the focus run is marked as successful to avoid the process getting stuck rerunning auto focus forever.
fr: Si la limite de R² n'est pas atteinte et qu'une relance ne permet pas non plus de l'atteindre, alors le processus est marqué comme un succès, cela afin d'éviter que le processus ne rentre dans une boucle infinie.

source: This feature is turned off by setting the R² Limit to 0.
fr: Cette fonctionnalité est désactivée en réglant la limite de R² à zéro.

source: Levenberg–Marquardt Solver
fr: Résolveur de Levenberg-Marquardt

source: The Levenberg-Marquardt (LM) algorithm is used to solve non-linear least squares problems. The GNU Science Library provides an implementation of the solver. These resources provide more details:
fr: L'algorithme de Levenberg-Marquardt (LM) est utilisé pour résoudre des problèmes de moindres carrés non-linéaires. La bibliothèque GNU Science fournit une implémentation du résolveur. Ces ressources fournissent davantage de détails :

source: The Levenberg-Marquardt algorithm is a non-linear least-squares solver and thus suitable for many different equations. The basic idea is to adjust the equation y = f(x,P) so that the computed y values are as close as possible to the y values of the datapoints provided, so that the resultant curve fits the data as best as it can. P is a set of parameters that are varied by the solver in order to find the best fit. The solver measures how far away the curve is at each data point, squares the result and adds them all up. This is the number to be minimized, let's call it S. The solver is supplied with an initial guess for the parameters, P. It calculates S, makes an adjustment to P and calculates a new S1. Provided S1 &lt; S then we are moving in the right direction. It iterates through the procedure until:
fr: L'algorithme de Levenberg-Marquardt est un résolveur de moindres carrés non-linéaire et est donc approprié pour beaucoup d'équations différentes. L'idée de base est d'ajuster l'équation y = f(x,P) de telle manière que les valeurs y calculées sont aussi proches que possible des y des points de données pour trouver la meilleure courbe résultante. Le résolveur mesure la distance entre la courbe et chaque point, prend le carré du résultat et les additionne. Ce nombre est la valeur à minimiser et est appelée S. On donne au résolveur une première valeur du paramètre P. Il calcule S, ajuste P et calcule une nouvelle valeur pour S, S1. Si S1 &lt; S, alors on va dans la bonne direction. Cette procédure est itérée jusqu'à ce que :

source: the delta in S is less than a supplied limit (convergence has been reached), or
fr: le delta en S est plus petit qu'une valeur donnée (la suite a convergé), ou

source: the maximum number of iterations has been reached, or
fr: le nombre maximale d'itération a été atteint, ou

source: the solver encountered an error.
fr: le résolveur a rencontré une erreur.

source: The solver is capable of solving either an unweighted or weighted set of datapoints. In essence, an unweighted set of data gives equal weight to each datapoint when trying to fit a curve. An alternative is to weight each datapoint with a measure that corresponds to how accurate the measurement of the datapoint actually is. In our case this is the variance of star HFRs associated with the datapoint. The variance is the standard deviation squared.
fr: Le résolveur est capable de résoudre tant un ensemble de points sans poids qu'avec poids. En substance, un ensemble de points sans poids donne un poids équivalent à chaque point quand le résolveur cherche à interpoler la courbe. Une alternative est de donner un poids à chaque point qui mesure la précision de ce point. Dans ce cas, c'est la variance du HFR de l'étoile pour chaque point. La variance est le carré de la déviation standard.

source: Currently the solver is used to fit either a parabolic or a hyperbolic curve.
fr: Pour le moment le résolveur est utilisé pour interpoler une courbe hyperbolique ou parabolique.

source: <title>Aberration Inspector</title>
fr: <title>Inspecteur d'aberration</title>

source: <screeninfo>Aberration Inspector</screeninfo>
fr: <screeninfo>Inspecteur d'aberration</screeninfo>

source: <phrase>Aberration Inspector</phrase>
fr: <phrase>Inspecteur d'aberration</phrase>

source: The Aberration Inspector is a tool that makes use of Autofocus to analyze backfocus and sensor tilt in the connected optical train.
fr: L'inspecteur d'aberration est un outil utilisant la mise au point automatique pour analyser le backfocus et l'inclinaison du capteur du train optique.

source: To run Aberration Inspector press the <guibutton>Aberration Inspector</guibutton> button. See <link linkend="focus-tools">Focus Tools</link> for more details. The following criteria must be met in order for the button to be active and the tool to work:
fr: Pour exécuter l'inspecteur d'aberration, veuillez cliquer sur le bouton de l'<guibutton>Inspecteur d'aberration</guibutton>. Reportez-vous au <link linkend="focus-tools">Outils de mise au point</link> pour davantage de détails. Les critères suivants doivent être remplis pour que l'outil fonctionne :

source: The focuser must be an absolute focuser.
fr: Le moteur de mise au point doit être de type absolu.

source: The focus algorithm must be Linear 1 Pass.
fr: L'algorithme de mise au point doit être Linéaire 1 passe.

source: A mosaic mask must be applied.
fr: Un masque de mosaïque doit avoir été appliqué.

source: Focuser step size needs to be setup. It is the number of microns the focal plane moves for 1 focuser tick. This is setup in the CFZ dialog. See the <link linkend="focus-cfz">CFZ section</link> for more details.
fr: La taille de pas du moteur de mise au point doit être réglée. Elle correspond au nombre de microns d'un pas de déplacement. Cela est réglé dans la boîte de dialogue de la CFZ. Reportez-vous à la <link linkend="focus-cfz">section CFZ</link> pour davantage de détails.

source: When the Inspector button is pressed, AutoFocus will run, but in addition, for each datapoint, extra information is captured for later use by Aberration Inspector. Once Autofocus completes, the Aberration Inspector dialog is displayed.
fr: Lorsque le bouton de l'Inspecteur est cliqué, une exécution de la mise au point automatique sera lancée, mais, en plus, pour chaque point, de l'information supplémentaire sera enregistrée pour une utilisation ultérieure par l'Inspecteur. La fenêtre de l'Inspecteur sera affichée dès que la mise au point automatique sera terminée.

source: To initially setup to use the tool it is recommended to do the following:
fr: Le réglage initial pour l'utilisation de cet outil nécessite les points suivants :

source: Point to a part of the sky where Autofocus solves well. Typically this would be high in the sky away from any obstacles. Choose somewhere with lots of stars such as the Milky Way. The reason this is more important for Aberration Inspector than Autofocus is that focus analysis needs to be performed for each tile in the mosaic. Therefore, it is important that each tile has enough stars to perform accurate Autofocus.
fr: Pointer vers une région du ciel connue pour obtenir une bonne résolution. C'est typiquement haut dans le ciel sans obstacle où il y a beaucoup d'étoiles, comme la voie Lactée. La raison pour laquelle il est plus important pour l'inspecteur d'aberration que pour la mise au point automatique d'avoir un ciel très étoilé et que l'analyse de mise au point doit être réalisée pour chaque tuile de la mosaïque. Il faut donc que chaque tuile ait assez d'étoiles pour réaliser une mise au point précise.

source: Run Autofocus a couple of times to ensure it is solving correctly and that you have a good set of stars in each mosaic tile. Whilst most focus parameters can be used it is recommended to use the parameters that work best for Autofocus with your equipment. The reason for this is that Aberration Inspector needs be focus solve each mosaic tile and not just the sensor as a whole.
fr: Exécuter la mise au point automatique plusieurs fois pour s'assurer que la résolution se fasse correctement et qu'il y ait assez d'étoiles par tuile. Bien que la plupart des paramètres peuvent être utilisés, il est recommandé d'utiliser les paramètres de mise au point automatique qui fonctionnent le mieux avec votre équipement. La raison est que l'Inspecteur d'aberration doit réaliser une résolution pour chaque tuile et pas seulement pour le capteur en entier.

source: A mosaic mask must be applied. Some experimentation will be required to set this up optimally for your equipment. The configuration parameter to adjust is the tile size which is the size of tile as a percentage of sensor width. The higher the percentage, the bigger each tile, e.g. for a 4:3 sensor using a tile size of 25% means each tile is 8% of the sensor's area. Using a tile size of 10% means each tile is 1% of the sensor's area. The bigger the area the more stars will be present and the better the focus algorithm will solve. However, the purpose of the Aberration Inspector is to provide information on aberrations (backfocus and tilt) across the sensor, so ideally the information for each tile would be specific to as small an area as possible.
fr: Un masque de mosaïque doit être appliqué. Un peu d'expérimentation sera probablement nécessaire pour trouver le réglage optimal pour votre équipement. Le paramètre a ajusté est la taille de la tuile qui est un pourcentage de la largeur du capteur. Ainsi, plus ce pourcentage est grand et plus la tuile sera grande ; par exemple, pour un capteur 4:3 et une tuile de taille 25%, cela signifie que chaque tuile représente 8% de la surface du capteur. Pour 10%, chaque tuile représente 1% de la surface du capteur. Plus la surface est grande et plus grand sera le nombre d'étoile et meilleure sera la résolution. Toutefois, la raison d'être de l'Inspecteur d'aberration est de fournir de l'information sur l'aberration (backfocus et inclinaison) du capteur, et par conséquent l'information pour chaque tuile sera aussi petite que la surface de la tuile.

source: The sweet spot for tile size is as small a value as possible that still contains enough stars to solve well in each tile.
fr: La meilleur taille de tuile est la plus petite possible qui permet une résolution pour chaque tuile.

source: The Aberration Inspector can be used in conjunction with a device to adjust tilt and / or backfocus. The method to do this is an iterative approach, like for example, collimating a telescope. The steps are:
fr: L'inspecteur d'aberration peut être utilisé conjointement avec un périphérique permettant d'ajuster l'inclinaison et/ou le backfocus. La méthode est itérative comme par exemple la collimation du télescope. Les étapes sont :

source: Run the Aberration Inspector and obtain results.
fr: Exécuter l'Inspecteur d'aberration et obtenir des résultats.

source: Inspect the results and make sure they are good, e.g. number of stars in each tile is sufficient and the R² is acceptable for all relevant tiles.
fr: Inspectez les résultats et assurez-vous qu'ils soient bons, c'est-à-dire que le nombre d'étoiles dans chaque tuile est suffisant et que le R² soit acceptable pour chaque tuile.

source: Adjust tilt and / or backfocus using your device, based on Aberration Inspector results.
fr: Ajustez l'inclinaison et/ou le backfocus en utilisant votre périphérique, en se référant aux résultats obtenus.

source: Re-run Aberration Inspector. It will launch another dialog. Check results as before. If the tilt and / or backfocus is getting better then the adjustment was made in the correct sense; if not reverse the sense and retry. Use the feedback from the previous adjustment for the next adjustment.
fr: Relancez l'Inspecteur d'aberration. Cela ouvrira une nouvelle fenêtre. Vérifiez les résultats comme précédemment. Si l'inclinaison et/ou le backfocus s'améliorent, cela signifie que les corrections vont dans le bon sens. Dans le cas contraire, inversez le sens et réessayez. Utilisez le retour de l'ajustement précédent pour le prochain ajustement.

source: Repeat the above process until the limit of sensitivity of the equipment is reached.
fr: Répétez la procédure jusqu'à parvenir aux limites de votre équipement.

source: Note the amount of adjustment, e.g. how far to turn bolts, and the sense, clockwise or counter-clockwise, will vary by equipment and must be discovered by the user by trial and error. Always follow the recommendations of the tilt / backfocus device manufacturer.
fr: Notez la valeur de l'ajustement, c'est-à-dire le nombre de tours, le sens (horaire ou anti-horaire). Ces réglages dépendent de votre équipement et doivent être trouvés par tâtonnements.

source: Each time Aberration Inspector is run it launches a new dialog with the run number appended to the title. This way several runs can be performed and the results compared. Note, however, that the dialog holds a lot of data (roughly 10x the amount of a standard Autofocus run). The system resources associated with this are released when the dialog is closed. For this reason on lower powered machines, once the tool has been used, it is recommended to close all Aberration Inspector dialogs before imaging.
fr: À chaque exécution de l'Inspecteur, une fenêtre s'ouvre et affiche le nombre d'exécution pour chaque tuile. Ainsi, plusieurs exécutions peuvent être réalisées et les résultats comparés. Veuillez toutefois noter la grande quantité de données (environ 10x celle d'une mise au point automatique). Les ressources système associées sont affichées une fois la fenêtre fermée. Il est ainsi recommandé, pour les machines de faibles ressources, de fermer toutes les fenêtres de l'inspecteur avant de commencer d'imager.

source: The following sections describe the sections of the Aberration Inspector dialog.
fr: Les sections suivantes décrivent les parties de la fenêtre de l'inspecteur d'aberration.

source: <title>Aberration Inspector V-Curve</title>
fr: <title>Courbe en V de l'inspecteur d'aberration</title>

source: <screeninfo>Aberration Inspector V-Curve</screeninfo>
fr: <screeninfo>Courbe en V de l'inspecteur d'aberration</screeninfo>

source: <phrase>Aberration Inspector V-Curve</phrase>
fr: <phrase>Courbe en V de l'inspecteur d'aberration</phrase>

source: At the top of the dialog are some controls, followed by the V-Curve. The controls are:
fr: En haut de la fenêtre se trouvent quelques boutons suivi par la courbe en V. Ce sont :

source: <guilabel>Tiles</guilabel>: Three options are available:
fr: <guilabel>Tuiles</guilabel> : trois options sont disponibles :

source: All: All 9 tiles are displayed.
fr: Tout : les 9 tuiles sont affichées

source: Centre and outer corners: The centre and 4 corner tiles are displayed.
fr: Centre et coins : la tuile du centre et les 4 tuiles de coins sont affichés.

source: Centre and inner diamond: The centre and 4 inner diamond tiles are displayed.
fr: Centre et losanges intérieurs : la tuile du centre et les 4 tuiles des losanges intérieurs sont affichés.

source: <guilabel>Labels</guilabel>: Checkbox toggles focus point labels on the V-Curve.
fr: <guilabel>Étiquettes</guilabel> : case à cocher qui affiche/masque les étiquettes des points de la courbe en V.

source: <guilabel>CFZ</guilabel>: Checkbox toggles whether the CFZ moustache is displayed on the V-Curve.
fr: <guilabel>CFZ</guilabel> : case à cocher qui affiche/masque la zone CFZ sur la courbe en V.

source: <guilabel>Optimise Tile Centres</guilabel>: If unchecked, the geometrical centre of the tile is used; if checked, the centre of the tile is calculated as an average of the star positions within the tile. Whilst theoretically more accurate to check this option, it is likely to have a significant impact only if the number of stars is small.
fr: <guilabel>Optimiser les centres des tuiles</guilabel> : si décoché, le centre géométrique de la tuile est utilisé. Si coché, le centre de la tuile est calculé comme étant la moyenne des positions des étoiles de la tuile. Bien que théoriquement plus plus précis, cette option a un impact important que pour les tuiles n'ayant que très peu d'étoiles.

source: <guilabel>Close</guilabel>: Close the Aberration Inspector dialog.
fr: <guilabel>Fermer</guilabel> : fermer la boîte de dialogue de l'inspecteur d'aberration

source: The V-Curve is similar to the V-Curve on the main Focus tab, except each tile is represented by its own curve. The number of curves is determined by the setting of the <guilabel>Tiles</guilabel> combobox. The x-axis displays the focuser position and the y-axis the measure (e.g. HFR) used by Autofocus. Each curve has its own colour and 2 character identifier as displayed in the legend.
fr: La courbe en V est similaire à celle affichée dans l'onglet de la mise au point, sauf que chaque tuile possède sa propre courbe. Le nombre de courbes est déterminé par le réglage des <guilabel>Tuiles</guilabel>. L'axe x affiche la position du moteur de mise au point et l'axe y affiche la mesure (p.ex. le HFR) utilisé par la mise au point automatique. Chaque courbe a sa propre couleur et est identifiée par 2 caractères affichés dans la légende.

source: Hover the mouse over a curve minimum to see more information about that curve.
fr: Un survol du minimum de la courbe affiche davantage d'informations sur cette courbe.

source: <title>Aberration Inspector Table</title>
fr: <title>Tableau de l'inspecteur d'aberration</title>

source: <screeninfo>Aberration Inspector Table</screeninfo>
fr: <screeninfo>Tableau de l'inspecteur d'aberration</screeninfo>

source: <phrase>Aberration Inspector Table</phrase>
fr: <phrase>Tableau de l'inspecteur d'aberration</phrase>

source: The table displays information pertinent to each tile as selected by the <guilabel>Tiles</guilabel> setting.
fr: Le tableau affiche l'information pertinente pour chaque tuile sélectionnée avec le paramètre <guilabel>Tuiles</guilabel>.

source: A tooltip like graphic is displayed when the mouse is hovered over either of the leftmost 2 columns. The graphic displays a picture of the sensor scaled to the dimensions of the sensor. Overlayed on the sensor are the tiles as selected by the <guilabel>Tiles</guilabel> setting. The tiles are scaled appropriately for the tile settings. Each tile is labelled with the Tile Name and the tile corresponding to the row that the mouse is hovering over, is highlighted in the colour of that tile.
fr: Une boîte d'aide est affichée lors d'un survol de la souris sur les deux colonnes les plus à gauche. Le graphique affiche une image du capteur à l'échelle de dimensions du capteur. Les tuiles sont superposées au capteur tel que spécifié par le paramètres <guilabel>Tuiles</guilabel>. Elles sont dimensionnées selon ce réglage. Chaque tuile est étiquetée de son nom et la tuile correspondant à la ligne survolée par la souris est colorée de la même couleur que la tuile.

source: The following columns are displayed:
fr: Les colonnes suivantes sont affichées :

source: <guilabel>Tile</guilabel>: The 1 or 2 character name of the tile, e.g. TL = Top Left, C = Centre, etc.
fr: <guilabel>Tuile</guilabel> : le nom de la tuile résumé en 1 ou 2 caractères, par exemple TL = Top Left, C = Centre, etc.

source: <guilabel>Description</guilabel>: Tile Description, e.g. Top Left, Centre, etc.
fr: <guilabel>Description</guilabel> : la description de la tuile, par exemple Top Left, Centre, etc.

source: <guilabel>Solution</guilabel>: The focus solution. This matches the solution on the V_Curve.
fr: <guilabel>Solution</guilabel> : la solution de mise au point. Correspond à la solution de la courbe en V.

source: <guilabel>Delta (ticks)</guilabel>: This is the delta of the solution for the current table row from the solution of the Centre tile. The Delta of the Centre row will, of course, be zero.
fr: <guilabel>Delta (pas)</guilabel> : différence entre la solution de la table actuelle et du centre de la tuile. La différence de la ligne du Centre sera bien sûr de zéro.

source: <guilabel>Delta (μm)</guilabel>: This is Delta (ticks) converted to microns using the step size in microns as specified in the CFZ Focus tab.
fr: <guilabel>Delta (μm)</guilabel> : différence convertie en microns à l'aide de la taille de pas en microns telle que spécifiée dans la partie CFZ de l'onglet Mise au point.

source: <guilabel>Num Stars</guilabel>: This shows the min / max number of stars detected during the Autofocus run. Usually, the minimum number would be a far out of focus datapoint and the max number would be the in focus datapoint.
fr: <guilabel>Nombre d'étoiles</guilabel> : affiche le nombre minimal et maximal d'étoiles détectées durant l'exécution de la mise au point automatique. Normalement, le nombre minimal doit se trouver loin de la position de mise au point, alors que le maximum doit être à la position de mise au point.

source: <guilabel>R²</guilabel>: R-squared of the curve fit for this tile. See <link linkend="Coefficient_of_Determination">Coefficient of Determination</link> for more details.
fr: <guilabel>R²</guilabel> : la valeur R² de la courbe de régression pour cette tuile. Voyez <link linkend="Coefficient_of_Determination">Coefficient de détermination</link> pour davantage de détails.

source: <guilabel>Exclude</guilabel>: Checkbox to include / exclude this tile in calculations. By default, if a tile has been curve fitted it will be included; if a tile was not curve fitted then it will be excluded. In addition, the user may decide that a particular tile may contain poor quality data, for example the R² is low; or the number of stars is low. In this case the Exclude can be checked and this row will be excluded from calculations. Note that by excluding some rows, some calculations may not be performed. If the Centre tile is excluded, no calculations can be performed.
fr: <guilabel>Exclure</guilabel> : case à cocher pour inclure/exclure cette tuile des calculs. Par défaut, chaque tuile ayant réussi la régression sera inclue. En cas d'échec, elle ne sera pas inclue. De plus, l'utilisateur peut décider qu'une tuile ne contient pas assez d'information de qualité (R² petit ou trop peu d'étoiles) et ainsi l'exclure des calculs. Veuillez noter qu'en excluant des tuiles, certains calculs ne seront pas réalisés. Si la tuile du centre est exclue, aucun calcul ne peut être réalisé.

source: Note that whilst it's possible to exclude tiles and still get calculated values, if the data is poor quality then it is recommended to rerun Aberration Inspector rather than persist with poor quality data.
fr: Notez également que bien qu'il soit possible d'exclure des tuiles et d'obtenir des valeurs, si les données sont vraiment mauvaises, il est fortement recommandé de relancer l'Inspecteur d'aberration plutôt que de persister avec ces mauvaises données.

source: The recommended approach is to check the table for quality data and once achieved, move onto analysing the <link linkend="aberration-inspector-results">Aberration Inspector Results</link>.
fr: L'approche recommandée est de vérifier le tableau pour obtenir de bonnes données et une fois fait, d'analyser les <link linkend="aberration-inspector-results">Résultats de l'Inspecteur d'aberration</link>.
