Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_telescopes.po
Languages: fr

source: <title>Telescopes</title>
fr: <title>Télescopes</title>

source: <primary>Telescopes</primary>
fr: <primary>Télescopes</primary>

source: Invented in Holland at the beginning of the 17th century, telescopes are the tools used by astronomers and astrophysicists for their observations. With the development of modern science, telescopes are nowadays used for observing in all ranges of the electromagnetic spectrum, inside and outside Earth's atmosphere. Telescopes work by collecting light with a large surface aerie called objective that makes the incoming light to converge. The final image will be viewed by using an eyepiece.
fr: Inventé en Hollande au début du 17<superscript>e</superscript> siècle, les télescopes sont les outils utilisés par les astronomes et les astrophysiciens pour leurs observations. Avec le développement de la science moderne, les télescopes sont aujourd'hui utilisés pour observer dans toutes les plages du spectre électromagnétique, à l'intérieur ou à l'extérieur de l'atmosphère terrestre. Les télescopes fonctionnent en collectant la lumière sur une aire de grande surface qui fait converger la lumière entrante. L'image finale sera vue en utilisant un oculaire.

source: Aperture and Focal Ratio
fr: Ouverture et rapport focal

source: Telescopes are used in order to collect light from celestial objects and to converge it to a point, named the focal point. They are described by two parameters, <firstterm>aperture</firstterm> and <firstterm>Focal Ratio</firstterm>. The diameter of the light collecting surface is called the <firstterm>aperture</firstterm> of the telescope &ndash; the bigger the aperture, the brighter the image. The ratio of the focal length <firstterm>f</firstterm> to the <firstterm>aperture D</firstterm> of a telescope is defined as the <firstterm>focal ratio</firstterm>. This describes the light gathering power of a telescope. <quote>Fast</quote> telescopes have smaller focal ratios, as they obtain brighter images in a smaller exposure time. As the focal ratio gets bigger, the telescope needs more exposure time in order to obtain a bright image, which is why it is <quote>slower</quote>. The focal ratio is usually denoted as <quote>f/n</quote>, where n is the ratio of the focal length to the aperture.
fr: Les télescopes sont utilisés pour collecter la lumière venant des objets célestes et la faire converger en un point nommé point focal. Les télescopes se caractérisent par deux paramètres, <firstterm>l'ouverture</firstterm> et <firstterm>le rapport focal</firstterm>. Le diamètre de la surface qui collecte la lumière est appelé <firstterm>l'ouverture</firstterm> du télescope &ndash; plus l'ouverture est grande, plus l'image est lumineuse. Le rapport de la longueur de focale <firstterm>f</firstterm> à <firstterm>l'ouverture D</firstterm> d'un télescope est défini comme le <firstterm>rapport focal</firstterm>. Cela décrit la puissance de collecte de lumière d'un télescope. Les télescopes <quote>rapides</quote> ont un rapport focal plus petit puisqu'ils permettent des images plus lumineuses avec un temps d'exposition plus court. Lorsque le rapport focal devient plus grand, le télescope a besoin de plus de temps d'exposition pour pouvoir obtenir une image lumineuse, et il est ainsi appelé <quote>lent</quote>. Le rapport focal est généralement noté sous la forme <quote>f/n</quote>, où n est le rapport de la longueur focale sur l'ouverture.

source: In order to obtain an image, telescopes use lenses or mirrors. Unfortunately, if we use both of them we obtain image distortions known as <firstterm>aberrations</firstterm>. Some aberrations are common for both lenses and mirrors, like <firstterm>astigmatism</firstterm> and <firstterm>curvature of field</firstterm>.
fr: Pour obtenir une image, les télescopes utilisent des lentilles ou des miroirs. Malheureusement, si les deux sont utilisés, des distorsions d'images se produisent, appelées <firstterm>aberrations</firstterm>. Certaines sont communes aux lentilles et aux miroirs, comme <firstterm>l'astigmatisme</firstterm> et <firstterm>la courbure de champ</firstterm>.

source: <firstterm>Astigmatism</firstterm> appears when different parts of the lens or mirror make the rays of the incoming light to converge in slightly different locations on the focal plane. When corrected for astigmatism, <firstterm>curvature of field</firstterm> may appear on the surface of the lens/ mirror, which makes the light to converge on a curve rather than on a plane.
fr: <firstterm>L'astigmatisme</firstterm> apparaît lorsque des parties différentes d'une lentille ou d'un miroir font que les rayons de lumière entrante convergent vers des positions légèrement différentes sur le plan focal. Lorsque l'astigmatisme est corrigé, <firstterm>la courbure de champ</firstterm> peut apparaître à la surface de la lentille ou du miroir, ce qui conduit à une convergence de la lumière sur une courbe plutôt que sur un plan.

source: Still, there are also lens specific aberrations and mirror specific aberrations.
fr: De plus, il y a aussi des aberrations spécifiques aux lentilles et des aberrations spécifiques aux miroirs.

source: <firstterm>Chromatic aberration</firstterm> is a feature of telescopes that use lenses to converge the light. Mainly, the focal length of a lens is wavelength dependent, which means that the focal point of blue light differs from that of the red light. This results in a blurred image. The effect of chromatic aberration can be diminished by adding correcting lenses into the system. <firstterm>Spherical</firstterm> aberration may also be a problem for lenses, resulting from their shape. Spheroid surfaces will not make the incoming light to converge to a single point, which is why other optical surfaces like paraboloids are preferred. Even by using them we aren't still out of trouble, as coma aberration appears in this case. It results from the dependence of the focal length on the angle between the direction of the incoming ray and the optical axis of the system. Thus, images of points that lie off the optical axis are elongated, rather than being simple points, as it would be normal.
fr: <firstterm>Les aberrations chromatiques</firstterm> sont une caractéristique des télescopes qui utilisent des lentilles pour faire converger la lumière. En général la longueur de focale d'une lentille est fonction de la longueur d'onde, ce qui signifie que le point focal d'une lumière bleue est différent de celui d'une lumière rouge. Cela conduit à une image floue. Les effets d'une aberration chromatique peuvent être limités en utilisant des lentilles correctives dans le système. Les aberrations <firstterm>sphériques</firstterm> peuvent être aussi un problème pour les lentilles, venant de leurs formes. Les surfaces sphériques ne feront pas converger la lumière entrante en un point unique, raison pour laquelle d'autres surfaces optiques comme les paraboloïdes sont préférées. Même en les utilisant, il y a toujours des difficultés puisque des aberrations de coma apparaissent dans ce cas. Cela provient de la dépendance entre la longueur focale sur l'angle entre la direction de la lumière entrante et l'axe optique du système. Ainsi, les images des points qui se trouvent loin de l'axe optique sont étirées, plutôt que d'être de simples points, comme cela devrait être le cas.

source: Magnification
fr: Grossissement

source: <firstterm>Magnification</firstterm>, the increase in angular size of an object as viewed in a telescope, is described as the ratio of the focal length of the objective to the focal length of the eyepiece. So the greater the focal length of the objective, the greater the magnification. If you want to have a large image then you need a long focal length objective and a short focal length eyepiece.
fr: Le <firstterm>grossissement</firstterm> est l'augmentation de la taille angulaire d'un objet lorsque vu dans un télescope ; il est décrit comme le rapport entre la longueur focale d'un objectif sur la longueur focale d'un oculaire. Ainsi, plus la longueur focale d'un objectif est grande, plus important est le grossissement. Si vous souhaitez avoir une grande image, alors, vous aurez besoin d'un objectif à grande longueur focale et un oculaire à petite longueur focale.

source: As an example, if you have a 500 mm objective and a 25 mm eyepiece the resulting magnification will be 500 / 25, which is 20, or 20X.
fr: Par exemple, si vous avez un objectif de 500 mm et un oculaire de 25 mm, le grossissement obtenu sera de 500/25, c'est-à-dire de 20 ou 20X.

source: Field of View
fr: Champ de vision

source: The field of view is the angle covered on the sky by the telescope.<firstterm>The apparent</firstterm> field of view of a telescope is determined only by the eyepiece. It is a specific characteristic of it, usually around 52 degrees. In order to find the <firstterm>true field of view</firstterm> of a telescope, you need to divide the apparent field of view by the magnification. The true field of view is the actual angle covered on the sky by the telescope.
fr: Le champ de vision est l'angle du ciel couvert par le télescope. Le champ de vision <firstterm>apparent</firstterm> d'un télescope n'est déterminé que par l'oculaire. C'est une de ses caractéristiques propres, généralement autour de 52 degrés. Pour trouver le <firstterm>véritable champ de vision</firstterm> d'un télescope, vous devez diviser le champ de vision apparent par le grossissement. Le véritable champ de vision est l'angle réel du ciel couvert par le télescope.

source: &kstars; has a tool to find and display (on the virtual sky) a true field of view called the <guilabel>FOV Indicator</guilabel>. Launch it by heading under the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>FOV Symbols</guisubmenu> <guimenuitem>Edit FOV Symbols...</guimenuitem></menuchoice> menu item. Clicking <guibutton>New...</guibutton> will open a dialog with four different tabs: <guilabel>Eyepiece</guilabel>, <guilabel>Camera</guilabel>, <guilabel>Binocular</guilabel> and <guilabel>Radiotelescope</guilabel>. To compute the field of view, select the tab that applies and enter the specifications of the equipment. Finally, clicking <guibutton>Compute FOV</guibutton> will calculate and display the field of view immediately below. &kstars; can now also display this as a shape of that size on the virtual sky. To do so, enter a name for this particular field of view (such as <userinput>20mm eyepiece</userinput> or <userinput>DSLR with refractor</userinput>) and select a shape and color to be displayed. For <guilabel>Eyepiece</guilabel>, use <guimenuitem>Circle</guimenuitem> or <guimenuitem>Semitransparent circle</guimenuitem> as the shape since an eyepiece's field is round. For <guilabel>Camera</guilabel>, use <guimenuitem>Square</guimenuitem> (which is actually a rectangle) assuming the sensor or film is rectangular or square. When using multiple eyepieces and/or telescopes, it is good to distinguish them with different colors. Click <guibutton>OK</guibutton> to close the dialog. To show the shape on the screen, go back under the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>FOV Symbols</guisubmenu></menuchoice> submenu, then select the new menu item with the name of whatever it was given. To disable it again, click the menu item again.
fr: &kstars; possède un outil pour trouver et afficher (sur un ciel virtuel) un champ de vision réel, appelé <guilabel>l'indicateur CdV</guilabel>. Lancez le par sa rubrique sous <menuchoice><guimenu>Configuration</guimenu> <guisubmenu>Symboles CdV</guisubmenu><guimenuitem>Modifier les symboles CdV</guimenuitem></menuchoice>. Un clic sur <guibutton>Nouveau</guibutton> ouvrira une boîte de dialogue avec quatre onglets différents : <guilabel>Oculaire</guilabel>, <guilabel>Appareil photo</guilabel>, <guilabel>Binoculaire</guilabel> et <guilabel>Radio-télescope</guilabel>. Pour calculer le champ de vision, sélectionnez l'onglet correspondant et saisissez les caractéristiques de l'équipement. Enfin, un clic sur <guibutton>Calculer le CdV</guibutton> calculera et affichera le champ de vision immédiatement en dessous. &kstars; peut maintenant l'afficher dans une forme de cette taille sur le ciel virtuel. Pour le faire, saisissez un nom pour ce champ de vision spécifique (comme <userinput>oculaire de 20 mm </userinput> ou <userinput>APN avec réfracteur</userinput>) et sélectionnez une forme et une couleur pour affichage. Pour <guilabel>Oculaire</guilabel>, utilisez <guilabel>Cercle</guilabel> ou <guilabel>Cercle semi-transparent</guilabel> comme forme puisque qu'un oculaire est circulaire. Pour <guilabel>Appareil photo</guilabel>, utilisez <guilabel>Carré</guilabel> (qui est plutôt un rectangle), en supposant que le capteur ou le film est rectangulaire ou carré. Lors de l'utilisation d'oculaires et/ou de télescopes multiples, il est bon de les distinguer par des couleurs différentes. Cliquez sur <guibutton>Ok</guibutton> pour fermer la boîte de dialogue. Pour afficher la forme sur l'écran, retournez sur les menus <menuchoice><guimenu>Configuration</guimenu> <guisubmenu>Symboles CdV</guisubmenu></menuchoice> et ensuite sélectionnez le nouvel élément de menu avec le nom qui lui a été donné. Pour le désactiver, cliquez une nouvelle fois sur l'élément de menu.

source: Types of Telescopes
fr: Types de télescopes

source: As telescopes are used in observations over the entire electromagnetic spectrum, they are classified in Optical Telescopes, Ultraviolet, Gamma Ray, X-Ray, Infrared and Radio Telescopes. Each one of them has its own, well defined role in obtaining a detailed analysis of a celestial object.
fr: Puisque les télescopes sont utilisés dans des observations sur tout le spectre électromagnétique, ils sont classés en télescopes optiques ou télescopes ultra-violets, rayons gamma, rayons X, infrarouges et radio-télescopes. Chacun d'entre eux possède un rôle propre et bien défini pour obtenir une analyse détaillée d'un corps céleste.

source: Optical Telescopes
fr: Télescopes optiques

source: Used for observations in the visible field of view, Optical Telescopes are mainly Refractors and Reflectors, the difference between the two of them being the way of collecting light from a star.
fr: Utilisés pour des observations dans le champ de spectre visible, les télescopes optiques sont principalement des réfracteurs et des réflecteurs, la différence entre ces deux n'est que la façon de collecter la lumière provenant d'une étoile.

source: <firstterm>Refracting Telescopes</firstterm> use two lenses in order to create an image, a primary or <firstterm>objective lens</firstterm>, which collects the incoming light, forming an image in the focal plane and the <firstterm>eyepiece</firstterm>, which is acting as a magnifying glass used for observing the final image. The two lenses are situated at opposite ends of a moving tube and the distance between the two of them can be adjusted in order to obtain the final image.
fr: Les <firstterm>télescopes réfracteurs</firstterm> utilisent deux lentilles pour créer une image. Une <firstterm>lentille objectif</firstterm> ou primaire qui collecte la lumière entrante pour former une image dans le plan focal et un <firstterm>oculaire</firstterm> qui fonctionne comme un verre grossissant pour permettre l'observation de l'image finale. Les deux lentilles sont situées aux extrémités d'un tube coulissant et la distance entre ces deux lentilles peut être ajustée pour obtenir l'image finale.

source: The largest refracting telescope in the world is at the <firstterm>Yerkes Observatory</firstterm> in Williams Bay, Wisconsin. Built in 1897, it has a 1.02-m (40-in) objective and a focal length of 19.36 m.
fr: Le plus grand télescope réfracteur dans le monde est celui de <firstterm>l'observatoire Yerkes</firstterm> à Williams Bay, Wisconsin. Construit en 1897, il possède un objectif de 1,02 m (40 pouces) et une longueur de focale de 19,36 m.

source: <firstterm>Reflecting Telescopes</firstterm>, on the other side, use mirrors instead of lenses in order to obtain the final image. By replacing the objective lens with a mirror, we obtain a focal point that lies on the path of the incoming light. An observer situated at this point could see an image, but he would block part of the incoming light. The focal point of the principal mirror is called <firstterm>prime focus</firstterm>, and this is also the name of the first category of reflecting telescopes. Thus, prime focus telescopes use a mirror in order to collect light from a celestial object and by reflection the image of the object may be observed from the prime focus of the telescope. Other types of reflecting telescopes are <firstterm>Newtonian</firstterm>, <firstterm>Cassegrain</firstterm> and <firstterm>Coude</firstterm>.
fr: Les <firstterm>télescopes réflecteur</firstterm>, d'un autre coté, utilisent des miroirs au lieu de lentilles pour obtenir l'image finale. En remplaçant la lentille de l'objectif avec un miroir, le point focal est obtenu sur le trajet de la lumière entrante. Un observateur situé sur ce point pourrait voir une image, mais il ne pourrait recevoir qu'une partie de la lumière entrante. Le point focal du miroir principal est appelé <firstterm>foyer primaire</firstterm> et ceci est aussi le nom de la première catégorie de télescopes à réflecteurs. Ainsi, les télescopes à foyer primaire utilisent un miroir pour collecter la lumière d'un objet céleste et, par réflexion, l'image de l'objet peut être observée à partir du foyer principal du télescope. Les autres types de télescopes réflecteurs sont <firstterm>Newtonien</firstterm>, <firstterm>Cassegrain</firstterm> et <firstterm>Coude</firstterm>.

source: <firstterm>The Newtonian</firstterm> one uses an additional flat mirror placed in the vicinity of the prime focus, in the path of the reflected light. This results in moving the focal point to a different location, on one of the sides of the telescope, more accessible for observing. Of course, a mirror placed in the path of the reflected light will also block part of the incoming one, but if the ratio of the surface aeries of the primary mirror to the second one is big enough, the amount of the blocked incoming light is negligible.
fr: Le télescope de <firstterm>Newton</firstterm> utilise un miroir additionnel plat à proximité du foyer principal, sur le trajet de la lumière réfléchie. Cela conduit à déplacer le point focal vers une position différente, sur l'un des côtés du télescope, plus accessible pour l'observation. Bien sûr, un miroir placé sur le trajet de la lumière réfléchie bloquera aussi une partie de la lumière entrante. Mais le rapport des surfaces entre le miroir primaire et le second est assez grand et la quantité de lumière entrante bloquée est négligeable.

source: <firstterm>The Cassegrain</firstterm> telescope is similar to the Newtonian one but this time the secondary mirror reflects light to the bottom of the telescope. There is a hole at the center of the primary mirror that lets the reflected light to go on its way until it converges to the focal point. The secondary mirror needs to be convex, as it is increasing the focal length of the optical system. The primary mirror of a Cassegrain Telescope is a paraboloid. By replacing it with a hyperboloid we obtain a Ritchey-Chretien telescope. The advantage of using a <firstterm>Ritchey-Chretien</firstterm> telescope is that it removes the coma of the classical reflectors.
fr: Le télescope de <firstterm>Cassegrain</firstterm> est similaire à celui de type de Newton, mais, cette fois-ci, le second miroir réfléchit la lumière vers le bas du télescope. Il y a un trou dans le centre du miroir principal qui laisse passer la lumière réfléchie sur son trajet jusqu'à ce qu'elle converge sur le point focal. Le second miroir doit être convexe puisqu'il augmente la longueur focale du système optique. Le miroir principal d'un télescope de type Cassegrain est un paraboloïde. Son remplacement par un hyperboloïde permet d'obtenir un télescope de Ritchey-Chretien. L'utilisation d'un télescope de <firstterm>Ritchey-Chretien</firstterm> présente l'avantage de supprimer le coma des réflecteurs classiques.

source: <firstterm>The Coude</firstterm> type consists of more than one mirror that reflects the light to a special room, the Coude room, which is located below the telescope. The advantages of using a Coude telescope are varied, from obtaining a long focal length useful in different fields of astronomy and astrophysics, like spectroscopy to avoiding the usage of a massive instrument. But there are also disadvantages in using a Coude telescope, because the more mirrors are placed in the system, the less amount of light arrives at the detector. This happens because by using Aluminum mirrors, only 80 % of the incident light gets reflected.
fr: Le télescope de type <firstterm>Coude</firstterm> consiste en plus d'un miroir qui réfléchit la lumière dans une chambre spéciale, la chambre de Coude, qui est située sous le télescope. L'utilisation d'un télescope de Coude présente de multiples avantages, comme obtenir une longueur focale importante utile dans différents champs de l'astronomie et de l'astrophysique comme la spectroscopie pour éviter l'utilisation d'instruments encombrants. Mais il a aussi des inconvénients dans l'utilisation de télescopes de type Coude car plus il y a de miroirs dans le système, moins il y a de lumière qui arrive dans le détecteur. Cela est causé par l'utilisation de miroirs en aluminium pour lesquels seulement 80 % de la lumière incidente est réfléchie.

source: <firstterm>Catadioptrics</firstterm> are types of telescopes that use systems of both lenses and mirrors for making the light to converge. The most popular catadioptric is the <firstterm>Schmidt-Cassegrain</firstterm> telescope. It has the advantage of providing a large angle field of view. In order to minimize coma, it uses a primary spheroidal mirror with a thin correcting lens that removes spherical aberrations. The secondary mirror is placed in the center of the correcting lens, reflecting light through a hole made in the primary mirror. Not as famous as the Schmidt-Cassegrain telescope but common though is the <firstterm>Maksutov</firstterm> telescope that also uses a correcting lens with the primary mirror, this time their surfaces being concentric.
fr: Les télescopes <firstterm>catadioptriques</firstterm> sont des types de télescopes qui utilisent des systèmes avec à la fois des lentilles et des miroirs pour permettre de faire converger la lumière. Le plus connu des télescopes catadioptriques est le télescope de <firstterm>Schmidt-Cassegrain</firstterm>. Son avantage est de fournir un grand angle de champ de vision. Pour réduire le coma, il utilise un miroir primaire sphérique avec une fine lentille de correction qui supprime les aberrations sphériques. Le second miroir est placé au centre de la lentille de correction, réfléchissant la lumière à travers un trou fait dans le miroir principal. Moins connu que le télescope de Schmidt-Cassegrain, mais aussi commun, il y a le télescope de <firstterm>Maksutov</firstterm> qui utilise aussi une lentille de correction avec le miroir primaire, mais cette fois-ci les surfaces deviennent concentriques.

source: Observations in Other Wavelengths
fr: Observations dans d'autres longueurs d'onde
