Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: <title>Focus</title>
fr: <title>Mise au point</title>

source: Tools
fr: Outils

source: <tertiary>Focus</tertiary>
fr: <tertiary>Mise au point</tertiary>

source: Theory Of Operation
fr: Théorie de la procédure

source: <screeninfo>Ekos Focus</screeninfo>
fr: <screeninfo>Mise au point Ekos</screeninfo>

source: <phrase>Ekos Focus</phrase>
fr: <phrase>Mise au point Ekos</phrase>

source: In order to focus an image, Ekos needs to establish a numerical method for gauging how <emphasis>good</emphasis> your focus is. It's easy when you look at an image and can see it as <emphasis>unfocused</emphasis>, as the human eye is very good at detecting that, but <emphasis>how</emphasis> can Ekos possibly know that?
fr: Afin d'effectuer la mise au point d'une image, Ekos a besoin d'utiliser une méthode numérique pour juger de la <emphasis>valeur</emphasis> de votre mise au point. Il est très facile pour un humain d'estimer si une image n'est pas <emphasis>nette</emphasis> puisque l'œil humain est très bon à cela, mais <emphasis>comment</emphasis> est-ce qu'Ekos peut le savoir ?

source: The most tried and tested method is Half-Flux-Radius (HFR), which is a measure of the width in pixels counting from the center of the star until the accumulated intensity is half of the total flux of the star. As you move closer to the point of optimum focus, so the HFR gets smaller, reaching a minimum at the point of focus before increasing as you start to move away from focus. HFR has been used on lots of different types of equipment and has proved to be stable in a wide range of circumstances.
fr: La méthode la plus essayée et testée est celle du Half-Flux-Radius (HFR), qui est la mesure en pixels de la largeur depuis le centre de l'étoile jusqu'à l'intensité accumulée dont la valeur est la moitié du flux total de l'étoile. À mesure que l'on se rapproche du point de mise au point optimale, la valeur du HFR diminue et atteint un minimum au point de mise au point avant d'augmenter à mesure que l'on s'éloigne de ce point. Cette méthode a été utilisée sur de multiples équipements et a montré sa robustesse dans beaucoup de situations.

source: In addition to HFR, Ekos supports other focus measures, including an adjusted HFR measure, FWHM, Number of Stars and Fourier Power. It is recommended to start with HFR and when the user has become proficient in focusing their equipment, to try the other measures.
fr: En plus de la méthode HFR, Ekos gère d'autres mesures de mise au point, telles que le HFR ajusté, le FWHM, le nombre d'étoiles et la puissance de Fourier. La recommandation est de débuter avec cette méthode et une fois qu'elle est bien maîtrisée d'en tester d'autres.

source: After Ekos processes an image, it selects either a single star and starts measuring its HFR, or it selects a set of stars matching the criteria that have been set and calculates an average HFR. It can automatically select stars, or you can select a single star manually. It is recommended to allow Ekos to select a set of stars.
fr: Après qu'Ekos ait traité une image, il sélectionne l'étoile la plus brillante et commence à mesurer son HFR ou il sélectionne en ensemble d'étoiles correspondant aux critères qui ont été réglés et calcule un HFR moyen. Il peut sélectionner une étoile automatiquement ou vous pouvez lui indiquer quelle étoile utiliser. Il est en général recommandé de permettre à Ekos de choisir un ensemble d'étoiles.

source: Ekos supports 4 different focus algorithms: Linear 1 Pass, Linear, Iterative, Polynomial. Linear 1 Pass is the recommended algorithm.
fr: Ekos propose 4 algorithmes différents de mise au point : Linéaire 1 passe, Linéaire, Itératif, Polynomial. Linéaire 1 passe est l'algorithme recommandé.

source: <emphasis role="bold">Linear 1 Pass</emphasis>: In the Linear 1 Pass algorithm, Ekos establishes a V-Curve and fits a curve to the data to find the focus solution. It then moves to the calculated minimum. Key features include:
fr: <emphasis role="bold">Linéaire 1 passe</emphasis> : cet algorithme débute en établissant une courbe en V puis interpole cette courbe pour trouver une solution. Puis il se déplace directement au minimum calculé. Les fonctionnalités principales incluent :

source: The algorithm compensates for focuser backlash.
fr: L'algorithme compense le jeu du moteur de mise au point.

source: The algorithm is fast, taking 1 pass to identify optimum focus.
fr: L'algorithme est rapide puisqu'il nécessite une passe pour identifier la mise au point optimale.

source: The algorithm uses more sophisticated curve fitting to pinpoint the optimum focus position.
fr: L'algorithme utilise une régression plus sophistiquée pour identifier la position optimale de la mise au point.

source: The algorithm is highly configurable with user control over many parameters like step size, number of steps and how to deal with outliers in the datapoints.
fr: L'algorithme peut être finement contrôlé par l'utilisateur grâce à de nombreux paramètres tels que la taille et le nombre de pas et la manière de gérer les points de valeur aberrantes.

source: Providing the focuser behaves in a repeatable way, i.e. when commanded to go to position X, it always goes to the same position, then this algorithm will be the best to use.
fr: Si le moteur de mise au point se comporte de manière déterministe, c'est-à-dire s'il se déplace toujours à la même position pour une commande donnée, alors cet algorithme est le meilleur.

source: <emphasis role="bold">Linear</emphasis>: In the Linear algorithm, Ekos steps outward from its starting point then moves inward taking regular datapoints through the point of optimum focus and then further inward, to draw a V-Curve. It then fits a quadratic curve to the datapoints and calculates the point of optimum focus. It then moves out again past the point of optimum focus, halves the stepsize and moves in again for a second pass. It looks to follow the curve from the first pass and find the minimum HFR. Due to randomness in the HFR measurements it uses the % tolerance to help decide when it has found a solution. Key features include:
fr: <emphasis role="bold">Linéaire</emphasis> : dans cet algorithme, Ekos se déplace vers l'extérieur depuis son point de départ puis recule en prenant plusieurs points près de la position de mise au point optimale puis recule encore pour dessiner la courbe en V. Il effectue ensuite une régression sur la courbe quadratique et calcule le point optimal. Il repart ensuite vers l'extérieur en dépassant le point optimal, divise par deux le pas, et recule encore pour une seconde passe. Il essaie de suivre la courbe de la première passe et trouve la valeur de HFR minimale. Comme les mesures du HFR sont aléatoires, il utilise le pourcentage de tolérance pour décider si une solution a été trouvée. Les fonctionnalités principales incluent :

source: The algorithm is slow, taking 2 passes to identify optimum focus.
fr: L'algorithme est lent car il nécessite deux passes pour identifier la mise au point optimale.

source: The algorithm uses curve fitting to pinpoint the optimum focus position in pass 1, but then uses % Tolerance to try to stop as close as possible to this HFR on pass 2.
fr: L'algorithme utilise une régression pour déterminer la position optimale de la mise au point à la première passe puis utilise un pourcentage de tolérance pour s'arrêter aussi près que possible de ce HFR à la seconde passe.

source: The algorithm is highly configurable with user control over many parameters like step size and number of steps.
fr: L'algorithme peut être finement contrôlé par l'utilisateur grâce à de nombreux paramètres tels que la taille et le nombre de pas.

source: If the focuser behaves in an inconsistent way, i.e. when commanded to go to position X, there is variability in the position it goes to, then this algorithm will be the best to use as it has some built in tolerance for this variability.
fr: Si le moteur de mise au point se comporte de manière irrégulière, c'est-à-dire qu'une même commande aboutit à une position variable, alors cet algorithme sera la meilleur car il possède une tolérance interne pour gérer cette variabilité.

source: <emphasis role="bold">Iterative</emphasis>: In the Iterative algorithm, Ekos operates iteratively by moving in discrete steps, decided initially by the user-configurable step size and later by the slope of the V-Curve, to get closer to the optimal focus position where it then changes gears and performs smaller, finer moves to reach the optimal focus. The focus process stops when the measured HFR is within the configurable tolerance of the minimum recorded HFR in the process. In other words, whenever the process starts searching for a solution within a narrowly limited range, it checks if the current HFR is within % difference compared to the minimum HFR recorded, and if this condition is met then the Autofocus process is considered successful. The default value is set to 1% and is sufficient for most situations. The Step options specify the number of initial ticks the focuser has to move. If the image is severely out of focus, we set the step size high (i.e. greater than 250). On the other hand, if the focus is close to optimal focus, we set the step size to a more reasonable range (less than 50). It takes trial and error to find the best starting tick, but Ekos only uses that for the first focus motion, as all subsequent motions depend on the V-Curve slope calculations. Key features include:
fr: <emphasis role="bold">Itératif</emphasis> : dans cet algorithme, Ekos fonctionne de manière itérative en se déplaçant par pas discret, dont la valeur initiale a été décidée par l'utilisateur et ensuite par la pente de la courbe en V, pour être le plus près possible de la position optimale de la mise au point où il diminue ensuite la taille des pas pour se rapprocher encore plus de la position optimale. La procédure s'arrête quand le HFR mesuré se trouve dans une plage de tolérance configurable du HFR minimum enregistré. En d'autres termes, quand la procédure cherche une solution dans une plage étroite, il vérifie si le HFR courant est dans une plage de tolérance acceptable comparé au HFR minimum enregistré et si cette condition est remplie, la procédure de mise au point est considérée comme réussie. La valeur de tolérance par défaut est réglé à 1% et est suffisante pour la plupart des situations. Les options de pas spécifient le nombre initial de pas pour le déplacement du moteur. Si l'image est loin de la mise au point, on augmente ce nombre (c'est-à-dire plus grand que 250). Au contraire, si la position de mise au point est proche de la position optimale, on réduit cette valeur à environ 50. C'est un processus d'essais et d'erreurs pour trouver la bonne valeur de départ, mais Ekos ne l'utilise que pour le premier déplacement de mise au point, tous les suivants dépendant de la pente de la courbe en V. Les fonctionnalités principales incluent :

source: The algorithm relies on the focuser having well controlled backlash.
fr: L'algorithme repose sur un jeu du moteur de mise au point bien contrôlé.

source: The algorithm can be fast using a minimum number of steps.
fr: L'algorithme peut être rapide en utilisant un nombre minimum d'étapes.

source: The algorithm works on a "good enough" paradigm whereby it stops when the HFR is within % Tolerance of the perceived minimum.
fr: L'algorithme fonctionne grâce à un paradigme « acceptable » selon lequel il s'arrête quand le HFR se trouve dans une plage de % de tolérance du minimum perçu.

source: <emphasis role="bold">Polynomial</emphasis>: In the Polynomial algorithm, the process starts off in Iterative mode, but once we cross to the other side of the V-Curve (once HFR values start increasing again after decreasing for a while), then Ekos performs quadratic curve fitting to find a solution that predicts the minimum possible HFR position. Key features include:
fr: <emphasis role="bold">Polynomial</emphasis> : dans cet algorithme, la procédure débute en mode Itératif mais une fois que l'on franchit l'autre côté de la courbe en V (quand les valeurs HFR recommencent d'augmenter après avoir diminué pour un moment), Ekos commence un calcul de régression polynomial afin de trouver une solution qui prédit la position HFR minimale. Les fonctionnalités principales incluent :

source: The algorithm uses curve fitting to pinpoint the optimum focus position.
fr: L'algorithme utilise une régression pour déterminer la position optimale de mise au point.

source: Optical Train Group
fr: Groupe du train optique

source: Optical Train
fr: Train optique

source: Optical Train Settings
fr: Réglages du train optique

source: The Optical Train group displays the currently selected Optical Train. By default this will be the primary imaging train, but other trains can be selected. The group consists of:
fr: Le groupe du train optique affiche le train optique actuellement sélectionné. C'est par défaut le train d'acquisition primaire mais d'autres trains peuvent être sélectionnés. Il consiste en :

source: <guibutton>Train</guibutton>: The Optical Train currently in use by the Focus tab. Hover the mouse over this field for a more detailed description of the selected train.
fr: <guibutton>Train</guibutton> : le train optique en cours d'utilisation dans l'onglet de mise au point. En passant la souris sur ce champ, une description plus détaillé du train sélectionné s'affichera.

source: <guibutton>Edit Button</guibutton>: Brings up the Optical Train dialog to view and potentially change the optical trains.
fr: <guibutton>Bouton Modifier</guibutton> : affiche la boîte de dialogue permettant des modifier les trains optiques.

source: Focus parameters are saved per Optical Train automatically.
fr: Les paramètres de mise au point de chaque train optique sont automatiquement enregistrés.

source: Focuser Group
fr: Moteur de mise au point

source: <screeninfo>Focuser Settings</screeninfo>
fr: <screeninfo>Réglages du moteur de mise au point</screeninfo>

source: <phrase>Focuser Settings</phrase>
fr: <phrase>Réglages du moteur de mise au point</phrase>

source: All INDI-compatible focusers are supported. It is recommended to use <emphasis role="bold">absolute</emphasis> focusers for the best results since their absolute position is known on power up. In INDI, the focuser <emphasis>zero</emphasis> position is when the drawtube is <emphasis role="bold">fully retracted</emphasis>. When focusing <emphasis>outwards</emphasis>, the focuser position increases, while it decreases when focusing <emphasis>inwards</emphasis>. The following focuser types are supported:
fr: Tout moteur de mise au point compatible INDI est géré. Il est recommandé d'utiliser des moteurs de mise au point à position <emphasis role="bold">absolue</emphasis> puisque leur position absolue est connue à la mise sous tension. Dans INDI, la position <emphasis>zéro</emphasis> du moteur de mise au point correspond à un tube <emphasis role="bold">complètement rentré</emphasis>. Quand la mise au point se fait vers l'extérieur, la position du moteur de mise au point augmente et inversement. Les types suivants de moteurs de mise au point sont gérés :

source: <emphasis role="bold">Absolute</emphasis>: Absolute Position Focusers such as RoboFocus, MoonLite, ASI ZWO
fr: <emphasis role="bold">Position absolue</emphasis> : moteurs de mise au point à position absolue tels que RoboFocus, Moonlite, ASI ZWO

source: <emphasis role="bold">Relative</emphasis>: Relative Position Focusers.
fr: <emphasis role="bold">Position relative</emphasis> : moteur de mise au point à position relative.

source: <emphasis role="bold">Time Based</emphasis>: Time based focusers with no position feedback that adjust focus position by moving for a certain amount of time.
fr: <emphasis role="bold">Fondé sur une durée</emphasis> : les moteurs de mise au point fondés sur une durée n'ont pas de donnée de position mais ajuste la position de mise au point en se déplaçant pendant une certaine durée.

source: The <guibutton>Focuser</guibutton> field contains the focuser in the attached Optical Train.
fr: Le champ <guibutton>Moteur de mise au point</guibutton> contient le moteur de mise au point du train optique actuel.

source: For absolute and relative focusers, the step size is in units of <emphasis>ticks</emphasis> and for simple, or time based, focusers, the step size is in <emphasis>milliseconds</emphasis>. The <guibutton>In</guibutton> and <guibutton>Out</guibutton> buttons can then be used to move the focuser by the number of ticks defined in the <guibutton>Initial Step Size</guibutton> field in the <link linkend="focus-mechanics">Mechanics</link> tab.
fr: Pour les moteurs de mise au point à position absolue et relative, l'unité est le <emphasis>pas</emphasis> et les <emphasis>millisecondes</emphasis> pour les moteurs simples ou fondés sur le temps. Les boutons <guibutton>En avant</guibutton> et <guibutton>En arrière</guibutton> peuvent ensuite être utilisés pour déplacer le moteur de ce nombre de pas défini dans le champ <guibutton>Taille initiale de pas</guibutton> dans l'onglet <link linkend="focus-mechanics">Mécaniques</link>.

source: The Steps fields has 2 parts:
fr: Les champs de pas ont 2 parties :

source: <emphasis role="bold">Left Hand Steps</emphasis>: Current focuser position. This is output only and is updated as the focuser moves to reflect the current position.
fr: <emphasis role="bold">Champ gauche</emphasis> : position actuelle du moteur de mise au point. Ce n'est que de l'affichage et est rafraîchi en même temps que le moteur de mise au point se déplace.

source: <emphasis role="bold">Right Hand Steps</emphasis>: This is input and allows the user to enter a desired position. When the <guibutton>Goto</guibutton> button is pressed, the focuser is moved from its current position to the position indicated in this field.
fr: <emphasis role="bold">Champ droite</emphasis> : c'est une valeur en entrée que l'opérateur peut modifier pour obtenir une position particulière. Lorsque que le bouton <guibutton>Goto</guibutton> est cliqué, le moteur de mise au point se déplacera depuis la position actuelle jusqu'à la position saisie en entrée.

source: On startup, the Left Hand Steps will show the current focuser position. The Right Hand Steps field is defaulted from the Optical Train saved settings. This is useful, for example, if you have several Optical Trains that use the same focuser but solve at different positions. In this case, the Right Hand Steps will contain the last persisted value for this field for the selected Optical Train. So, after swapping equipment and selecting the Optical Train, if the user presses the <guibutton>Goto</guibutton> button then the focuser will be moved to a good place to start focusing from.
fr: Au départ, la valeur du champ de gauche affichera la position actuelle du moteur de mise au point. Le champ droite prendra comme valeur par défaut celle du train optique enregistré dans les réglages. Cela est utile par exemple lorsque vous avez plusieurs trains optiques qui utilisent le même moteur de mise au point mais dont la position de la mise au point est différente. Dans ce cas, la valeur du champ de gauche sera celle de la dernière valeur pour le train optique sélectionné. Ainsi, après avoir changé de matériel et choisi le train optique adéquat, un clic sur le bouton <guibutton>Goto</guibutton> entraînera le moteur de mise au point à une position qui sera un bon point de départ.

source: The <guibutton>Goto Focus Position</guibutton> button moves the focuser to the position in the righthand Steps field.
fr: Le bouton <guibutton>Aller à</guibutton> déplace le moteur de mise au point à la position indiquée dans le champ de droite.

source: The <guibutton>Stop Focuser Motion</guibutton> button stops the in-progress focuser motion.
fr: Le bouton <guibutton>Arrêter mouvement</guibutton> arrête le mouvement du moteur de mise au point.

source: The <guibutton>Auto Focus</guibutton> button starts an Autofocus run. The <guibutton>Stop</guibutton> button is used to stop the run.
fr: Le bouton <guibutton>Mise au point automatique</guibutton> démarre l'exécution de la procédure de mise au point automatique. Le bouton <guibutton>Arrêter</guibutton> l'arrête.

source: The <guibutton>Capture Image</guibutton> button will take a frame based on the current settings in the <link linkend="focus-ccd-filter-wheel"> Camera &amp; Filter Wheel Group</link>. The <guibutton>Start Framing</guibutton> button will start repeatedly capturing frames until the <guibutton>Stop</guibutton> button is pressed.
fr: Le bouton <guibutton>Acquisition image</guibutton> démarre l'acquisition d'une image dont les réglages actuels proviennent de <link linkend="focus-ccd-filter-wheel">groupe APN et roue à filtres</link>. Le bouton <guibutton>En boucle</guibutton> démarre l'acquisition en boucle jusqu'à ce que le bouton <guibutton>Arrêter</guibutton> soit cliqué.

source: Some of the focus algorithms will attempt to cope with being started away from the point of optimum focus, but for predictable results, it is best to start from a position of being approximately in focus. For first time setup, <guibutton>Start Framing</guibutton> can be used along with the <guibutton>In</guibutton> and <guibutton>Out</guibutton> buttons to adjust the focus position to roughly minimize the HFR of the stars in the captured images. When Framing is used in this way, the <link linkend="focus-v-curve">V-Curve</link> graph changes to show a time series of frames and their associated HFRs. This makes the framing process much easier to perform.
fr: Certains algorithmes de mise au point essaient de se débrouiller quand la procédure débute loin de la position optimale de mise au point. Néanmoins, il est toujours mieux de débuter d'une position proche de la mise au point. Pour les premiers réglages, l'utilisation de l'acquisition <guibutton>En boucle</guibutton> et des boutons <guibutton>En avant</guibutton> et <guibutton>En arrière</guibutton> simplifie la recherche de la position de mise au point en cherchant un HFR grossier des images. Lorsque l'acquisition en boucle est utilisée de cette manière, le graphique de la <link linkend="focus-v-curve">courbe en V</link> est modifié pour afficher une série temporelle des images et leur valeur de HFR associée. Cela rend la procédure beaucoup plus simple à réaliser.

source: If you are completely new to astronomy, it is always a good idea to get familiar with your equipment in daylight. This includes getting the approximate focus position on a distant object. This will provide a good starting position for focusing on stars when nighttime comes.
fr: Si vous êtes complètement novice en astronomie, c'est toujours une bonne idée de se familiariser avec son équipement de jour. Cela inclut de trouver la position approximative de la mise au point sur un objet distant et permettra d'avoir un bon point de départ à la nuit tombée.

source: Camera &amp; Filter Wheel Group
fr: APN &amp; Roue à filtres

source: <screeninfo>Focus Camera &amp; Filter Wheel Group</screeninfo>
fr: <screeninfo>Caméra de mise au point &amp; roue à filtres</screeninfo>

source: <phrase>Focus Camera &amp; Filter Wheel Group</phrase>
fr: <phrase>Caméra de mise au point &amp; roue à filtres</phrase>

source: This section of parameters deals with the Camera and Filter settings to use when focusing.
fr: Cette section de paramètres gère les réglages de la caméra et des filtres à utiliser lors de la mise au point.

source: The top row of controls allows CCD parameters to be set.
fr: La première ligne de boutons de contrôle permet de régler les paramètres de la caméra.

source: <guilabel>Exp</guilabel>: The exposure time in seconds.
fr: <guilabel>Exp</guilabel> : la durée d'exposition en secondes.
