Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-align.po
Languages: fr

source: <guilabel>Thresh Multiple</guilabel> and <guilabel>Thresh Offset</guilabel> relate to how sensitive the system will be to pixel values. The level of the background is multiplied by <guilabel>Thresh Multiple</guilabel> and then <guilabel>Thresh Offset</guilabel> is added to that. If a pixel's value exceeds the result, then it may be used to detect a star. Therefore, lower values (especially for multiple) may cause even dim pixels to be detected as stars. Higher values will reduce the number of stars detected.
fr: Les paramètres <guilabel>Multiple du seuil</guilabel> et <guilabel>Décalage du seuil</guilabel> sont associés à la sensibilité du système liée à la valeur des pixels. Le niveau du fond du ciel est multiplié par <guilabel>Multiple du seuil</guilabel>, puis on ajoute <guilabel>Décalage du seuil</guilabel>. Si la valeur d'un pixel dépasse le résultat alors il peut être utilisé pour détecter une étoile. Ainsi, les valeurs faibles (en particulier du multiple) auront tendance à ce que les pixels très faibles seront interprétés comme faisant partie d'une étoile. Au contraire, de grandes valeurs réduiront le nombre d'étoiles détectées.

source: <guilabel>Min Area</guilabel> is the minimum area for a star detection--area is in square pixels where all pixels have higher-than-threshold pixel values. If you are detecting small noise spikes as stars, you might want to increase this. If you are not detecting desired smaller real stars, perhaps your <guilabel>Min Area</guilabel> is too high.
fr: Le paramètre <guilabel>Aire minimale</guilabel> représente la surface minimale pour la détection d'étoiles, c'est un carré de pixels où tous les pixels ont une valeur supérieure à un seuil défini. Si de petites pointes de bruit sont détectées comme des étoiles, il faudra probablement augmenter la valeur de ce paramètres. À l'inverse, si vous ne détectez pas les petites étoiles souhaitées, il faudra réduire la valeur de ce paramètre.

source: <guilabel>Conv FWHM</guilabel> should be adjusted to roughly the seeing in your area in pixels. The image is smoothed by this amount before star detection is initiated.
fr: Le paramètre <guilabel>FWHM Convolution</guilabel> (en pixels) devrait être ajusté à peu près à la qualité de votre ciel (seeing). L'image est lissée de cette quantité avant que la détection d'étoiles soient exécutées.

source: Star-Filtering Parameters
fr: Paramètres de filtrage d'étoiles

source: This filtering is done for the sake of speed mostly, as well as for removing clipped stars, or very elliptical objects which might be galaxies. We will touch upon some of the parameters you might consider adjusting. Zero values for these parameters disable the filter. However, once again it's probably best not to get into the weeds of modifying most of these values.
fr: Le filtrage d'étoile est principalement réalisé pour des questions de vitesse de traitement, mais également pour supprimer les étoiles sectionnées ou les objets très elliptiques qui peuvent être des galaxies. Une valeur de zéro désactive le filtrage. Toutefois et à nouveau, il est raisonnable de ne pas modifier les valeurs par défaut de ces paramètres.

source: <guilabel>Initial Keep</guilabel> and <guilabel>Stars Keep #</guilabel> relates to the number of stars returned by the system. The system will initially run its detection algorithm and find some number of possible detections. It will filter that list, keeping only the <guilabel>Initial Keep</guilabel> brightest stars. It will then run the rest of the filtering, including computing the HFR of all those stars and finally only return a list of <guilabel>Stars Keep #</guilabel> stars. None of the uses (alignment, autofocus, guiding) of StellarSolver require thousands of stars to be able to do their job, and the more stars processed the slower the operation. An initial list of 1000 stars and a few hundred returned stars should be sufficient for most applications.
fr: Les paramètres <guilabel>Conserver initial</guilabel> et <guilabel># d'étoiles à conserver</guilabel> gèrent le nombre d'étoiles conservées par le système. Il va d'abord exécuter son algorithme de détection et trouver un certain nombre d'étoiles. Il filtrera ensuite cette liste en ne gardant que le nombre <guilabel>Conserver initial</guilabel> d'étoiles brillantes. Il exécutera ensuite la suite du filtrage ce qui inclut le calcul du HFR de toutes les étoiles et renverra enfin une liste de <guilabel># d'étoiles à conserver</guilabel> d'étoiles. Aucune utilisation de StellarSolver (alignement, mise au point automatique, guidage) ne requiert des milliers d'étoiles pour fonctionner et plus le nombre d'étoiles à traiter est grand, plus grand sera le temps de traitement. Une liste initiale de mille étoiles pour quelques centaines utilisées devrait être suffisant pour la plupart des utilisations.

source: <guilabel>Max Size</guilabel> and <guilabel>Min Size</guilabel> filter stars by their sizes (pixel diameters), and are similar in usage to <guilabel>Min Area</guilabel> above.
fr: Les paramètres <guilabel>Taille maximale</guilabel> et <guilabel>Taille minimale</guilabel> filtrent les étoiles par rapport à leur taille (diamètre en pixels) et sont similaires dans leur utilisation au paramètre <guilabel>Aire minimale</guilabel> discutée ci-dessus.

source: <guilabel>Max Ellipse</guilabel> specifies how elliptical a star can be before being removed. 2 would mean the larger axis could be twice as large as the smaller axis.
fr: Le paramètre <guilabel>Ellipse maximale</guilabel> spécifie la forme elliptique maximale d'une étoile avant d'être retirée. Une valeur de 2 signifie que le grand axe est le double du petit axe.

source: <guilabel>Cut Brightest</guilabel> and <guilabel>Cut Dimmest</guilabel> remove the X% brightest or dimmest stars from consideration. <guilabel>Sat Limit</guilabel> removes stars whose pixel values exceed that percentage of the maximum pixel value--to remove saturated stars.
fr: Les paramètres <guilabel>Supprimer les plus brillantes</guilabel> et <guilabel>Supprimer les moins brillantes</guilabel> permettent de supprimer les X % d'étoiles les plus brillantes ou moins brillantes. Le paramètre <guilabel>Limite de saturation</guilabel> permet de supprimer les étoiles dont la valeur de pixel dépasse ce pourcentage de la valeur maximale de ce pixel, supprimant ainsi les étoiles saturées.

source: Plate-Solving Parameters
fr: Paramètres de résolution

source: These plate-solving parameters mostly relate to computation resources.
fr: Ces paramètres gèrent principalement les ressources de calcul.

source: <guilabel>Search Radius</guilabel> is the distance from the position estimate in degrees that may be searched if <guilabel>Use Position</guilabel> is checked.
fr: Le paramètre <guilabel>Rayon de recherche</guilabel> représente la distance de la position estimée en degrés de la zone de recherche si le paramètre <guilabel>Utiliser position</guilabel> est activé.

source: <guilabel>Maximum Time</guilabel> is the maximum number of seconds that the plate-solving will run before it times out.
fr: Le paramètre <guilabel>Durée maximale</guilabel> est le nombre maximal de secondes de résolution avant le délai d'expiration.

source: Download Index Files
fr: Téléchargement des fichiers index

source: Index files are required if you choose the <guilabel>Internal Solver</guilabel> or <guilabel>Local Astrometry</guilabel> <guilabel>Solving Method</guilabel>.
fr: Les fichiers index sont requis si vous choisissez les méthodes de résolution <guilabel>Résolveur interne</guilabel> ou <guilabel>Astrométrie locale</guilabel>.

source: For offline (and remote) solvers, index files are necessary for the solver to work. The complete collection of index files is huge (over 30 GB), but you only need to download what is necessary for your equipment setup. Index files are sorted by the Field-Of-View (FOV) range they cover. There are two methods to fetch the necessary index files: The new download support in Align module, and the old manual way.
fr: Pour les résolveurs hors-ligne (et à distance), les fichiers index sont nécessaires pour que la résolution fonctionne. La collection complète de ces fichiers index est énorme (plus de 30 Go), mais vous devez que ceux qui correspondent à votre matériel. Les fichiers index sont organisés par l'intervalle de champ de vision (FOV) qu'ils couvrent. Il existe deux manières d'obtenir les fichiers d'index nécessaires : la gestion nouvelle de téléchargement dans le module d'alignement et l'ancienne manière manuelle.

source: Automatic Download
fr: Téléchargement automatique

source: <screeninfo>Astrometry.net Indexes Download</screeninfo>
fr: <screeninfo>Téléchargement des index astrometry.net</screeninfo>

source: <phrase>Astrometry.net Indexes Download</phrase>
fr: <phrase>Téléchargement des index astrometry.net</phrase>

source: Automatic download is only available for Ekos users on &Linux; &amp; &MacOS;. For &Windows; users, please download ANSVR solver.
fr: Le téléchargement automatique n'est disponible pour les utilisateurs d'Ekos utilisant &Linux; et &MacOS;. Pour &Windows;, veuillez télécharger le résolveur « ANSVR ».

source: To access the download page, click the <guibutton>Options</guibutton> button in the <link linkend="ekos-align">Align module</link> and then select <guilabel>Astrometry Index Files</guilabel> tab. The page displays the current FOV of your current setup and below it a list of available and installed index files. Three icons are used to designate the importance of index files given your current setup as follows:
fr: Pour accéder à la page de téléchargement, cliquez sur le bouton <guibutton>Options</guibutton> dans le <link linkend="ekos-align">module d'alignement</link>, puis sélectionner l'onglet <guilabel>Fichiers index Astrometry</guilabel>. La page affiche le champ de vision courant (FOV) de votre matériel ainsi qu'une liste des fichiers index disponibles et installés. Trois icônes sont utilisés pour désigner l'importance des fichiers index pour votre configuration actuelle :

source: Required
fr: Requis

source: Recommended
fr: Recommandé

source: Optional
fr: Facultatif

source: You must download all the required files, and if you have plenty of hard drive space left, you can also download the recommended indexes. If an index file is installed, the checkmark shall be checked, otherwise check it to download the relevant index file. Please only download one file at a time, especially for larger files. You might be prompted to enter the administrator password (default in StellarMate is <userinput>smate</userinput>) to install the files. Once you installed all the required files, you can begin using the offline astrometry.net solver immediately.
fr: Vous devez télécharger tous les fichiers requis et, s'il vous reste de l'espace disque, vous pouvez également installer les fichiers recommandés. Si un fichier index est installé, la case sera cochée, sinon cochez-là pour télécharger les fichiers index pertinents. Il est possible que le mot de passe de l'administrateur du système soit demandé (par défaut, il s'agit de <userinput>smate</userinput>) pour installer ces fichiers. Une fois que tous les fichiers sont téléchargés et installés, vous pourrez commencer d'utiliser le résolveur hors-ligne immédiatement.

source: Manual Download
fr: Téléchargement manuel

source: You need to <ulink url="http://data.astrometry.net">download</ulink> and install the necessary index files suitable for your telescope+CCD field of view (FOV). You need to install index files covering 100% to 10% of your FOV. For example, if your FOV is 60 arcminutes, you need to install index files covering skymarks from 6 arcminutes (10%) to 60 arcminutes (100%). There are many online tools to calculate FOVs, such as <ulink url="http://starizona.com/acb/ccd/calc_pixel.aspx">Starizona Field of View Calculator</ulink>.
fr: Vous devez <ulink url="http://data.astrometry.net">télécharger</ulink> et installer les fichiers index nécessaire qui conviennent pour votre matériel (champ de vision de l'ensemble télescope et CDD). Vous devez installer les fichiers index couvrant une plage allant de 10 % à 100 % de votre champ de vision. Par exemple si votre champ de vision fait 60 minutes d'arc, vous devez installer les fichiers couvrant la plage allant de 6 minutes d'arc (10 %) à 60 minutes d'arc (100 %). Il existe de nombreux outils en ligne permettant de calculer le champ de vision, par exemple <ulink url="http://starizona.com/acb/ccd/calc_pixel.aspx">Starizona Field of View Calculator</ulink>.

source: Index Files
fr: Fichiers index

source: Index Filename
fr: Nom de fichier index

source: FOV (arcminutes)
fr: Champ de vision (minutes d'arc)

source: Debian Package
fr: Paquet Debian

source: The Debian packages are suitable for any Debian-based distribution (Ubuntu, Mint, &etc;). If you downloaded the Debian Packages above for your FOV range, you can install them from your favorite package manager, or via the following command:
fr: Les paquets Debian conviennent à toute distribution fondée sur Debian (Ubuntu, Mint, &etc;). Si vous avez téléchargé les paquets Debian couvrant votre champ de vision, vous pouvez les installer avec votre gestionnaire de paquets favori ou en exécutant la commande suivante :

source: On the other hand, if you downloaded the FITS index files directly, copy them to <filename role="directory">/usr/share/astrometry</filename> directory.
fr: Mais si vous avez téléchargé les fichiers index FITS directement, il vous faudra les copier dans le dossier <filename role="directory">/usr/share/astrometry/</filename>.

source: It is recommended to use a download manager as such <ulink url="https://addons.mozilla.org/en-US/firefox/addon/downthemall/">DownThemAll!</ulink> for &firefox; to download the Debian packages as browsers' built-in download manager may have problems with download large packages.
fr: Il est recommandé d'utiliser un gestionnaire de téléchargement comme <ulink url="https://addons.mozilla.org/fr/firefox/addon/downthemall/">DownThemAll!</ulink> pour &firefox; pour télécharger les paquets pour Debian puisqu'il arrive que certains gestionnaire de téléchargement de navigateurs rencontrent parfois des problèmes à télécharger de gros fichiers.

source: Optionally get astrometry.net
fr: Obtenir optionnellement astrometry.net

source: This is only required if you choose the <guilabel>Local Astrometry</guilabel> option for <guilabel>Source Extraction Method</guilabel> which is no longer recommended.
fr: Cela n'est requis que si vous choisissez <guilabel>Astrométrie locale</guilabel> comme <guilabel>Méthode d'extraction des sources</guilabel>, ce qui n'est plus recommandé.

source: Astrometry.net is already shipped with StellarMate so there is no need to install it. Index files from 16 arcminutes and above (4206 to 4019) are included with StellarMate. For any additional index files, you need to install them as necessary. To use Astrometry in StellarMate from a remote Ekos on &Linux;/&Windows;/&MacOS;, make sure to select <guimenuitem>Remote</guimenuitem> option in Ekos Alignment Module. Furthermore, make sure that the <guimenuitem>Astrometry</guimenuitem> driver is selected in your equipment profile.
fr: Astrometry.net est déjà livré avec StellarMate, donc il n'est pas nécessaire de l'installer. Les fichiers d'index dès 16 minutes d'arc et au-dessus (4206 - 4019) sont inclus dans StellarMate. Tout fichier index additionnel nécessaire devra être installé séparément.

source: <screeninfo>Ekos Remote Astrometry</screeninfo>
fr: <screeninfo>Astrométrie à distance Ekos</screeninfo>

source: <phrase>Ekos Remote Astrometry</phrase>
fr: <phrase>Astrométrie à distance Ekos</phrase>

source: To use astrometry.net under &Windows;, you need to download and install the <ulink url="https://adgsoftware.com/ansvr/">ANSVR Local Astrometry.net solver</ulink>. The ANSVR mimics the astrometry.net online server on your local computer; thus the internet not required for any astrometry queries.
fr: Pour utiliser astrometry.net sous &Windows; vous devez télécharger et installer <ulink url="https://adgsoftware.com/ansvr/">le résolveur local d'astrometry.net ANSVR</ulink>. Ce résolveur simule le résolveur en ligne astrometry.net mais en local sur votre ordinateur ; ainsi, il n'est pas nécessaire d'avoir une connexion internet pour ces requêtes.

source: After installing the ANSVR server and downloading the appropriate index files for your setup, make sure ANSVR server is up and running and then go to Ekos Alignment options where you can simply change the <guilabel>API URL</guilabel> to use the ANSVR server as illustrated below:
fr: Après avoir téléchargé le serveur ANSVR et installé les fichiers index appropriés pour votre configuration, assurez-vous qu'il soit lancé avant de vous rendre dans les options du module d'alignement d'Ekos où vous devez simplement modifier <guilabel>API URL</guilabel> pour utiliser le serveur ANSVR comme illustré ci-dessous :

source: <screeninfo>ANSVR Parameters</screeninfo>
fr: <screeninfo>Paramètres ANSVR</screeninfo>

source: <phrase>ANSVR Parameters</phrase>
fr: <phrase>Paramètres ANSRV</phrase>

source: In Ekos Align module, you must set the solver type to <guimenuitem>Online</guimenuitem> so that it uses the local ANSVR server for all astrometry queries. Then you can use the align module as you would normally do.
fr: Dans le module d'alignement d'Ekos, vous devez modifier le type de résolveur pour <guimenuitem>En ligne</guimenuitem> afin qu'il puisse utiliser le serveur ANSVR local pour toutes les requêtes d'astrométrie. Ensuite vous pourrez utiliser le module d'alignement comme vous le feriez habituellement.

source: Remember as indicated above that StellarMate <emphasis>already</emphasis> includes astrometry.net. Therefore, if you would like to use StellarMate remotely to solve your images, simply change solver type to <guimenuitem>Remote</guimenuitem> and ensure that your equipment profile includes <emphasis role="bold">Astrometry</emphasis> driver which can be selected under the <guilabel>Auxiliary</guilabel> dropdown. This is applicable to all operating systems and not just &Windows;.
fr: Veuillez vous souvenir, comme indiqué plus haut, que StellarMate inclut <emphasis>déjà</emphasis> astrometry.net. Ainsi, si vous souhaitez utiliser StellarMate à distance, il suffit de modifier le type de résolveur à <guimenuitem>À distance</guimenuitem> et vous assurez que le profil de votre matériel inclut le pilote <emphasis role="bold">Astrometry</emphasis> qui peut être sélectionné dans la liste déroulante <guilabel>Auxiliaire</guilabel>. Cela est applicable à tous les systèmes d'exploitation et non pas seulement à &Windows;.

source: Astrometry.net is already included with &kstars; for &MacOS;, so no need to install it.
fr: Astrometry.net est déjà inclut dans &kstars; pour &MacOS;, ainsi il ne faut pas l'installer.

source: Astrometry.net is already included with &kstars; bleeding version. But if astrometry is not installed, then you can install it by running the following command under &ubuntu;:
fr: Astrometry.net est déjà inclut dans la dernière version de &kstars; pour &Linux;. Mais si astrometry.net n'est pas installé, vous pouvez l'installer simplement en exécutant la commande suivante (sous Debian et dérivés) :

source: How to Use?
fr: Comment les utiliser ?

source: Ekos Align Module offers multiple functions to aid you in achieving accurate GOTOs. For some mounts it is useful to start your session with your mount in home position with the telescope tube looking directly at the celestial pole. For users in Northern Hemisphere, point the telescope as close as possible to Polaris. It is not necessary to perform 2 or 3 star alignments, but it can be useful for some mount types. Make sure your camera is focused.
fr: Le module d'alignement d'Ekos propose de multiples fonctions pour vous aider à réaliser des pointages GOTO précis. Pour certaines montures, commencez avec votre monture en position parquée (home position), c'est-à-dire pointant directement vers le pôle céleste. Pour les utilisateurs de l'hémisphère Nord, pointez le télescope aussi près que possible vers l'étoile polaire Polaris. Il n'est pas nécessaire de faire un alignement sur deux ou trois étoiles bien que ça peut être utile pour certains types de montures. Assurez-vous que la mise au point de votre caméra soit réalisée et que les étoiles soient bien résolues.

source: At the top left of the Align page you can find two solver commands, and two actions to take given the solver solution.
fr: En haut à gauche de la page Alignement vous trouverez deux commandes de résolution ainsi que deux actions à entreprendre selon la solution de la résolution.

source: <guilabel>Capture &amp; Solve</guilabel>: Capture an image and determine exactly where in the sky the telescope is pointing. The astrometry results include the equatorial coordinates (RA &amp; DEC) of the center of the captured image and the pixel scale and field rotation. Depending on the Solver Action settings, the results can be used to Sync the mount or Sync and then Slew to the target location. For example, suppose you slewed the mount to Vega then used <emphasis>Capture &amp; Solve</emphasis>. If the actual telescope location is different from Vega, it will be first synced to the solved coordinate and then Ekos shall command the mount to slew to Vega. After slew is complete, the Alignment module will repeat Capture &amp; Solve process again until the error between reported and actual position falls below the accuracy thresholds (30 arcseconds by default).
fr: <guilabel>Acquisition &amp; pointage</guilabel> : commencez par acquérir une image et déterminez la région du ciel où le télescope pointe. Les résultats de l'astrométrie incluent les coordonnées équatoriales (AD &amp; DEC) du centre de l'image, ainsi que l'échelle de pixel et la rotation du champ. Selon les réglages des actions du résolveur, les résultats peuvent être utilisés pour synchroniser la monture ou synchroniser et ensuite pointer vers l'endroit de la cible. Par exemple, supposons que vous avez pointé la monture vers Vega et qu'ensuite vous avez utilisé la fonction <emphasis>Acquisition &amp; Résoudre</emphasis>. Si la position actuelle du télescope est différente de Vega, alors il commencera par se synchroniser aux coordonnées résolues et ensuite Ekos donnera l'ordre à la monture de pointer vers Vega. Après que la rotation soit terminée, le module d'alignement relancera le processus d'<emphasis>Acquisition &amp; Résoudre</emphasis> jusqu'à ce que l'erreur entre la position rapportée et la position actuelle soit plus faible que le seuil de précision préalablement défini (par défaut 30 secondes d'arc).

source: <guilabel>Load &amp; Slew</guilabel>: Load a FITS or JPEG file, solve it, and then slew to it.
fr: <guilabel>Charger &amp; Pivoter</guilabel> : charger une image FITS ou JPEG, la résoudre et ensuite pivoter.

source: <emphasis role="bold">Never</emphasis> solve an image at or near the celestial pole (unless Ekos Polar Alignment Assistant Tool is used). Slew at least 20 degrees away from the celestial pole before solving the first image. Solving very close to the poles will make your mount pointing worse, so avoid it.
fr: Ne <emphasis role="bold">Jamais</emphasis> résoudre une image proche du pôle céleste (sauf quand l'outil d'assistance à l'alignement polaire est utilisé). Pivoter à au moins 20 degrés du pôle céleste avant de commencer à résoudre la première image. Une résolution trop proche des pôles dégradera le pointage de la monture, alors évitez-là.

source: Alignment Settings
fr: Réglages de l'alignement
