Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_calc-julianday.po
Languages: fr

source: <title>Julian Day module</title>
fr: <title>Module de jour julien</title>

source: Tools
fr: Outils

source: Astrocalculator
fr: Calculatrice astronomique

source: <tertiary>Julian Day module</tertiary>
fr: <tertiary>Module de jour julien</tertiary>

source: The Julian Day calculator module
fr: Le module de calcul de jour julien

source: Julian Day
fr: Jour julien

source: This module converts between the calendar <guilabel>Date and time:</guilabel>, the <link linkend="ai-julianday"><guilabel>Julian day:</guilabel></link>, and the <guilabel>Modified julian day:</guilabel>. The Modified Julian Day is simply equal to the Julian Day - 2,400,000.5.
fr: Ce module permet d'effectuer des conversions des <guilabel>date et heure </guilabel> du calendrier, le <link linkend="ai-julianday">Jour julien</link> et le <firstterm>Jour julien modifié</firstterm>. Le jour julien modifié est simplement égal au jour julien - 2 400 000,5.

source: To use the module, enter one of the three dates and the corresponding values for the other two date systems will be displayed. You can also set the Date and time to now, by pressing the <guibutton>Now</guibutton> button.
fr: Pour utiliser ce module, saisissez l'une des trois dates et les valeurs correspondantes pour les deux autres systèmes de dates s'afficheront. Vous pouvez également régler la date et l'heure sur maintenant, en appuyant sur le bouton <guibutton>Maintenant</guibutton>.

source: There is a batch mode for this module. To use it, simply generate an input file whose lines each contain a number of values for the input parameter: <quote>Date and time</quote>, <quote>Julian day</quote> or <quote>Modified Julian day</quote>. Then specify the input and output filenames, and press the <guibutton>Compute</guibutton> button to generate the output file. The output file will contains values for the other two complementary parameters. For example, if your input file contains a set of <guilabel>Date and time:</guilabel> values, then each line of the output file will contain values for <guilabel>Julian day:</guilabel> and <guilabel>Modified julian day:</guilabel>. You can read the output directly in &kstars; by pressing the <guibutton>View output...</guibutton> button.
fr: Il existe un mode de traitement par lots pour ce module. Pour l'utiliser, il suffit de générer un fichier d'entrée dont les lignes contiennent chacune un certain nombre de valeurs pour le paramètre d'entrée : <quote>Date et heure</quote>, <quote>Jour Julien</quote> ou <quote>Jour Julien modifié</quote>. Spécifiez ensuite les noms des fichiers d'entrée et de sortie, et appuyez sur le bouton <guibutton>Calculer</guibutton> pour générer le fichier de sortie. Le fichier de sortie contiendra les valeurs des deux autres paramètres complémentaires. Par exemple, si votre fichier d'entrée contient un ensemble de valeurs <quote>Date et heure</quote>, alors chaque ligne du fichier de sortie contiendra des valeurs pour <quote>Jour Julien</quote> et <quote>Jour Julien modifié</quote>. Vous pouvez lire la sortie directement dans &kstars; en appuyant sur le bouton <guibutton>Afficher la sortie…</guibutton>.

source: Exercise:
fr: Exercice

source: What calendar date does MJD = 0.0 correspond to?
fr: À quelle date du calendrier MJD = 0,0 correspond-elle ?
