Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_tools.po
Languages: fr

source: &kstars; Tools
fr: Outils de &kstars;

source: Tools
fr: Outils

source: &kstars; comes with a number of tools that allow you to explore some more advanced aspects of astronomy and the night sky.
fr: &kstars; est fourni avec un certain nombre d'outils qui permettent d'explorer des aspects très avancés de l'astronomie et du ciel nocturne.

source: Object Details
fr: Détails de l'objet

source: Astrocalculator
fr: Calculatrice astronomique

source: Altitude vs. Time Plotter
fr: Élévation selon l'heure

source: What's up Tonight?
fr: Dans le ciel cette nuit

source: Simulate Eyepiece View
fr: Simuler la vue à l'oculaire

source: Script Builder
fr: Constructeur de scripts

source: Solar System Viewer
fr: Affichage du système solaire

source: Jupiter Moons Tool
fr: Outil des lunes de Jupiter

source: Observation Planner
fr: Planificateur d'observation
