Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_altvstime.po
Languages: fr

source: <title>Altitude vs. Time Tool</title>
fr: <title>Outil d'élévation selon l'heure</title>

source: Tools
fr: Outils

source: <secondary>Altitude vs. Time Tool</secondary>
fr: <secondary>Outil d'élévation selon l'heure</secondary>

source: The Altitude vs. Time Tool
fr: L'outil d'élévation selon l'heure

source: Altitude vs. Time Plotter
fr: Le traceur d'élévation selon l'heure

source: This tool plots the altitude of any objects as a function of time, for any date and location on Earth. The top section is a graphical plot of altitude angle on the vertical axis, and time on the horizontal axis. The time is shown both as standard local time along the bottom, and <link linkend="ai-sidereal">sidereal time</link> along the top. The bottom half of the graph is shaded green to indicate that points in this region are below the horizon.
fr: Cet outil trace une courbe de l'altitude de n'importe quel objet en fonction de l'heure pour toute position sur Terre. La partie du haut est une représentation de l'angle d'élévation (axe vertical) en fonction de l'heure (axe horizontal). L'heure est affichée à la fois comme heure locale standard sur l'axe horizontal du bas et l'<link linkend="ai-sidereal">heure sidérale locale</link> sur l'axe horizontal du haut. La moitié inférieure du graphique est ombrée de vert pour indiquer que les points dans cette région sont sous l'horizon.

source: There are a few ways to add curves to the plot. The simplest way to add the curve of an existing object is to simply type its name in the <guilabel>Name:</guilabel> input field, and press Enter, or the <guibutton>Plot</guibutton> button. If the text you enter is found in the object database, the object's curve is added to the graph. You can also press the <guibutton>Find Object...</guibutton> button to open the <link linkend="findobjects">Find Object Window</link> to select an object from the list of known objects. If you want to add a point that does not exist in the object database, simply enter a name for the point, and then fill in the coordinates in the <guilabel>RA:</guilabel> and <guilabel>Dec:</guilabel> input fields. Then press the <guibutton>Plot</guibutton> button to add the curve for your custom object to the plot (note that you have to pick a name that does not already exist in the object database for this to work).
fr: Il y a plusieurs manières d'ajouter des courbes au graphique. La manière la plus simple pour ajouter la courbe d'un objet existant est simplement d'écrire son nom dans le champ de saisie <guilabel>Nom</guilabel>. Si le texte que vous saisissez se trouve dans la base de données, la <guibutton>courbe</guibutton> de l'objet s'ajoute au graphique. Vous pouvez aussi actionner le bouton <guibutton>Chercher un objet…</guibutton> pour ouvrir la fenêtre <link linkend="findobjects">Chercher un objet…</link> afin de sélectionner un objet dans la liste des objets connus. Si vous voulez ajouter un point qui n'existe pas dans la base de données des objets, donnez simplement un nom pour le point et remplissez les coordonnées dans les champs de saisie <guilabel>AD</guilabel> et <guilabel>DEC</guilabel>. Actionnez ensuite le bouton <guibutton>Tracer</guibutton> pour ajouter la courbe pour votre objet personnalisé au graphique (notez que vous devez donner un nom qui n'existe pas déjà dans la base de données pour que cela fonctionne).

source: When you add an object to the plot, its altitude vs. time curve is plotted with a thick white line, and its name is added to the listbox at the lower right. Any objects that were already present are plotted with a thinner red curve. You can choose which object is plotted with the thick white curve by highlighting its name in the listbox.
fr: Lorsque vous ajoutez un objet au graphique, sa courbe de hauteur en fonction de l'heure est tracée avec une ligne blanche épaisse et son nom est ajouté à la liste en bas à droite. Tout objet qui était déjà présent est affiché avec une courbe rouge plus fine. Vous pouvez choisir quel objet est affiché avec la ligne blanche épaisse en surlignant son nom dans la liste.

source: These curves show the objects' Altitude (angle above the <link linkend="ai-horizon">horizon</link>) as a function of time. When a curve passes from the lower half to the upper half, the object has risen; when it falls back to the lower half, it has set. For example, in the screenshot, the minor planet <firstterm>Quaoar</firstterm> is setting at around 15:00 local time, and is rising at about 04:00 local time.
fr: Ces courbes montrent la hauteur des objets (angle au-dessus de l'<link linkend="ai-horizon">horizon</link>) en fonction de temps. Quand une courbe passe de la moitié inférieure à la moitié supérieure, l'objet s'est levé. Lorsqu'il retombe dans la moitié inférieure, il s'est couché. Par exemple, dans la capture d'écran, l'amas globulaire <firstterm>M 13</firstterm> (courbe rouge) se lève vers 22:10 heure locale et se couche à environ 16:00 heure locale.

source: The plot can be easily zoomed and panned using the mouse. The zooming level can be adjusted using the mouse scroll <mousebutton>wheel</mousebutton>. When the plot is zoomed out, the zooming level will be automatically limited to a default minimum value, such as the axes’ ranges are able to cover the entire plot (i.e. on vertical axis, the maximum altitude value should touch the top edge of the plot frame). The same principle is applied when the plot is panned using the mouse movement. For panning the plot, all you need to do is to click on the point of the plot you want to pan and then drag the mouse on your desired direction: left, right, up or down.
fr: Le tracé peut être facilement agrandi et déplacé à l'aide de la souris. Le niveau de zoom peut être ajusté à l'aide de la <mousebutton>molette</mousebutton> de la souris. Lorsque le tracé est dézoomé, le niveau de zoom est automatiquement limité à une valeur minimale, afin que les plages des axes puissent couvrir l'ensemble du tracé (par exemple, sur l'axe vertical, la valeur d'altitude maximale doit toucher le bord supérieur du cadre du tracé). Le même principe s'applique lorsque le graphique est déplacé à l'aide de la souris. Pour faire un panoramique du tracé, il suffit de cliquer sur le point du tracé que vous souhaitez déplacer, puis de faire glisser la souris dans la direction souhaitée : gauche, droite, haut ou bas.

source: Another useful feature that Altvstime tool provides is its ability to compute and mark the Rise/Set/Transit times. This can be accomplished by a simple press of one of the <guibutton>Rise</guibutton>, <guibutton>Set</guibutton> or <guibutton>Transit</guibutton> buttons. When one of these buttons is pressed, a filled colored circle will be marked on the curve. The color used for Rise, Set and Transit dots are: red for Rise, blue for Set and green for Transit time. For a more intuitive way of using these buttons, they are marked with the color of their specific dots. This way, the user can easily understand the plot and make the association between a certain color and its significance.
fr: Une autre fonctionnalité utile fournie par cet outil est sa capacité à calculer et à marquer les heures de lever, de coucher et de transit. Cela peut être réalisé par une simple pression sur l'un des boutons <guibutton>Lever</guibutton>, <guibutton>Coucher</guibutton> ou <guibutton>Transit</guibutton>. Lorsque l'on appuie sur l'un de ces boutons, un cercle coloré rempli sera marqué sur la courbe. Les couleurs utilisées pour les points <quote>Lever</quote>, <quote>Coucher</quote> et <quote>Transit</quote> sont : rouge pour <quote>Lever</quote>, bleu pour <quote>Coucher</quote> et vert pour <quote>Transit</quote>. Pour une utilisation plus intuitive de ces boutons, ils sont marqués de la couleur de leurs points spécifiques. De cette façon, l'utilisateur peut facilement comprendre le graphique et faire l'association entre une certaine couleur et sa signification.

source: Altvstime tool provides an easy way to find out the altitude of a sky-object at a certain moment of time using the <guibutton>Compute</guibutton> button. After you select the object from the Objects list and set the moment of time, the altitude can be computed by pressing the <guibutton>Compute</guibutton> button. But this is not the only way you can find out the altitude. Another method is to hover with mouse above one curve and thus, a tooltip containing the Local Time, Local Sidereal Time and Altitude will come up. This way, you can read the information in real time.
fr: L'outil offre un moyen facile de connaître l'altitude d'un objet du ciel à un certain moment en utilisant le bouton <guibutton>Calculer</guibutton>. Après avoir sélectionné l'objet dans la liste des objets et défini l'heure locale, l'altitude peut être calculée en appuyant sur le bouton <guibutton>Calculer</guibutton>. Mais ce n'est pas la seule façon de connaître l'altitude. Une autre méthode consiste à survoler une courbe avec la souris. Une infobulle apparaîtra contenant l'heure locale, le temps sidéral local et l'altitude. De cette façon, vous pouvez lire les informations en temps réel.

source: The Altitude of an object depends on both where you are on Earth, and on the Date. By default, the Tool adopts the Location and Date from the current &kstars; settings. You can change these parameters in the <guilabel>Date &amp; Location</guilabel> Tab. To change the Location, you can press the <guibutton>Choose City...</guibutton> button to open the <link linkend="setgeo">Set Geographic Location</link> Window, or enter Longitude and Latitude values manually in the input fields, and press the <guibutton>Update</guibutton> button. To change the Date, use the spin and combo boxes, then press <guibutton>Update</guibutton>. Note that any curves you had already plotted will be automatically updated when you change the Date and/or Location.
fr: La hauteur d'un objet dépend à la fois de votre position sur la terre et de la date. Par défaut, l'outil adopte la position et la date des réglages actuels de &kstars;. Vous pouvez changer ces paramètres dans l'onglet <guilabel>Date et position</guilabel>. Pour changer la position, vous pouvez actionner le bouton <guibutton>Choisir une ville…</guibutton> pour ouvrir la fenêtre de <link linkend="setgeo">position géographique</link>, ou indiquer les valeurs de longitude et de latitude dans les champs de saisie puis actionner le bouton <guibutton>Actualiser</guibutton>. Pour modifier la date, utilisez le bouton <guilabel>Date</guilabel> puis actionnez <guibutton>Actualiser</guibutton>. Notez que toute courbe que vous avez déjà tracée sera automatiquement mise à jour lorsque vous changerez la date et/ou la position.

source: Exercise:
fr: Exercice

source: Plot the Sun's Altitude curve. Make sure the geographic location is not near the equator. Change the Date to some time in June, and then again to sometime in January. You can see easily why we have seasons; in the winter, the Sun is above the horizon for less time (the days are shorter), and its altitude is never very high.
fr: Tracez la courbe de hauteur du Soleil. Assurez-vous que la position géographique n'est par proche de l'Équateur. Changez la date en une date en juin, puis en une date en janvier. Vous pouvez voir facilement pourquoi nous avons des saisons ; en hiver, le Soleil est au-dessus de l'horizon moins longtemps (les jours sont plus courts) et sa hauteur n'est jamais très grande.
