Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-guide.po
Languages: fr

source: <title>Guide</title>
fr: <title>Guidage</title>

source: Tools
fr: Outils

source: <tertiary>Guide</tertiary>
fr: <tertiary>Guidage</tertiary>

source: <screeninfo>Ekos Guide Module</screeninfo>
fr: <screeninfo>Module de guidage Ekos</screeninfo>

source: <phrase>Ekos Guide Module</phrase>
fr: <phrase>Module de guidage Ekos</phrase>

source: The Ekos Guide Module performs autoguiding using either the powerful built-in guider, or at your option, external guiding via <ulink url="https://openphdguiding.org/">PHD2</ulink> or <ulink url="https://sourceforge.net/projects/linguider/">lin_guider</ulink>. Using the internal guiding, guider camera frames are captured and sent to Ekos for analysis. Depending on the deviations of the stars from their lock positions, guiding pulses corrections are sent to your mount's RA and DEC axes motors. Most of the &GUI; options in the Guide Module are well documented so just hover your mouse over an item and a tooltip will popup with helpful information.
fr: Le module de guidage d'Ekos permet le guidage en utilisant soit le puissant guidage interne ou un guidage externe comme <ulink url="https://openguiding.org/">PHD2</ulink> ou encore <ulink url="https://sourceforge.net/projects/linguider/">lin_guider</ulink>. Lors de l'utilisation du guidage interne, des images de guidage sont prises et envoyées à Ekos pour analyse. Selon les déviations de l'étoile guide par rapport à sa position de verrouillage, des impulsions de correction sont envoyées aux axes d'ascension droite et de déclinaison de la monture. La plupart des options qui se trouve dans le module de guidage sont bien documentées, il vous suffit de survoler un élément et une infobulle apparaîtra contenant de l'information détaillée.

source: Setup
fr: Réglage

source: <screeninfo>Ekos Profile Guider Selection</screeninfo>
fr: <screeninfo>Sélection du profil de guidage d'Ekos</screeninfo>

source: <phrase>Ekos Profile Guider Selection</phrase>
fr: <phrase>Sélection du profil de guidage d'Ekos</phrase>

source: To perform guiding, you need (one time) to select a Guider in the Profile Editor for the profile you will be using. In the profile editor, choose Internal for the Ekos internal guider, or PHD2.
fr: Pour réaliser le guidage, vous devez (une seule fois) choisir un guide dans l'éditeur de profils pour le profil que vous allez utiliser. Choisissez Interne pour le guidage interne d'Ekos, ou PHD2 pour utiliser cet outil.

source: <screeninfo>Ekos Guider Optical Train</screeninfo>
fr: <screeninfo>Train optique du guide d'Ekos</screeninfo>

source: <phrase>Ekos Guider Optical Train</phrase>
fr: <phrase>Train optique du guide d'Ekos</phrase>

source: To perform guiding, you also need to set up your guiding optical train. This 2nd optical train is almost always different from the one you are using with capture/align/focus. See the image above for an example guider optical train configuration. Note that the telescope chosen is the guiding scope, which may be the same as your main telescope if you are using an OAG (off-axis-guiding) or ONAG guiding scheme. The camera selected is, of course, your guiding camera. The Guide Via should be your mount, assuming you are sending guide pulses directly to your mount, or the name of the ST4 device (e.g. your camera) should you be using ST4 guide pulses.
fr: Pour réaliser le guidage, vous devez également régler le train optique du guide. Ce second train optique est presque toujours différent de celui utilisé pour l'acquisition, l'alignement et la mise au point. Voyez l'image ci-dessus pour un exemple de configuration du train optique de guidage. Veuillez noter que le télescope choisi est le télescope guide, qui peut être le même que le télescope principale si vous utilisez le guidage hors axe (OAG ou « Off-Axis-Guiding » en anglais) ou sur axe (ONAG ou » On-Axis-Guiding » en anglais). L'appareil choisi est bien sûr la caméra de guidage. Le paramètre « Guide Via » devrait être votre monture, en supposant que vous envoyez des impulsions de guidage directement à la monture, ou alors le nom du périphérique ST4 (par exemple votre appareil) si vous utilisez des impulsions de guidage ST4.

source: Please look at the main guider page shown at the start of this Guider section. There are many parameters that also can be adjusted, some of which are listed below.
fr: Veuillez vous référer à la page principale de guidage en début de section sur le guidage. Il existe de nombreux autres paramètres qui peuvent être réglés, dont certains sont énumérés ci-dessous.

source: <guilabel>Exposure</guilabel>: On the main guiding page you can adjust the guiding exposure time. After the guide-camera completes the exposure, the guide algorithm computes and sends the guide pulses to the mount, then it waits a user-configurable delay, and then then begins its next exposure.
fr: <guilabel>Durée d'exposition</guilabel> : vous pouvez ajuster cette variable sur la page principale de guidage. Après que la caméra guide ait terminé son exposition, l'algorithme de guidage calcule et envoie les impulsions de guidage à la monture, puis attend un délai configurable par l'opérateur avant de démarrer la prochaine pose.

source: <guilabel>Binning</guilabel>: Pixel binning for the guide image. It usually makes sense to bin the pixels 2x2. The algorithms can still find sub-pixel star positions and send proper guide pulses to the mount.
fr: <guilabel>Regroupement de pixels</guilabel> : le regroupement de pixels pour l'image de guidage. Il fait généralement sens de regrouper les pixels en 2x2. L'algorithme peut encore trouver la position des pixels de l'étoile et envoyer des impulsions de guidage à la monture.

source: <guilabel>Box</guilabel>: This only is applicable to guide algorithms other than MultiStar, and MultiStar is the recommended guiding scheme. Size of the box enclosing the guide star. Select a suitable size that is neither too large or too small for the selected star.
fr: <guilabel>Boîte</guilabel> : cette option n'est valable que pour les algorithmes différents de Étoiles Multiples, qui est celui recommandé. Elle représente la taille de la boîte entourant l'étoile guide. Sélectionnez une taille adaptée qui ne doit être ni trop grande ni trop petite pour l'étoile sélectionnée.

source: <guilabel>Directions</guilabel>: Typically you want to keep all the directions boxes checked. Unchecking them will disable guiding in those directions. For instance it is possible to disable DEC guiding in the North direction.
fr: <guilabel>Direction</guilabel> : vous souhaitez typiquement conserver toutes les cases de direction cochées. En les décochant, vous désactiverez le guidage dans ces directions. Par exemple il est possible de désactiver le guidage en déclinaison dans la direction du Nord.

source: <guilabel>Dark</guilabel>: Check this to enable dark-frame corrections to your guiding image. See below.
fr: <guilabel>Dark</guilabel> : cochez pour activer les corrections en tenant compte des trames sombres de vos images de guidage. Voir ci-dessous.

source: <guilabel>Clear Calibration</guilabel>: Check this to delete your calibration data. See the calibration section below.
fr: <guilabel>Effacer la calibration</guilabel> : cochez pour effacer les données de calibration. Voir la section de calibration ci-dessous.

source: <guilabel>Subframe, AutoStar</guilabel>: These only apply to guide algorithms other than MultiStar, and MultiStar is the recommended guiding scheme.
fr: <guilabel>Sous-trames, Étoile automatique</guilabel> : ne s'applique qu'aux algorithmes différents de Étoiles Multiples, qui est celui recommandé.

source: <screeninfo>Calibration Settings</screeninfo>
fr: <screeninfo>Réglages de la calibration</screeninfo>

source: <phrase>Calibration Settings</phrase>
fr: <phrase>Réglages de la calibration</phrase>

source: Autoguiding is a two-step process: Calibration &amp; Guiding. Calibration is needed for the scheme to understand the camera's orientation, relative to the RA and DEC axes, and also the effects of guide pulses (e.g. how much a 100ms RA guide pulse will typically move the RA axis). Once it estimates these values, the guider can correct the mount's position effectively. You can see calibrated values for those parameters in the above image in the "Calibrated Values" section.
fr: Le guidage automatique est un processus en deux étapes : la calibration et le guidage. La calibration est nécessaire pour connaître l'orientation de l'appareil, relativement aux axes d'ascension droite et de déclinaison, ainsi que les effets des impulsions de guidage (le déplacement de l'axe d'ascension droite pour une impulsion de 100ms par exemple). Une fois que ces valeurs sont estimées, le guide peut corriger la position de la monture de manière efficace. Vous pouvez voir les valeurs calibrées pour ces paramètres dans l'image ci-dessus dans la section « Valeurs calibrées ».

source: Similar to other guiders, we recommend that you carefully calibrate once, and then only re-calibrate when necessary. It is necessary to re-calibrate when the camera is moved (e.g. rotate) relative to the mount. It should not be necessary to calibrate every time you slew the mount. You should calibrate when pointing near the Meridian and along the Celestial Equator (probably just West of it). Guiding (and guide calibration) is problematic near the pole--it probably won't work. <ulink url="https://openphdguiding.org/PHD2_BestPractices_2019-12.pdf">This slide show</ulink> contains good advice on how to calibrate the Internal Guider and/or PHD2.
fr: De manière similaire aux autres guides, il est recommandé de réaliser une calibration soigneuse une première fois, afin de ne refaire l'opération que si c'est vraiment nécessaire, par exemple si l'appareil est déplacé relativement à la monture. Il ne devrait pas être nécessaire de calibrer à chaque rotation de la monture. Vous devriez calibrer quand vous pointez près du méridien et le long de l'équateur céleste (et probablement seulement à l'ouest de ce dernier). Le guidage (et sa calibration) est problématique près des pôles et ne fonctionnera probablement pas. Ce <ulink url="https://openphdguiding.org/PHD2_BestPractices_2019-12.pdf">document</ulink> contient de bons conseils sur la manière de calibrer le guide interne ainsi que PHD2.

source: The important options on the calibration options page (above) are:
fr: Les options importantes de calibrations sont :

source: <guilabel>Pulse Size</guilabel>: should be large enough to move your image a few pixels.
fr: <guilabel>Taille d'impulsion</guilabel> : elle devrait être assez importante pour déplacer l'image de quelques pixels.

source: <guilabel>Re-using Calibration</guilabel>: There are two checkboxes related to keeping your calibration. We recommend checking "Store and re-use guide calibration when possible", and un-checking "Reset Guide Calibration After Each Mount Slew".
fr: <guilabel>Réutiliser la calibration</guilabel> : il existe deux cases à cocher liées à la conservation de la calibration. Nous recommandons de cocher « Enregistrer et réutiliser la calibration quand c'est possible » et de décocher « Réinitialiser la calibration du guide après chaque rotation de la monture ».

source: <guilabel>Reverse DEC...</guilabel>: It is also important to check or un-check (it is mount dependent) "Reverse DEC on pier-side change when re-using calibration". To find out the right setting for your mount, you need to successfully calibrate on one pier side, make sure guiding is working well on that side, then switch to the other side. Guide for a minute or two. If DEC runs away, then you probably have the wrong setting for the "Reverse DEC..." checkbox.
fr: <guilabel>Inverser la déclinaison…</guilabel> : il est également important de cocher ou décocher cette option selon le type de monture. Pour découvrir le réglage adéquat pour votre monture, vous devez avoir une calibration réussie d'un côté du pied, vous assurer que le guidage fonctionne bien de ce côté, puis passer à l'autre côté. Ensuite guider pendant une minute ou deux. Si vous observez une dérive de la déclinaison, c'est que vous avez probablement le mauvais réglage pour cette option.

source: <guilabel>Max Move, Iterations</guilabel>: We recommend you keep iterations large (e.g. 10) and Max Move large (e.g. 20+ pixels). This way you should get a good estimate of the guiding calibration parameters. Calibration should be something you do rarely, so it is best to take a little extra time and get right.
fr: <guilabel>Déplacement maximal, itérations</guilabel> : nous recommandons de conserver une valeur importante pour les itérations (p. ex. 10) ainsi que pour le déplacement maximal (p. ex. plus de 20 pixels). Ainsi vous devriez obtenir une bonne estimation des paramètres de calibration de guidage. La calibration est une opération que vous ne devriez faire que rarement, donc prenez un peu plus de temps pour la faire correctement.

source: To (re)calibrate, clear your calibration on the main guiding page, and then simply click on the <guibutton>Guide</guibutton> button. Note that if calibration was already completed successfully before, and you didn't clear the calibration, and you are re-using calibrations, then the autoguiding process will begin immediately, otherwise, it will start the calibration process.
fr: Pour (re)calibrer, effacer les données de calibration sur la page principale de calibration et ensuite cliquez sur le bouton <guibutton>Guider</guibutton>. Veuillez noter que si une calibration réussie existe déjà, que vous n'avez pas effacé les données de calibration et que vous la réutiliser, alors le processus de guidage automatique démarrera immédiatement, sinon c'est le processus de calibration qui démarrera.

source: Ekos begins the calibration process by sending pulses to move the mount in RA and DEC. It pulses out the RA axis, then pulses it back in. After that it moves a little in DEC to clear and backlash that might exist, and then pulses out and back in for DEC. To view this graphically, click on the "Calibration Plot" subtab on the main guiding page.
fr: Ekos débute la procédure de calibration en envoyant des impulsions à la monture pour la déplacer en AD et en DEC. D'abord à l'extérieur de l'axe AD, puis vers l'intérieur. Ensuite, il fait pareil en DEC pour compenser un éventuel jeu. Cela peut être visualisé graphiquement en cliquant sur « Afficher calibration » de la page principal de guidage.

source: Calibration Failures
fr: Échecs de la calibration

source: Calibration can fail for a variety of reasons. To improve the chances of success, try the tips below.
fr: La calibration peut échouer pour plusieurs raisons. Pour augmenter les chances de succès, vous pouvez essayer les astuces suivantes.

source: Bad sky conditions. If your sky condition are not great, it may not be worth fighting guiding/calibration.
fr: Mauvaises conditions du ciel. Si les conditions du ciel ne sont pas bonnes, il ne vaut mieux ne pas se battre avec le guidage et la calibration.

source: Guide camera focus.
fr: Mise au point de l'appareil de guidage

source: Leave algorithm to the default value (<guimenuitem>SEP MultiStar</guimenuitem>) in the Guide Option tab.
fr: Laissez l'algorithme à sa valeur par défaut (<guimenuitem>SEP Étoiles multiples</guimenuitem>) dans l'onglet des options de guidage.

source: Try the "Guide-Default" SEP star-detection parameters (in the Guide Option tab) and adjust them if necessary.
fr: Essayez les valeurs par défaut des paramètres de détection d'étoiles SEP et ajustez-les si nécessaire.

source: <guilabel>Better Polar Alignment</guilabel>: This is critical to the success of any astrophotography session. Use the Ekos <link linkend="ekos-align-polaralignment">Polar Alignment procedure</link> in the <guilabel>Align</guilabel> module.
fr: <guilabel>Meilleur alignement polaire</guilabel> : c'est un point critique pour assurer le succès de toute session d'imagerie. Utilisez la <link linkend="ekos-align-polaralignment">procédure d'alignement polaire</link> d'Ekos du module d'<guilabel>alignement</guilabel> d'Ekos.

source: <guilabel>Set binning to 2x2</guilabel>: Binning improves SNR and is often very important to the success of the calibration and guiding procedures.
fr: <guilabel>Réglez le groupement de pixels sur 2x2</guilabel> : le groupement de pixels augmente le rapport signal sur bruit et est souvent très important pour le succès des procédures de calibration et de guidage.

source: Take dark frames to reduce noise.
fr: Prenez des trames Dark pour réduire le bruit.

source: Guiding
fr: Guidage

source: <screeninfo>Guide Settings</screeninfo>
fr: <screeninfo>Réglages du guidage</screeninfo>

source: <phrase>Guide Settings</phrase>
fr: <phrase>Réglages du guidage</phrase>

source: Once the calibration process is completed successfully, guiding begins automatically. The guiding performance is displayed in the <guilabel>Drift Graphics</guilabel> region where <guilabel>Green</guilabel> reflects deviations in RA and <guilabel>Blue</guilabel> deviations in DEC. The colors of the RA/DE lines can be changed in <link linkend="colors">&kstars; color scheme</link> in &kstars; settings dialog. The vertical axis denotes the deviation in arcsecs from the lock position and the horizontal axis denotes time. You can hover over the line to get the exact deviation at this particular point in time. You can also zoom and drag/pan the graph to inspect a specific region of the graph. Another convenient place to examine guiding performance is in the Analyze tab.
fr: Une fois que la procédure de calibration s'est terminée avec succès, le guidage débutera automatiquement. Les performances de guidage sont affichées dans le <guilabel>graphique de la dérive</guilabel> où la déviation en AD est tracée en <guilabel>vert</guilabel> et la déviation en DEC en <guilabel>bleu</guilabel>. Ces couleurs peuvent être modifiées dans le <link linkend="colors">schéma de couleurs de &kstars;</link> dans &kstars;. L'axe vertical désigne la déviation en secondes d'arc de la position de verrouillage et l'axe horizontal représente le temps. Vous pouvez survoler les lignes pour connaître les déviations exactes à chaque instant. De plus, vous pouvez zoomer et déplacer le graphique pour inspecter une zone particulière. Un autre endroit pratique pour analyser les performances de guidage se trouve dans l'onglet Analyser.

source: Ekos can utilize multiple algorithms to determine the drift from the (original) lock position, but by far the most accurate is the (default) SEP MultiStar algorithm. It uses the detected position of many stars (in the above settings, up to 50) to determine its best estimate for the current drift. It is dependent on accurate star detection. Thus, it may be important to adjust star-detection parameters. Start with the default Guide-Default SEP profile, and optionally edit its parameters if you feel stars are not being detected accurately.
fr: Ekos peut utiliser plusieurs algorithmes pour déterminer la dérive de la position initiale de verrouillage, mais la plus précise de loin est l'algorithme SEP Étoiles Multiples. Il détecte la position de plusieurs étoiles (50 dans le réglages ci-dessus) pour déterminer la meilleure estimation de la dérive. Il dépend de la détection précise des étoiles. Il est ainsi important d'ajuster finement les paramètres de détection d'étoiles. Commencez par le profil SEP par défaut et modifier les valeurs si vous sentez que les étoiles ne sont pas détectées suffisamment précisément.

source: Here are some of the parameters you may want to adjust. Again, good advice in choosing parameters is available on the internet, e.g. from <ulink url="https://openphdguiding.org/PHD2_BestPractices_2019-12.pdf">the above slideshow</ulink>.
fr: Voici quelques paramètres que vous pourriez souhaiter ajuster. De bons conseils se trouvent sur Internet et en particulier dans ce <ulink url="https://openphdguiding.org/PHD2_BestPractices_2019-12.pdf">document</ulink>.

source: Aggressiveness. How quickly you want the guider to correct the error. Values of 0.5 or 0.6 are usually best (i.e. correcting about half the observed error). Unintuitively, it seems that correcting 100% of the error can cause poor performance as the guider will often oscillate with overcorrections.
fr: L'agressivité. Ce paramètre définit la vitesse à laquelle le guide devrait corriger les erreurs. Les bonnes valeurs sont généralement 0.5 ou 0.6 (on corrige environ la moitié des erreurs observées). De manière assez contre-intuitive, corriger 100% des erreurs peut engendrer de mauvaises performances puisque le guide va se mettre à osciller trop fréquemment pour tenir compte des ces corrections trop importantes.

source: Algorithm. We strongly recommend you use the most up-to-date algorithm: SEP MultiStar. Pretty much the only reason not to would be if you can't get your SEP star-detection to perform adequately.
fr: Algorithme. Nous vous recommandons fortement d'utiliser l'algorithme le plus à jour : SEP Étoiles Multiples. La seule raison de ne pas l'utiliser est que vous n'arrivez pas à obtenir une détection d'étoiles performantes.

source: SEP Profile. Start with Guide-Default, though you may choose others if you have very large or small stars (in terms of number of pixels in diameter).
fr: Profil SEP. Commencez avec le profil de guidage par défaut, sauf si vous pointez un endroit du ciel avec des très grandes ou de très petites étoiles (en terme de nombre de pixel par diamètre).

source: Dithering
fr: Déviations

source: <screeninfo>Dithering Settings</screeninfo>
fr: <screeninfo>Réglages des déviations</screeninfo>

source: <phrase>Dithering Settings</phrase>
fr: <phrase>Réglages des déviations</phrase>

source: To enable automatic dithering between frames, make sure to check the <guilabel>Dither</guilabel> checkbox. By default, Ekos should dither (&ie; move) the guiding box by up to 3 pixels after every N frames captured in <link linkend="ekos-capture">Ekos Capture Module</link>. The motion duration and direction are randomized. Since the guiding performance can oscillate immediately after dithering, you can set the appropriate <guilabel>Settle</guilabel> duration to wait after dither is complete before resuming the capture process. In rare cases where the dithering process can get stuck in an endless loop, set the appropriate <guilabel>Timeout</guilabel> to abort the process. But even if dithering fails, you can select whether this failure should terminate the autoguiding process or not. Toggle <guilabel>Abort Autoguide on failure</guilabel> to select the desired behavior.
fr: Pour activer les mini-déviations (dithering) automatiques entre les poses, assurez-vous de cocher la case <guilabel>Déviations</guilabel>. Par défaut, Ekos déplacera la boîte de guidage jusqu'à trois pixels après chaque N acquisitions dans le <link linkend="ekos-capture">module d'acquisition</link>. La durée de déplacement et sa direction sont aléatoires. Comme la performance de guidage peut osciller juste après le déplacement, vous pouvez configurer une durée de <guilabel>stabilisation</guilabel> avant la poursuite de la procédure d'acquisition. Dans les rares cas où la procédure de mini-déviations se bloque dans une boucle sans fin, vous pouvez configurer un <guilabel>délai maximal</guilabel> adéquat pour annuler la procédure. Mais même dans ce cas, vous pouvez choisir si cet échec doit mettre fin à la procédure de guidage automatique ou non. L'option <guilabel>Abandonner guidage automatique si échec</guilabel> permet de configurer le comportement souhaité.
