Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_julianday.po
Languages: fr

source: <title>Julian Day</title>
fr: <title>Jour julien</title>

source: <primary>Julian Day</primary>
fr: <primary>Jour julien</primary>

source: Julian Days are a way of reckoning the current date by a simple count of the number of days that have passed since some remote, arbitrary date. This number of days is called the <firstterm>Julian Day</firstterm>, abbreviated as <abbrev>JD</abbrev>. The starting point, <abbrev>JD=0</abbrev>, is January 1, 4713 BC (or -4712 January 1, since there was no year '0'). Julian Days are very useful because they make it easy to determine the number of days between two events by simply subtracting their Julian Day numbers. Such a calculation is difficult for the standard (Gregorian) calendar, because days are grouped into months, which contain a variable number of days, and there is the added complication of <link linkend="ai-leapyear">Leap Years</link>.
fr: Les jours juliens sont un moyen de trouver la date courante en comptant le nombre de jours qui se sont écoulés depuis une date lointaine quelconque. Ce nombre de jours s'appelle le <firstterm>jour julien</firstterm>, abréviation <abbrev>JJ</abbrev>. Le point de départ, <abbrev>JJ=0</abbrev>, est le 1<superscript>er</superscript> janvier 4713 avant J.-C. (ou 1<superscript>er</superscript> janvier -4712, puisqu'il n'y a pas d'an 0). Les jours juliens sont très utiles parce qu'ils permettent de déterminer facilement le nombre de jours entre deux évènements simplement en soustrayant les deux jours juliens. Un tel calcul est plus difficile avec le calendrier standard (grégorien) puisque les jours sont groupés en mois, qui contiennent un nombre variable de jours sans compter les difficultés additionnelles liées aux <link linkend="ai-leapyear">années bissextiles</link>.

source: Converting from the standard (Gregorian) calendar to Julian Days and vice versa is best left to a special program written to do this, such as the &kstars; <link linkend="tool-calculator">Astrocalculator</link>. However, for those interested, here is a simple example of a Gregorian to Julian day converter:
fr: Il est préférable d'effectuer les conversions entre calendrier grégorien et calendrier julien à l'aide de programmes spécialisés comme la <link linkend="tool-calculator">calculette astronomique</link>. Mais pour les curieux, voici un exemple de convertisseur de jour grégorien en julien :

source: <abbrev>JD</abbrev> = <abbrev>D</abbrev> - 32075 + 1461*( <abbrev>Y</abbrev> + 4800 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 4 + 367*( <abbrev>M</abbrev> - 2 - ( <abbrev>M</abbrev> - 14 ) / 12 * 12 ) / 12 - 3*( ( <abbrev>Y</abbrev> + 4900 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 100 ) / 4
fr: <abbrev>JJ</abbrev> = <abbrev>J</abbrev> - 32075 + 1461*( <abbrev>A</abbrev> + 4800 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 4+ 367*( <abbrev>M</abbrev> - 2 - ( <abbrev>M</abbrev> - 14 ) / 12 * 12 ) / 12- 3*( ( <abbrev>A</abbrev> + 4900 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 100 ) / 4

source: where <abbrev>D</abbrev> is the day (1-31), <abbrev>M</abbrev> is the Month (1-12), and <abbrev>Y</abbrev> is the year (1801-2099). Note that this formula only works for dates between 1801 and 2099. More remote dates require a more complicated transformation.
fr: où <abbrev>J</abbrev> est le jour (1-31), <abbrev>M</abbrev> est le mois (1-12), et <abbrev>A</abbrev> est l'année (1801-2099). Notez que cette formule fonctionne seulement pour les dates entre 1801 et 2099. Les dates plus lointaines nécessitent des calculs plus complexes.

source: An example Julian Day is: <abbrev>JD</abbrev> 2440588, which corresponds to 1 Jan, 1970.
fr: Un exemple de jour julien : <abbrev>JJ</abbrev> 2440588, qui correspond à la date du 1<superscript>er</superscript> janvier 1970.

source: Julian Days can also be used to tell time; the time of day is expressed as a fraction of a full day, with 12:00 noon (not midnight) as the zero point. So, 3:00 pm on 1 Jan 1970 is <abbrev>JD</abbrev> 2440588.125 (since 3:00 pm is 3 hours since noon, and 3/24 = 0.125 day). Note that the Julian Day is always determined from <link linkend="ai-utime">Universal Time</link>, not Local Time.
fr: Les jours juliens servent aussi à déterminer l'heure, exprimée en une fraction d'une journée complète, ayant 12:00 (midi) comme point zéro. Donc, 15:00 le 1<superscript>er</superscript> janvier 1970 est <abbrev>JJ</abbrev> 2440599.125 (trois heures séparent 15:00 et 12:00, et 3/24 = 0.125). Notez que l'on calcule toujours le jour julien à partir de l'<link linkend="ai-utime">heure universelle</link>, et non pas l'heure locale.

source: Astronomers use certain Julian Day values as important reference points, called <link linkend="ai-epoch">Epochs</link>. One widely-used epoch is called J2000; it is the Julian Day for 1 Jan, 2000 at 12:00 noon = <abbrev>JD</abbrev> 2451545.0.
fr: Les astronomes qui utilisent certains jours juliens comme référence leur donnent le nom d'<link linkend="ai-epoch">époque</link>. Un exemple d'époque utile est J2000 ; il s'agit du jour julien pour le 1<superscript>er</superscript> janvier 2000 à 12:00 ou <abbrev>JJ</abbrev> 2451545,0.

source: Much more information on Julian Days is available on the internet. A good starting point is the <ulink url="http://aa.usno.navy.mil/faq/docs/JD_Formula.html">U.S. Naval Observatory</ulink>. If that site is not available when you read this, try searching for <quote>Julian Day</quote> with your favorite search engine.
fr: Beaucoup plus d'informations sur les jours juliens sont disponibles sur Internet. Un bon point de départ est le <ulink url="https://aa.usno.navy.mil/faq/JD_formula.html">U.S. Naval Observatory</ulink>. Si ce lien n'est plus valable, essayez le terme <quote>Julian Day</quote> dans votre moteur de recherche favori.
