Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-scheduler.po
Languages: fr

source: <title>Scheduler</title>
fr: <title>Ordonnanceur</title>

source: Tools
fr: Outils

source: <tertiary>Scheduler</tertiary>
fr: <tertiary>Ordonnanceur</tertiary>

source: <screeninfo>Ekos Scheduler Module</screeninfo>
fr: <screeninfo>Module Ordonnanceur Ekos</screeninfo>

source: <phrase>Ekos Scheduler Module</phrase>
fr: <phrase>Module Ordonnanceur Ekos</phrase>

source: The Ekos Scheduler is an important component of your imaging workflow. It connects to INDI, starts and stops all the other Ekos modules, schedules jobs according to their constraints and priorities, monitors those jobs as they execute, and then safely brings down the system when jobs are done, or before dawn. Whether you are running multi-day imaging sessions for multiple targets, or simply trying to image a single target for a few hours, it is advisable to have the Scheduler control your imaging sessions.
fr: L'ordonnanceur d'Ekos est un composant important dans le flux de travail de l'imagerie. Il se connecte à INDI, démarre et arrête tous les autres modules d'Ekos, organise les tâches en tenant compte des contraintes et priorités, les surveille lorsqu'elles sont exécutées et arrête le système de manière sécurisée quand elles sont terminées ou avant l'aube. Que vous imagiez plusieurs cibles sur plusieurs nuits ou simplement une seule cible pendant quelques heures, il est conseillé d'utiliser l'ordonnanceur pour contrôler les sessions d'imagerie.

source: Scheduler Table
fr: Table de l'ordonnanceur

source: The heart of the Scheduler is a table displaying the list of Scheduler jobs the user wants to run. Associated with each jobs are attributes (mostly described in the settings section below). The attributes describe the name of the job, where the telescope should be pointed when imaging that job, a description of what types of images should be captured, constraints about when the jobs should run (&eg; altitude, twilight, moon, landscape blockages, &etc;), things that need to be done before and after the job is run, and strategies for dealing with errors.
fr: Le cœur de l'ordonnanceur est une table affichant la liste des tâches prévues par l'opérateur. À chaque tâche est associée des attributs (décrits dans la section de configuration ci-dessous). Les attributs sont le nom de la tâche, la position vers laquelle le télescope doit pointer pour cette tâche, une description des types d'images à acquérir, les contraintes de la tâche (p. ex. l'altitude, le crépuscule, la lune, les obstructions du paysage, &etc;), ainsi que toutes les choses qui doivent être accomplies avant et après la tâche, ainsi que les stratégies à adopter en cas d'erreurs.

source: You can add, delete, modify or change the order of rows in the Scheduler table.
fr: Vous pouvez ajouter, supprimer, modifier ou changer l'ordre des tâches dans la tables de l'ordonnanceur.

source: You can add a Scheduler job row into the table by clicking the <guilabel>+</guilabel> control above the table, if all required attributes are filled out (name, position, and sequence file).
fr: Vous pouvez ajouter une ligne de tâche dans l'ordonnanceur en cliquant sur le bouton <guilabel>+</guilabel> au-dessus de la table, si tous les attributs requis sont renseignées (nom, position et fichier de séquence).

source: If you click on a row, you can then click the <guilabel>-</guilabel> control above the table to delete that row.
fr: Si une ligne est sélectionnée, vous pouvez la supprimer en cliquant sur le bouton <guilabel>-</guilabel> au-dessus de la table.

source: If you click on a row, you can then click the <guilabel>^</guilabel> or <guilabel>v</guilabel> controls to move those rows up or down in the job list.
fr: En cliquant sur une ligne, vous pouvez la monter avec le bouton <guilabel>^</guilabel> ou la descendre avec le bouton <guilabel>v</guilabel> dans la liste de tâches.

source: If you double click on a row, the attributes of that job are filled in to the various settings on the Scheduler page. You can then change one or more of those attributes, and then click the checkmark above the table (after your double-click, the <guilabel>+</guilabel> became a <guilabel>checkmark</guilabel>), and the new attributes are assigned to that job.
fr: En double-cliquant sur une ligne, les attributs de cette tâche seront renseignés avec les différents réglages de la page de l'ordonnanceur. Vous pouvez ensuite modifier un ou plusieurs attributs et ensuite cliquer sur la coche au-dessus de la table (après avoir double-cliqué, le bouton <guilabel>+</guilabel> devint une <guilabel>coche</guilabel>), et les nouveaux attributs seront assignées à cette tâche.

source: Scheduling Algorithm
fr: Algorithme de l'ordonnanceur

source: The Scheduler table (above) lists jobs in order of priority, with higher jobs (on lower-numbered rows) having higher priority than jobs further down the list (with higher-numbered rows).
fr: La table ci-dessus dresse la liste des tâches par ordre de priorité, avec les tâches plus haute (de numéro de ligne plus basse) ayant la plus haute priorité que celles plus bas dans la liste (de numéro de ligne plus haut).

source: The Scheduler regularly plans (and re-plans) which jobs should be run, and when. It can start executing a given job, and then later preempt that job for a new one. It can become idle if no jobs can be run (&eg; in daylight), and sleep until such a time that it becomes active again. Its aim is to keep the equipment as busy as possible, while respecting the scheduler-table's priorities. Here's how it works.
fr: L'ordonnanceur revoit régulièrement l'ordre des tâches et le moment où elles doivent être lancées. Il peut lancer une tâche puis plus tard, temporairement la mettre en pause en faveur d'une autre. Il peut devenir inactif si aucune tâche ne peut être lancée (p. ex. durant le jour) et rester dans cet état jusqu'à ce qu'une tâche peut être lancée. Le but est de conserver l'équipement le plus occupé possible tout en respectant les priorités de la table. Voici comment il fonctionne.

source: When the scheduler starts (or when it replans, which it does every second while active), it looks through the entire list of jobs, starting at the highest priority job, and working its way down to the lowest priority one if necessary. When it finds a job that can run, it starts that job, possibly preempting the currently running job. A jobs can run if its constraints are met, &eg; the target is not blocked by the local terrain, it meets the minimum altitude constraint, it has not already completed all the desired imaging, ...
fr: Quand l'ordonnanceur démarre (ou quand il revoit ses plans, ce qu'il fait toutes les secondes quand il est actif), il passe à travers toute la liste de tâches, en commençant par celle de plus haute priorité, jusqu'à celle de plus basse priorité. Quand il trouve une tâche qui peut être lancée, il le fait, même s'il doit même en pause une tâche en cours. Une tâche peut être lancée que si elle rempli toutes les contraintes, p. ex., la cible n'est pas bloquée par l'environnement (un arbre par exemple) et qu'elle satisfait la contrainte d'altitude minimale ou encore qu'elle n'a pas terminé toutes les acquisitions souhaitées.

source: The algorithm shows its projected next start times and stop times for all job in the Scheduler table. It also shows its estimate of times jobs will run during the next 48 hours in the log panel at the bottom of the window. See the screenshot of the scheduler window at the top of this section.
fr: L'algorithme montre l'heure projetée de départ et d'arrêt pour toutes les tâches de la table de l'ordonnanceur. Il affiche également une estimation de la durée d'exécution pour les 48 prochaines heures dans le panneau de journalisation situé au bas de la fenêtre. Veuillez voir la capture d'écran au début de cette section.

source: The scheduling algorithm described in the above paragraph is known as the Greedy Scheduling algorithm. It is the recommended one to use. In previous versions of Ekos, there was another "Classic scheduling algorithm" which is no longer in Ekos. That scheme could not preempt running jobs, and thus did not make as much use of the equipment as the Greedy Algorithm.
fr: L'algorithme décrit ci-dessus est connu comme l'algorithme Greedy. C'est celui qui est recommandé. Dans des versions précédentes d'Ekos, il y avait un autre algorithme, nommé Classique, qui est en phase d'être abandonnée. Il ne pouvait pas mettre en pause une tâche en faveur d'une autre et donc n'optimisait pas l'équipement autant que l'algorithme Greedy.

source: There is a checkbox option in the scheduler options menu called <guilabel>Use greedy scheduling</guilabel> which defaults to being checked. The system works as described above when it is checked. When it is unchecked the scheduler is prevented from scheduling lower priority jobs when uncompleted higher priority jobs cannot run. This results in less efficient use of the system, but may give you more control over scheduling.
fr: Il y a une option à cocher dans le menu des options de l'ordonnanceur nommée <guilabel>Utiliser l'ordonnanceur Greedy</guilabel> qui est cochée par défaut. Le système fonctionne comme décrit ci-dessus quand elle est cochée. Lorsqu'elle est décochée, le système est empêché de traiter les tâches de plus basse priorité si les tâches de plus haute priorité ne peuvent être exécutées. L'efficacité de l'utilisation du système est moindre mais donne davantage de contrôle sur l'ordonnanceur.

source: Scheduler Files (.esl)
fr: Fichiers séquences (.esl)

source: The scheduler table with its list of jobs and attributes can be saved onto disk and read back in. It writes an .esl file. Controls for writing the current Scheduler table to disk, and reading back other .esl files are located above the table to the right.
fr: La table de l'ordonnanceur avec sa liste de tâches peut être enregistrée sur le disque dur pour pouvoir être réimportée plus tard. Ces données sont enregistrées dans un fichier .esl. Les boutons pour cela ainsi que pour importer d'autres fichiers .esl de séquence se trouvent au-dessus de la table sur la droite.

source: Settings
fr: Réglages

source: Ekos Scheduler provides a simple interface to aid the user in setting the conditions and constraints required for an Scheduler job. You must select the <guilabel>Target</guilabel>, its coordinates, and the <guilabel>Sequence</guilabel> before you can add a job to the Scheduler.
fr: L'ordonnanceur d'Ekos propose une interface simple pour aider l'utilisateur à configurer les conditions et les contraintes requises pour une tâche d'observation. Pour ajouter une tâche, il faut d'abord choisir une cible et ses coordonnées ainsi que le fichier de séquence.

source: Each Scheduler job is composed of the following:
fr: Chaque tâche de l'ordonnanceur est composée de :

source: <guilabel>Target name and coordinates</guilabel>: Select target from the <link linkend="findobjects">Find Dialog</link> or <guibutton>Add</guibutton> it from <link linkend="tool-obsplanner">Observation Planner</link>. You can also enter a custom name. Coordinates can also be copied from the SkyMap using the button just to the right of the coordinates.
fr: <guilabel>Nom de la cible et ses coordonnées</guilabel> : sélectionnez la cible depuis la <link linkend="findobjects">Boîte de recherche</link> ou <guibutton>Ajouter</guibutton> la cible depuis le <link linkend="tool-obsplanner">Planificateur d'observation</link>. Vous pouvez également indiquer un nom personnalisé. Les coordonnées peuvent également être copiées à partir de la carte du ciel en utilisant le bouton situé à la droite des coordonnées.

source: Optional <guilabel>PA</guilabel>: The position angle (or image rotation) can be specified for systems with camera rotation hardware.
fr: Le <guilabel>AP</guilabel> facultatif : l'angle de position (ou rotation de l'image) peut être indiquée pour les appareils possédant la capacité physique de tourner l'appareil.

source: Optional <guilabel>FITS File</guilabel>: If a FITS file is specified, the astrometry solver solves the file and use the central RA/DEC as the target coordinates.
fr: Un <guilabel>fichier Fits</guilabel> facultatif : si vous spécifiez un fichier FITS, le résolveur astrométrique résoudra le fichier et utilisera la position centrale en AD et DEC comme coordonnées cibles.

source: <guilabel>Sequence</guilabel> file: The sequence file is constructed in the Ekos <link linkend="ekos-capture">Capture Module</link>. It has a list of capture specifications, where each spec details the number of images to capture, which filter to use, the exposure length, the gain, file naming details, temperature settings, prefixes, download directory, &etc;
fr: Un fichier <guilabel>Séquence</guilabel> : le fichier est (préalablement) construit dans le <link linkend="ekos-capture">module d'acquisition</link>. Il contient une liste de spécifications pour l'acquisition où chacune détaille le nombre d'images à acquérir, les filtres à utiliser, la durée d'exposition, le gain, les détails de nommage du fichier, les réglages de température, les préfixes, le dossier d'enregistrement, &etc;.

source: <guilabel>Profile</guilabel>: Select which equipment profile to utilize when starting Ekos. If Ekos &amp; INDI are already started and online, this selection is ignored.
fr: <guilabel>Profil</guilabel> : spécifie le profil d'équipement à utiliser au démarrage d'Ekos. Si Ekos &amp; INDI sont déjà démarrés, cette option est ignorée.

source: <guilabel>Steps</guilabel>: The user selects what steps should be taken at the start of the job. The possibilities are: (1) Start mount tracking, (2) autofocus, (3) run a plate solving alignment, (4) start the auto-guider. One or more can be chosen.
fr: <guilabel>Étapes</guilabel> : l'opérateur choisit les étapes au démarrage de la tâche. Les possibilités sont 1) Démarrer le suivi, 2) La mise au point automatique, 3) Le lancement de la procédure d'alignement par la résolution, 4) Le démarrage du guidage automatique. Une ou plusieurs de ces étapes peuvent être sélectionnées.

source: <guilabel>Startup Conditions</guilabel>: Conditions that must be met <emphasis role="bold">before</emphasis> the Scheduler job is started. Currently, the user may select to start as soon as possible, <guimenuitem>ASAP</guimenuitem>, or when the target is near or past culmination, or at a specific time.
fr: <guilabel>Conditions de démarrage</guilabel> : spécifie les conditions qui doivent être satisfaites <emphasis role="bold">avant</emphasis> que la tâche ne soit démarrée. Présentement, l'utilisateur peut choisir de démarrer aussi vite que possible (<guimenuitem>ASAP</guimenuitem>), ou quand la cible est près ou a passé la culmination ou enfin à une heure spécifique.

source: <guilabel>Constraints</guilabel>: These are conditions that must be met <emphasis role="bold">at all times</emphasis> during the Scheduler job execution process. These include minimum target altitude, minimum moon separation, twilight observation, artificial horizon altitude constraints, and weather monitoring.
fr: <guilabel>Contraintes</guilabel> : ce sont des conditions qui doivent être remplies <emphasis role="bold">à tout moment</emphasis> durant le processus d'exécution des tâches. Cela inclut l'altitude minimum de la cible, l'élongation minimale de la Lune, l'observation du crépuscule, les contraintes d'altitude des horizons artificiels et enfin les conditions météorologiques.

source: <guilabel>Completion Conditions</guilabel>: Conditions that trigger completion of the Scheduler job. The default selection is to simply mark the Scheduler job as complete once the sequence process is complete. Additional conditions enable the user to repeat the sequence process a number of times or indefinitely, or up until a specific time.
fr: <guilabel>Condition d'achèvement</guilabel> : spécifie les conditions d'achèvement de la tâche d'observation. La sélection par défaut est de noter la tâche comme étant terminée une fois que le processus est achevé. Des conditions additionnelles permettent à l'utilisateur de répéter la séquence un certain nombre de fois ou indéfiniment ou jusqu'à une heure spécifique.

source: Other options
fr: Autres options

source: There are several other options to control how the Scheduler behaves. These are found in the general KStars Settings menu, shown below, in its Ekos tab and Scheduler sub-tab.
fr: Il existe plusieurs autres options pour contrôler le comportement de l'ordonnanceur. Elles se trouvent dans le menu de réglage de KStars, affiché ci-dessous, dans l'onglet Ekos et le sous-onglet de l'ordonnanceur.

source: <screeninfo>Scheduler Settings</screeninfo>
fr: <screeninfo>Réglages de l'ordonnanceur</screeninfo>

source: <phrase>Scheduler Settings</phrase>
fr: <phrase>Réglages de l'ordonnanceur</phrase>

source: Remember job progress
fr: Se souvenir de la progression de la tâche

source: Among the settings shown above, one important one is known as <guilabel>Remember job progress</guilabel>. When this box is checked and a job is running, the Scheduler looks at the job's images already captured on disk, and doesn't re-capture the ones that are already there. The benefit is that if a job is restarted, or re-run another night, or if multiple jobs are being run together, stopping and starting when they are runnable, then jobs re-start right where they left off. This works well with the <guilabel>Repeat until terminated</guilabel> job-completion option. If <guilabel>Remember job progress</guilabel> is unchecked, jobs would restart from the start of their sequence specification each time, which probably isn't what you want. Unfortunately, if the images are not stored on the same computer that Ekos is running on, then this feature doesn't work and the jobs restart from their beginning.
fr: Parmi les réglages ci-dessus, un est particulièrement important et connu sous le nom <guilabel>Se souvenir de la progression de la tâche</guilabel>. Quand cette case est cochée, l'ordonnanceur parcourt la liste des images déjà enregistrée sur le disque dur et fait en sorte de ne pas les acquérir à nouveau. L'intérêt est que si une tâche est redémarrée, ou relancée une autre nuit, ou si plusieurs tâches sont exécutées ensemble, l'arrêt et le démarrage des tâches reprendra là où elles s'étaient arrêtées. Cela fonctionne bien avec l'option <guilabel>Répéter jusqu'à terminé</guilabel>. Si elle n'était pas cochée, les tâches recommenceraient au début de la séquence, ce qui n'est probablement pas ce que vous souhaitez. Cependant, si les images ne sont pas enregistrées sur le même ordonnateur qui exécute Ekos, cette fonctionnalité ne fonctionne pas et les tâches redémarreront depuis le début.

source: A possibly confusing side-effect of <guilabel>Remember job progress</guilabel> is that if you've run a job using the (default) Sequence Completion finish condition, and it has captured all its images, and now you want to run the job again, the Scheduler won't schedule the job because it believes that all the images have already been captured. You'd either need to move those images elsewhere on disk, or change the finish condition to Repeat for N Times, or Repeat Until Terminated.
fr: Un effet secondaire de cette option et qui peut créer de la confusion est que si une tâche est lancée avec la condition Terminer la séquence et que toutes les images ont été acquises, et que vous souhaitez relancer cette tâche, l'ordonnanceur ne programmera pas cette tâche car il croit que toutes les images ont déjà été acquises. Pour éviter cela, il faudra soit déplacer les images ailleurs sur le disque ou modifier la condition d'achèvement de tâches à N fois ou Répéter jusqu'à achèvement.

source: Group repeats
fr: Répétitions de groupe

source: This feature allows you to run two or more scheduler jobs at roughly the same priority, such that if they were both runnable, they would progress at roughly the same rate. This may be applicable, for example, to jobs imaging the multiple tiles in a mosaic, but is generally applicable to any set of jobs.
fr: Cette fonctionnalité permet d'exécuter deux ordonnanceurs ou plus avec approximativement la même priorité, de telle sorte que si chacun peut être exécuté, il progresserait plus ou moins à la même vitesse. Cela peut être utile, par exemple, si vous imager une mosaïque avec plusieurs tuiles, mais est généralement utilisable pour n'importe quel groupe de tâches.

source: Normally the (Greedy) scheduler's job priority is set by the row the job is listed in the Scheduler's job table. Jobs on rows closer to the top run with higher priority than jobs lower down. Thus, if a job on row 2 (Job2) uses <guilabel>Repeat Until Terminated</guilabel>, and that job's running constraints are satisfied, a lower down job (&eg; Job3) will not be scheduled to run.
fr: La priorité de l'ordonnanceur Greedy est normalement déterminée par la position de la ligne dans la table des tâches. Celles se trouvant vers le haut ont une priorité plus haute que celle vers le bas de la table. Ainsi, si une tâche est sur la ligne 2 (tâche 2) et dont l'option <guilabel>Répéter jusqu'à achèvement</guilabel> est activée, et que toutes les contraintes sont satisfaites, une tâche plus bas dans la liste (p. ex. tâche 3) ne sera pas prévue pour exécution.

source: If you wish to alternate jobs, you can assign each of the jobs the same <guilabel>group</guilabel> name, and give the jobs one of the repeating finish conditions (&eg; Repeat for N times, or Repeat Until Terminated). With that setup, jobs in the same group will cede to each other if they have completed more 'Repeat Iterations' than the other job. So, if Job2 with group "MyGroup" completes its 2nd iteration, and Job3 with the same group name has only completed 0 or 1 iterations, when the time comes to schedule Job2, Job3 will run instead.
fr: Si vous souhaitez alterner les tâches, vous pouvez attribuer chaque tâche au même nom de <guilabel>groupe</guilabel> et donner aux tâches une des conditions d'achèvement (p. ex. Répéter N fois ou Répéter jusqu'à achèvement). Ainsi configurées, les tâches dans le même groupe laisseront la place aux autres tâches si elles ont terminées plus d'itérations que les autre autres tâches. Ainsi si la tâche 2 du groupe « MonGroupe » termine sa deuxième itération et que la tâche 3 du même groupe n'a terminé que 0 ou 1 itération, quand viendra le moment de programmer la tâche 2, ce sera la tâche 3 qui sera exécutée.

source: Practically speaking, imagine you had a 6-panel mosaic you wanted to alternate. You might give all of those jobs the same group name, make them all &eg; "Repeat for 5 times". Then, they would run in lock-step. The cadence of job switching would be controlled by the length of the sequence file assigned to each of those jobs. You wouldn't want to make the cadence too short (&eg; capturing one 2-minute image), as there is overhead in switching jobs. For instance, starting jobs may involved aligning, starting guiding, and even focusing.
fr: Dans la pratique, imaginez que vous une mosaïque à 6 panneaux que vous souhaitez alterner. Vous pouvez mettre chaque tâche dans le même groupe et les faire se répéter par exemple 5 fois. Ensuite, elles s'exécuteront en pas fixe. La cadence de changement sera contrôlée par la longueur du fichier de séquence attribué à chaque tâche. Vous ne voulez pas avoir une cadence trop courte (p. ex. pose de 2 minutes), parce que les changements impliquent plusieurs opérations telles que l'alignement, le guidage et la mise au point.

source: Repeat all jobs
fr: Répétez toutes les tâches
