Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_config.po
Languages: fr

source: This dialog allows to create or edit a deep sky object (DSO). The <guilabel>Basics</guilabel> section contains fields that have to be filled in.
fr: Cette boîte de dialogue permet de créer ou de modifier un objet du ciel profond (CP). La section <guilabel>Essentiel</guilabel> contient les champs qui doivent être remplis.

source: Name:
fr: Nom

source: The name of the object which will be displayed in the sky.
fr: Le nom de l'objet qui sera affiché dans le ciel.

source: The type of the object.
fr: Le type de l'objet.

source: RA / Dec (°, J2000):
fr: AD/DEC (°, J2000)

source: The coordinates of the object in degrees and with respect to the J2000 epoch.
fr: Les coordonnées de l'objet en degrés et par rapport à l'époque J2000.

source: Apparent magnitude:
fr: Magnitude apparente

source: The apparent magnitude of the object.
fr: La magnitude apparente de l'objet.

source: The <guilabel>Optional</guilabel> section contains data fields that are optional, is divided into two subsections. They are set to and can be left at their defaults.
fr: La section <guilabel>Facultatif</guilabel> contient des champs de données qui sont facultatifs et est divisée en deux sous-sections. Ils sont déjà remplis et peuvent être laissés avec leur valeur par défaut.

source: The <guilabel>Size Info in Arcminutes</guilabel> subsection. The object is modeled as an ellipse which is described by its major and minor axis.
fr: La sous-section <guilabel>Information sur la taille en minutes d'arc</guilabel>. L'objet est modélisé par une ellipse qui est décrite par ses petits et grands axes.

source: The <guilabel>Misc</guilabel> subsection.
fr: La sous-section <guilabel>Divers</guilabel>.

source: Long name:
fr: Nom long

source: A longer, more descriptive name.
fr: Un nom plus long, plus descriptif.

source: Usually, the long name is something like <quote>Andromeda Galaxy</quote> for the object M31. It can contain alternative designations and names in other catalogs as well.
fr: Un nom long est généralement quelque chose comme <quote>galaxie d'Andromède</quote> pour l'objet M31. Il peut aussi contenir des désignations alternatives dans d'autres catalogues.

source: Catalog identifier:
fr: Identifiant du catalogue

source: A catalog internal identifier.
fr: Un identifiant interne du catalogue.

source: For example the screenshot above, the object originates from the OpenNGC catalog where each row is identified by <quote>NGCXXXX</quote>.
fr: Par exemple dans la capture d'écran ci-dessus, l'objet vient du catalogue « OpenNGC » où chaque rangée est identifiée par <quote>NGCXXXX</quote>.

source: The flux of the object. Only applies for radio sources.
fr: Le flux de l'objet. Ne s'applique qu'aux sources radio.

source: Position angle (°):
fr: Angle de position (°)

source: If the object is extended, it must have some orientation in the sky. The position angle is the angle between its major axis and a straight line to the north pole.
fr: Si un objet est étendu, il doit avoir une certaine orientation dans le ciel. L'angle de position est défini comme l'angle de son grand axe et une ligne droite vers le pôle Nord.

source: Importing CSV (and similar formats)
fr: Importation CSV (et formats similaires)

source: <screeninfo>Importing CSV Catalogs</screeninfo>
fr: <screeninfo>Importation de catalogues au format CSV</screeninfo>

source: <phrase>Importing CSV Catalogs</phrase>
fr: <phrase>Importation de catalogues au format CSV</phrase>

source: The screenshot above shows the CSV import dialog in its default state. In the <guilabel>Input</guilabel> section, you can configure the csv parser. The <guilabel>Comment prefix:</guilabel> is the character that signals commented-out lines in the input. The <guilabel>Separator:</guilabel> should be adjusted to fit your input. Usually, it is <quote>,</quote> or <quote>;</quote> but other separators can occur. Finally, you can choose to skip a number of lines at the beginning of the file. <guibutton>Select/Read</guibutton> button lets you choose a csv file to read with the above configuration. After that, the dialog will look as in the screenshot below.
fr: La capture d'écran ci-dessus montre la boîte de dialogue d'importation dans son état par défaut. Dans la section <guilabel>Entrée</guilabel> vous pouvez configurer l'analyseur csv. Le <guilabel>préfixe de commentaire</guilabel> est le caractère qui indique qu'une ligne est commentée. Le <guilabel>séparateur</guilabel> devra être ajusté pour correspondre à celui du fichier d'entrée. Il s'agit souvent de <quote>,</quote> ou de <quote>;</quote> mais d'autres séparateurs peuvent être utilisés. Enfin, vous pouvez choisir de sauter un certain nombre de lignes au début du fichier. Le bouton <guibutton>Sélectionner</guibutton> vous permet de choisir le fichier csv à lire avec les configurations ci-dessus. Ensuite, la boîte de dialogue aura l'apparence de la capture d'écran ci-dessous.

source: Importing CSV Catalogs, Populated
fr: Importation de catalogues au format CSV, alimentés

source: In the top right you can choose whether coordinates are being expressed in degrees or hours/minutes/seconds. The <guilabel>Mapping</guilabel> section lets you map columns in the CSV file to data fields in &kstars;. Selecting <guilabel>Ignore</guilabel> assigns the default value for this field. Entering your own text will use this as the value for every object being read. The <guilabel>Type Mapping</guilabel> section maps strings to object types. You can add and remove mappings by clicking <guilabel>+</guilabel> or <guilabel>-</guilabel>. When you're done mapping, you can test your settings by clicking <guilabel>Preview</guilabel> to read the first few objects from the csv. If you are satisfied you can click <guilabel>OK</guilabel> to import the whole catalog or adjust your settings and preview again. As a reference, a mapping for the OpenNGC catalog is shown in the below screenshot.
fr: Dans la partie en haut à droite vous pouvez choisir si les coordonnées sont exprimées en degrés ou en heure/minute/seconde. La section <guilabel>Correspondance</guilabel> vous permet de faire correspondre les colonnes du fichier CSV avec les champs de données dans &kstars;. Choisir <guilabel>Par défaut</guilabel> assignera la valeur par défaut pour ce champ. Si vous indiquez votre propre texte, celui-ci sera utilisé comme valeur pour chaque objet lu. La section <guilabel>Type de correspondance</guilabel> fait correspondre des chaînes au type de l'objet. Vous pouvez ajouter ou retirer des correspondances en cliquant sur <guilabel>+</guilabel> ou <guilabel>-</guilabel>. Lorsque vous avez terminé, vous pouvez tester vos réglages en cliquant sur <guilabel>Aperçu</guilabel> pour lire les quelques premiers objets du fichier csv. Si vous êtes satisfait, vous pouvez cliquer sur <guilabel>Ok</guilabel> pour importer tout le catalogue ou alors ajuster vos réglages et les vérifier à nouveau. Comme référence vous pouvez voir la correspondance pour un catalogue OpenNGC dans la capture d'écran ci-dessous.

source: Importing CSV Catalogs, OpenNGC
fr: Importation de catalogues au format CSV, OpenNGC

source: Solar System
fr: Système solaire

source: <screeninfo>Solar System Window</screeninfo>
fr: <screeninfo>Fenêtre du système solaire</screeninfo>

source: <phrase>Solar System Window</phrase>
fr: <phrase>Fenêtre du système solaire</phrase>

source: In the <guilabel>Solar System</guilabel> page, you can specify whether the Sun, Moon, planets, comets and asteroids are displayed, and whether the major bodies are drawn as colored circles or actual images. You can also toggle whether solar system bodies have name labels attached, and control how many of the comets and asteroids get name labels. There is an option to automatically attach a temporary <quote>orbit trail</quote> whenever a solar system body is tracked, and another to toggle whether the color of the orbit trail fades into the background sky color.
fr: Dans l'onglet <guilabel>Système solaire</guilabel>, vous pouvez spécifier si le Soleil, la Lune, les planètes et astéroïdes seront affichés, et si les corps principaux sont dessinés comme des cercles colorés ou comme de vraies images. Vous pouvez aussi choisir si les corps du système solaire ont leurs noms attachés ou non, et contrôler combien de comètes et astéroïdes ont leur nom en libellé. Il y a une option pour attacher automatiquement une <quote>trace orbitale</quote> temporaire si un corps du système solaire est suivi, et une autre pour choisir si la couleur des traces de l'orbite disparaît dans la couleur de fond du ciel.

source: <screeninfo>Satellites Window</screeninfo>
fr: <screeninfo>Fenêtre des satellites</screeninfo>

source: <phrase>Satellites Window</phrase>
fr: <phrase>Fenêtre des satellites</phrase>

source: The <guilabel>Satellites</guilabel> page allows you to set the satellites view options. Firstly, you can see or hide the satellites on the skymap using <guilabel>Show satellites</guilabel> checkbox from the top <guilabel>View Options</guilabel> section. By default, satellites are drawn as small light red filled circles with an optional dark red name label next to them. You can enable or disable these labels by checking or not the <guilabel>Show labels</guilabel> checkbox. It is located below the <guilabel>Show satellites</guilabel> checkbox, within the <guilabel>View Options</guilabel> section.
fr: La page <guilabel>Satellites</guilabel> vous permet de régler les options d'affichage des satellites. Vous pouvez d'abord choisir d'afficher ou non les satellites en cochant la case <guilabel>Afficher satellites</guilabel> depuis le haut de la section <guilabel>Options d'affichage</guilabel>. Par défaut, les satellites sont dessinés avec de petits cercles en rouge clair avec une étiquette de nom facultative juste à côté. Vous pouvez activer ou désactiver ces étiquettes en cochant la case <guilabel>Afficher étiquettes</guilabel> dans la section <guilabel>Options d'affichage</guilabel>.

source: The colors of the dots representing satellites and their name labels can be easily customized using the <guilabel>Colors</guilabel> page from the same <guilabel>Configure - &kstars;</guilabel> window. In addition, satellites can be drawn just like regular stars by checking the <guilabel>Draw satellites like stars</guilabel> checkbox. To display only the visible satellites from your current geographic location and time, select <guilabel>Show only visible satellites</guilabel>.
fr: La couleurs des points représentant les satellites et leur étiquette peut facilement être personnalisée dans la page <guilabel>Couleurs</guilabel> sous la même fenêtre <guilabel>Configurer &kstars;</guilabel>. De plus, ils peuvent être dessinés de la même manière que les étoiles en cochant la case <guilabel>Dessiner les satellites comme les étoiles</guilabel>. Pour ne dessiner que les satellites visibles depuis votre position et votre heure actuelles, sélectionnez <guilabel>Afficher que les satellites visibles</guilabel>.

source: &kstars; can draw artificial satellites from many predefined groups. Thus, you can select to display a particular group, multiple groups or partially select subgroups. Under each group, a list of individual satellites is presented. To select all satellites from a group, you need to check the group checkbox. You can also select only the satellites of interest in each group. The satellites orbital elements can be updated via the internet by pressing the <guibutton>Update TLEs</guibutton> button. Another way for updating the satellites orbital elements is to use the <menuchoice><guimenu>Data</guimenu> <guisubmenu>Updates</guisubmenu> <guimenuitem>Update Satellites Orbital Elements</guimenuitem></menuchoice> menu item. If you know the name of a desired satellite then you can use the search satellites method that &kstars; provides. You need to enter the name of satellite in the <guilabel>Search satellites</guilabel> text box and the list will be reduced only to its best matches.
fr: &kstars; peut dessiner des satellites artificiels depuis de nombreux groupes prédéfinis. Vous pouvez ainsi choisir d'afficher un groupe particulier, plusieurs groupes ou partiellement un sous-groupe. Pour chaque groupe, une liste des satellites individuels est présentée. Pour sélectionner tous les satellites, vous devez cocher la case du groupe. Vous pouvez aussi sélectionner les satellites d'intérêt dans chaque groupe. Les orbites des satellites peuvent être mises à jour par internet en cliquant sur le bouton <guibutton>Mise à jour TLE</guibutton> (Two-Line Elements ou paramètres orbitaux à deux lignes). Une autre manière de mettre à jour les orbites est d'utiliser le menu <menuchoice><guimenu>Données</guimenu> <guimenuitem>Mise à jour des orbites des satellites</guimenuitem></menuchoice>. Si vous connaissez le nom d'un satellite, vous pouvez utiliser la méthode de recherche de satellite fournie par &kstars;. Vous devez saisir le nom du satellite dans la boîte de dialogue <guilabel>Recherche de satellite</guilabel> et la liste sera réduite en affichant les meilleures correspondances.

source: You can add new satellites to &kstars; default satellites set by editing the <filename>kstars/data/satellites.dat</filename> file. As each line of this file is a group of satellites, you need to add a new entry for your desired satellites group. An entry should have the following format: <userinput>Group Name;local_filename;url</userinput>. For example: <userinput>Iridium;iridium.tle;https://celestrak.com/NORAD/elements/iridium.txt</userinput>.
fr: Vous pouvez ajouter de nouveaux satellites à l'ensemble de satellites par défaut de &kstars; en modifiant le fichier <filename>kstars/data/satellites.dat</filename>. Comme chaque ligne de ce fichier est un groupe de satellites, vous devez saisir une ligne pour votre groupe de satellites désiré. Une entrée doit avoir le format suivant : <userinput>Nom groupe;fichier-local;URL</userinput>. Par exemple : <userinput>Iridium;iridium.tle;https://celestrak.com/NORAD/elements/iridium.txt</userinput>.

source: Supernovae
fr: Supernova

source: <screeninfo>Supernovae Window</screeninfo>
fr: <screeninfo>Fenêtre des supernova</screeninfo>

source: <phrase>Supernovae Window</phrase>
fr: <phrase>Fenêtre des supernova</phrase>

source: The <guilabel>Supernovae</guilabel> page allows you to decide if the supernovae are displayed or not by checking the <guilabel>Show supernovae</guilabel> checkbox. By default, supernovae are drawn as small light orange <quote>+</quote> mark. As for satellites, the color of supernovae can be easily customized using the <guilabel>Colors</guilabel> page.
fr: La page <guilabel>Supernova</guilabel> vous permet de choisir si les supernova sont affichées ou non en cochant la case <guilabel>Afficher les supernova</guilabel>. Par défaut les supernova sont dessinées comme de petit <quote>+</quote> de couleur orange clair. Comme pour les satellites, la couleur des supernova peut facilement être modifiée sur la page des <guilabel>Couleurs</guilabel>.

source: You can set the magnitude limit for showing a supernova as well as magnitude limit for supernova alerts using the spin boxes control. The limiting magnitude is the faintest apparent magnitude of an skyobject that is visible with the naked-eye or a telescope.
fr: Vous pouvez régler la magnitude limite d'affichage des supernova ainsi que la magnitude limite pour les alertes. La magnitude limite est la plus faible magnitude d'un objet du ciel visible à l'œil nu ou avec un télescope.

source: The list of recent supernovae can be updated via the <menuchoice><guimenu>Data</guimenu> <guisubmenu>Updates</guisubmenu> <guimenuitem>Update Recent Supernovae data</guimenuitem></menuchoice> menu item.
fr: La liste des supernova récentes peut être mise à jour dans le menu <menuchoice><guimenu>Données</guimenu> <guimenuitem>Mettre à jour les données des supernova récentes</guimenuitem></menuchoice>.

source: <screeninfo>Guides Window</screeninfo>
fr: <screeninfo>Fenêtre des guides</screeninfo>

source: <phrase>Guides Window</phrase>
fr: <phrase>Fenêtre des guides</phrase>

source: The <guilabel>Guides</guilabel> page lets you toggle whether non-objects are displayed (&ie;, constellation lines, constellation names, the Milky Way contour, the <link linkend="ai-cequator">celestial equator</link>, <link linkend="ai-ecliptic">the ecliptic</link>, <link linkend="ai-horizon">the horizon line</link>, and the opaque ground). You can also choose a sky culture, whether you would like to see Latin constellation names, <acronym>IAU</acronym>-standard three-letter abbreviations, or constellation names using your local language.
fr: L'onglet <guilabel>Guides</guilabel> vous permet de (dés)activer l'affichage des éléments qui ne sont pas des objets célestes (c'est-à-dire les lignes des constellations, les noms des constellations, le contour de la Voie Lactée, l'<link linkend="ai-cequator">équateur céleste</link>, l'<link linkend="ai-ecliptic">écliptique</link>, la <link linkend="ai-horizon">ligne d'horizon</link> et le sol opaque). Vous pouvez aussi choisir si vous préférez voir les noms latins des constellations, les abréviations standard <acronym>IAU</acronym> à trois lettres ou les noms des constellations dans votre langue.

source: <screeninfo>Terrain Window</screeninfo>
fr: <screeninfo>Fenêtre du terrain</screeninfo>

source: <phrase>Terrain Window</phrase>
fr: <phrase>Fenêtre du terrain</phrase>

source: The <guilabel>Terrain</guilabel> page lets you configure whether the terrain (landscape) image will be shown on the skymap.
fr: La page <guilabel>Terrain</guilabel> vous permet de choisir si l'image du terrain sera affichée sur la carte du ciel.

source: The user is responsible for creating a partially-transparent image, that is overlayed onto the sky map. This image should have transparent regions that the user creates to let the skymap show through, and opaque regions representing the trees, buildings, the landscape around the telescope. There is a particular format required, and this is a significant effort. There are many resources on the web that explain how this is done for <ulink url="https://stellarium.org/landscapes.html">Stellarium</ulink>. The details of image creation are the same.
fr: L'utilisateur a la possibilité de créer une image partiellement transparente qui sera superposée sur la carte du ciel. Cette image devrait avoir des régions transparentes qui laissera passer la carte du ciel et d'autres opaques qui représentent les arbres, les bâtiments et le paysage autour du télescope. Un format particulier est requis pour cette image qui demande d'ailleurs un effort significatif à créer. Il existe beaucoup d'informations sur le web expliquant la manière de faire pour <ulink url="https://stellarium.org/landscapes.html">Stellarium</ulink>. Les détails de la création d'image sont les mêmes que pour &kstars;.

source: Initially, the user captures a full sphere equirectangular projection image from approximately the same point-of-view as his/her telescope. This kind of image can be captured with the Google Camera App, or the Google YouTube App on iPhone, or likely many other camera apps. The user then needs to edit the resulting image so that the sky is erased/transparent, and save it as a PNG. Finally, the user needs to determine where North is in the image, so it can eventually be aligned with the skymap. Once all that is done, the sky map can simulate the local sky view including the local terrain.
fr: L'utilisateur prend d'abord une image à 360° en projection équi-rectangulaire depuis approximativement le même point de vue que son télescope. Ce type d'image peut être prise avec l'application de l'appareil photo de Google, ou l'application YouTube de Google, avec son téléphone portable ou tout autre application de l'appareil photo. L'utilisateur doit ensuite modifier l'image pour rendre le ciel transparent et l'enregistrer dans le format PNG. Enfin, il doit déterminer où est le nord dans l'image pour l'aligner avec le nord de la carte du ciel. Une fois tout ceci terminé, la carte du ciel peut simuler la vision locale du ciel en incluant le terrain local.

source: Once the image is created, it is possible to upload it via the <guilabel>Terrain</guilabel> page and configure the azimuth correction value (in degrees) that allows the user to rotate the view so north in the sky map is aligned with the north in the image.
fr: Une fois l'image créée, il faut la charger via la page <guilabel>Terrain</guilabel> et configurer la valeur de la correction d'azimut (en degrés) afin de permettre à l'utilisateur d'effectuer une rotation de la vue pour avoir le nord de la carte du ciel aligné avec le nord de l'image.

source: Moreover, some speedup options can be configured to achieve the best user experience when rendering the terrain on the sky map.
fr: De plus il existe d'autres options d'accélération pour obtenir la meilleure expérience utilisateur lors de la présentation du terrain sur la carte du ciel.

source: You can toggle the terrain overlay on and off using a keyboard shortcut <keycombo>&Ctrl;&Shift;<keycap>T</keycap></keycombo> and the <menuchoice><guimenu>View</guimenu><guimenuitem>Show Terrain</guimenuitem></menuchoice> menu item.
fr: Vous pouvez (dés)activer la superposition du terrain en utilisant le raccourci clavier <keycombo>&Ctrl;&Maj;<keycap>T</keycap></keycombo> ou avec le menu <menuchoice><guimenu>Affichage</guimenu> <guimenuitem>Afficher terrain</guimenuitem></menuchoice>.

source: <title>Image Overlays</title>
fr: <title>Superposition d'images</title>

source: <screeninfo>Image Overlays on SkyMap</screeninfo>
fr: <screeninfo>Superposition d'image sur la carte du ciel</screeninfo>

source: <phrase>Image Overlays on SkyMap</phrase>
fr: <phrase>Superposition d'image sur la carte du ciel</phrase>

source: Image overlays are custom images (typically <literal role="extension">.jpg</literal>) that are rendered onto the skymap over stars and other skymap items, but below the terrain. These images are added by you, the user, a sort of personal sky catalog. If configured properly, these personal images can be displayed almost perfectly aligned with other objects in the sky.
fr: Les images de superposition sont des images personnalisées (typiquement <literal role="extension">.jpg</literal>) placées sur la carte du ciel par-dessus les étoiles et les autres éléments de la carte du ciel, mais sous le terrain. Elles sont ajoutées par vous, l'utilisateur, comme une sorte de catalogue personnel. Elles peuvent être alignées presque parfaitement avec les autres objets du ciel si configurées correctement.

source: <screeninfo>Image Overlays Window</screeninfo>
fr: <screeninfo>Fenêtre de superposition d'image</screeninfo>

source: <phrase>Image Overlays Window</phrase>
fr: <phrase>Fenêtre de superposition d'image</phrase>

source: The <guilabel>Image Overlays</guilabel> page lets you configure whether image overlays will be shown on the skymap, and helps you add them to the system. The image at the start of this section shows the skymap with image overlays enabled and some image overlays loaded.
fr: La page de <guilabel>Superposition d'image</guilabel> vous permet de décider si cette image doit être affichée sur la carte du ciel et vous aide à les ajouter dans le système. L'image au début de cette section présente la carte du ciel avec la superposition d'image activée et désactivée.
