Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_skycoords.po
Languages: fr

source: <title>Celestial Coordinate Systems</title>
fr: <title>Les systèmes de coordonnées célestes</title>

source: <primary>Celestial Coordinate Systems</primary>
fr: <primary>Les systèmes de coordonnées célestes</primary>

source: Overview
fr: Survol

source: A basic requirement for studying the heavens is determining where in the sky things are. To specify sky positions, astronomers have developed several <firstterm>coordinate systems</firstterm>. Each uses a coordinate grid projected on the <link linkend="ai-csphere">Celestial Sphere</link>, in analogy to the <link linkend="ai-geocoords">Geographic coordinate system</link> used on the surface of the Earth. The coordinate systems differ only in their choice of the <firstterm>fundamental plane</firstterm>, which divides the sky into two equal hemispheres along a <link linkend="ai-greatcircle">great circle</link>. (the fundamental plane of the geographic system is the Earth's equator). Each coordinate system is named for its choice of fundamental plane.
fr: Lors de l'étude du ciel, la première question est de savoir à quel endroit se trouvent les objets célestes. Afin de spécifier les positions des objets, les astronomes ont créé plusieurs <firstterm>systèmes de coordonnées</firstterm>. Chacun d'entre eux se sert d'une grille de coordonnées projetée sur la <link linkend="ai-csphere">sphère céleste</link>, analogue au <link linkend="ai-geocoords">système de coordonnées géographique</link> qu'on utilise sur terre. Les systèmes de coordonnées diffèrent sur un seul point : le <firstterm>plan fondamental</firstterm> qu'ils utilisent. Le plan fondamental divise le ciel en deux hémisphère égaux le long d'un <link linkend="ai-greatcircle">grand cercle</link>. (Le plan fondamental du système de coordonnées géographique est l'équateur terrestre). Chaque système de coordonnées est nommé selon le plan fondamental qu'il utilise.

source: The Equatorial Coordinate System
fr: Le système de coordonnées équatoriales

source: <secondary>Equatorial Coordinates</secondary>
fr: <secondary>Coordonnées équatoriales</secondary>

source: <seealso>Celestial Equator</seealso> <seealso>Celestial Poles</seealso> <seealso>Geographic Coordinate System</seealso>
fr: <seealso>Équateur céleste</seealso> <seealso>Pôles célestes</seealso> <seealso>Système de coordonnées géographiques</seealso>

source: Right Ascension
fr: Ascension droite

source: <see>Equatorial Coordinates</see>
fr: <see>Coordonnées équatoriales</see>

source: Declination
fr: Déclinaison

source: The <firstterm>Equatorial coordinate system</firstterm> is probably the most widely used celestial coordinate system. It is also the most closely related to the <link linkend="ai-geocoords">Geographic coordinate system</link>, because they use the same fundamental plane, and the same poles. The projection of the Earth's equator onto the celestial sphere is called the <link linkend="ai-cequator">Celestial Equator</link>. Similarly, projecting the geographic Poles onto the celestial sphere defines the North and South <link linkend="ai-cpoles">Celestial Poles</link>.
fr: Le <firstterm>système de coordonnées équatorial</firstterm> est probablement le système de coordonnées céleste le plus utilisé. C'est aussi celui qui est le plus semblable à notre <link linkend="ai-geocoords">système de coordonnées géographique</link>, puisqu'ils utilisent tous deux le même plan fondamental et les mêmes pôles. La projection de notre équateur sur la sphère céleste est appelée l'<link linkend="ai-cequator">équateur céleste</link>. De la même façon, la projection de nos pôles géographiques sur la sphère céleste crée les <link linkend="ai-cpoles">pôles célestes</link> Nord et Sud.

source: However, there is an important difference between the equatorial and geographic coordinate systems: the geographic system is fixed to the Earth; it rotates as the Earth does. The Equatorial system is fixed to the stars<footnote id="fn-precess"><para>Actually, the equatorial coordinates are not quite fixed to the stars. See <link linkend="ai-precession">precession</link>. Also, if <link linkend="ai-hourangle">Hour Angle</link> is used in place of Right Ascension, then the Equatorial system is fixed to the Earth, not to the stars.</para></footnote>, so it appears to rotate across the sky with the stars, but of course it is really the Earth rotating under the fixed sky.
fr: Il existe toutefois une différence importante entre le système de coordonnées équatoriales et le système de coordonnées géographiques : le système géographique est fixé à la Terre ; il tourne avec la Terre. Le système équatorial est fixé aux étoiles<footnote id="fn-precess"><para>En fait, les coordonnées équatoriales ne sont pas tout à fait fixées aux étoiles. Voir <link linkend="ai-precession">précession</link>. De plus, si l'on utilise l'<link linkend="ai-hourangle">angle horaire</link> au lieu de l'ascension droite, le système équatorial devient fixé à la Terre et non aux étoiles.</para></footnote>, donc il semble se déplacer avec les étoiles alors qu'en réalité c'est la Terre qui tourne et le ciel est immobile.

source: The <firstterm>latitudinal</firstterm> (latitude-like) angle of the Equatorial system is called <firstterm>Declination</firstterm> (Dec for short). It measures the angle of an object above or below the Celestial Equator. The <firstterm>longitudinal</firstterm> angle is called the <firstterm>Right Ascension</firstterm> (<acronym>RA</acronym> for short). It measures the angle of an object East of the <link linkend="ai-equinox">Vernal Equinox</link>. Unlike longitude, Right Ascension is usually measured in hours instead of degrees, because the apparent rotation of the Equatorial coordinate system is closely related to <link linkend="ai-sidereal">Sidereal Time</link> and <link linkend="ai-hourangle">Hour Angle</link>. Since a full rotation of the sky takes 24 hours to complete, there are (360 degrees / 24 hours) = 15 degrees in one Hour of Right Ascension.
fr: L'angle <firstterm>latitudinal</firstterm> du système équatorial est appelé <firstterm>déclinaison</firstterm> (que l'on abrège <acronym>DEC</acronym>). La déclinaison mesure l'angle d'un objet au-dessus ou au-dessous de l'équateur céleste. L'angle <firstterm>longitudinal</firstterm> s'appelle l'<firstterm>ascension droite</firstterm> (que l'on abrège <acronym>AD</acronym>). L'ascension droite mesure l'angle d'un objet à l'est de l'<link linkend="ai-equinox">équinoxe vernal</link>. Contrairement à la longitude, l'ascension droite est habituellement mesurée en heures, non en degrés, parce que la rotation apparente du système de coordonnées équatoriales est très apparenté à l'<link linkend="ai-sidereal">heure sidérale</link> et à l'<link linkend="ai-hourangle">angle horaire</link>. Puisqu'une rotation complète du ciel prend 24 heures, un heure d'ascension droite est égale à 15 degrés (360 degrés / 24 heures).

source: The equatorial coordinates for deep-sky objects and stars do not vary appreciably over short durations of time, since they are not affected by the <firstterm>diurnal motion</firstterm> (the daily apparent rotation of the sky around the earth. However, note that this takes <link linkend="ai-sidereal">1 sidereal day</link>, as against 1 solar day). They are suitable coordinates for making catalogs of stars and deep-sky objects (note that <firstterm>Galactic Coordinates</firstterm> also work well, but are cumbersome to use from an earth point-of-view). However, there are effects that cause the RA and Dec of objects to vary over time, namely <link linkend="ai-precession">Precession</link> and <firstterm>nutation</firstterm>, and <firstterm>proper motion</firstterm>, the latter being even less important. Equatorial coordinates are thus generally specified with an appropriate <link linkend="ai-epoch">epoch</link>, to account for precession. Popular epochs include J2000.0 (<link linkend="ai-julianday">Julian Year</link> 2000) and B1950.0 (<firstterm>Besselian Year</firstterm> 1950).
fr: Les coordonnées équatoriales pour les objets du ciel profond et les étoiles ne varient pas sensiblement pendant une courte période, car elles ne sont pas affectées par le <firstterm>mouvement diurne</firstterm> (la rotation quotidienne apparente du ciel autour de la Terre. Toutefois, notez que cela prend <link linkend="ai-sidereal">1 jour sidéral </link>, contre 1 jour solaire). Les coordonnées sont adaptées pour la créations des catalogues d'étoiles et les objets du ciel profond (à noter que les <firstterm>coordonnées galactiques</firstterm> fonctionneront également, mais sont difficiles à utiliser à partir d'un point de vue terrestre. Cependant, il y a des effets qui font varier la RA et DEC des objets au fil du temps, à savoir la <link linkend="ai-precession">précession</link> et la <firstterm>nutation</firstterm>, et le <firstterm>mouvement propre </firstterm>, ce dernier étant encore moins important. Les coordonnées équatoriales sont donc généralement spécifiées avec une <link linkend="ai-epoch">époque</link>, pour tenir compte de la précession. Les époques comprennent J2000.0 (<link linkend="ai-julianday">Année julienne</link> 2000) et B1950.0 (<firstterm>année besselienne</firstterm> 1950).

source: The Horizontal Coordinate System
fr: Le système de coordonnées horizontales

source: <secondary>Horizontal Coordinates</secondary>
fr: <secondary>Coordonnées horizontales</secondary>

source: <seealso>Horizon</seealso> <seealso>Zenith</seealso>
fr: <seealso>Horizon</seealso> <seealso>Zénith</seealso>

source: Azimuth
fr: Azimut

source: <see>Horizontal Coordinates</see>
fr: <see>Coordonnées horizontales</see>

source: The Horizontal coordinate system uses the observer's local <link linkend="ai-horizon">horizon</link> as the Fundamental Plane. This conveniently divides the sky into the upper hemisphere that you can see, and the lower hemisphere that you can't (because the Earth is in the way). The pole of the upper hemisphere is called the <link linkend="ai-zenith">Zenith</link>. The pole of the lower hemisphere is called the <firstterm>nadir</firstterm>. The angle of an object above or below the horizon is called the <firstterm>Altitude</firstterm> (Alt for short). The angle of an object around the horizon (measured from the North point, toward the East) is called the <firstterm>Azimuth</firstterm>. The Horizontal Coordinate System is sometimes also called the Alt/Az Coordinate System.
fr: Le système de coordonnées horizontales utilise l'<link linkend="ai-horizon">horizon</link> local de l'observateur comme plan fondamental. Cela divise le ciel en deux hémisphères, celui du haut, que l'on peut voir, et celui du bas qui est caché par la Terre sous nos pieds. Le pôle de l'hémisphère <quote>du haut</quote> s'appelle le <link linkend="ai-zenith">zénith</link>. Le pôle de l'hémisphère qui nous est invisible s'appelle le <firstterm>nadir</firstterm>. L'angle d'un objet au-dessus ou au-dessous de l'horizon s'appelle l'<firstterm>altitude</firstterm> (Alt). L'angle d'un objet autour de l'horizon (mesuré à partir du point nord, vers l'est) est appelé <firstterm>azimut</firstterm>. Le système de coordonnées horizontal est parfois appelé système de coordonnées Alt/Az.

source: The Horizontal Coordinate System is fixed to the Earth, not the Stars. Therefore, the Altitude and Azimuth of an object changes with time, as the object appears to drift across the sky. In addition, because the Horizontal system is defined by your local horizon, the same object viewed from different locations on Earth at the same time will have different values of Altitude and Azimuth.
fr: Le système de coordonnées horizontales est fixé à la Terre et non pas aux étoiles. En conséquence, l'altitude et l'azimut d'un objet changent avec le temps, l'objet semblant dériver dans le ciel. De plus, puisque le système horizontal est défini par l'horizon local de l'observateur, l'altitude et l'azimut d'un objet changeront en fonction de la position de l'observateur.

source: Horizontal coordinates are very useful for determining the Rise and Set times of an object in the sky. When an object has Altitude=0 degrees, it is either Rising (if its Azimuth is &lt; 180 degrees) or Setting (if its Azimuth is &gt; 180 degrees).
fr: Les coordonnées horizontales sont très utiles pour déterminer les heures du lever et du coucher d'un objet céleste. Un objet qui se lève possède une altitude de 0 degrés et un azimut plus petit que 180 degrés ; un objet qui se couche possède une altitude de 0 degrés et un azimut plus grand que 180 degrés.

source: The Ecliptic Coordinate System
fr: Le système de coordonnées écliptiques

source: Ecliptic Coordinates
fr: Coordonnées écliptiques

source: Ecliptic
fr: Écliptique

source: The Ecliptic coordinate system uses the <link linkend="ai-ecliptic">Ecliptic</link> for its Fundamental Plane. The Ecliptic is the path that the Sun appears to follow across the sky over the course of a year. It is also the projection of the Earth's orbital plane onto the Celestial Sphere. The latitudinal angle is called the <firstterm>Ecliptic Latitude</firstterm>, and the longitudinal angle is called the <firstterm>Ecliptic Longitude</firstterm>. Like Right Ascension in the Equatorial system, the zeropoint of the Ecliptic Longitude is the <link linkend="ai-equinox">Vernal Equinox</link>.
fr: Le système de coordonnées écliptiques utilise l'<link linkend="ai-ecliptic">écliptique</link> comme plan fondamental. L'écliptique est la trajectoire que le Soleil semble suivre à travers le ciel au cours d'une année. C'est aussi la projection, sur la sphère céleste, du plan orbital de la Terre. L'angle latitudinal est appelé la <firstterm>latitude écliptique</firstterm>, et l'angle longitudinal est appelé la <firstterm>longitude écliptique</firstterm>. Le point zéro de la longitude écliptique est (tout comme l'ascension droite du système équatorial) l'<link linkend="ai-equinox">équinoxe vernal</link>.

source: What do you think such a coordinate system would be useful for? If you guessed charting solar system objects, you are right! Each of the planets (except Pluto) orbits the Sun in roughly the same plane, so they always appear to be somewhere near the Ecliptic (&ie;, they always have small ecliptic latitudes).
fr: D'après vous, à quoi sert le système de coordonnées écliptiques ? Si vous avez trouvé qu'il sert à cartographier les objets du système solaire, vous avez raison. Les planètes, à l'exception de Pluton, orbitent autour du Soleil sur pratiquement le même plan, et donc on peut dire qu'elles se trouvent toutes à un endroit pas très éloigné de l'écliptique (c'est-à-dire qu'elles possèdent toujours des latitudes écliptiques de petite taille).

source: The Galactic Coordinate System
fr: Le système de coordonnées galactiques

source: Galactic Coordinates
fr: Coordonnées galactiques

source: Milky Way
fr: Voie Lactée

source: The Galactic coordinate system uses the <firstterm>Milky Way</firstterm> as its Fundamental Plane. The latitudinal angle is called the <firstterm>Galactic Latitude</firstterm>, and the longitudinal angle is called the <firstterm>Galactic Longitude</firstterm>. This coordinate system is useful for studying the Galaxy itself. For example, you might want to know how the density of stars changes as a function of Galactic Latitude, to how much the disk of the Milky Way is flattened.
fr: Le système de coordonnées galactiques utilise la <firstterm>Voie Lactée</firstterm> comme plan fondamental. L'angle latitudinal est appelé la <firstterm>latitude galactique</firstterm>, et l'angle longitudinal est appelé la <firstterm>longitude galactique</firstterm>. Ce système de coordonnées est utile pour l'étude de la Galaxie. Par exemple, si vous voulez savoir comment la densité des étoiles change en fonction de la latitude galactique, ou de combien est aplatie la Voie Lactée.
