Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_quicktour.po
Languages: fr

source: You can choose to enable or disable this feature by checking or unchecking the <guibutton>Resolve names not known to &kstars; using online services</guibutton> check box from <guilabel>Catalogs</guilabel> page, inside of <guilabel>Configure - &kstars;</guilabel> dialog (select the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem></menuchoice> menu item). If this checkbox is checked, when an object name unknown to &kstars; is entered in the <guilabel>Find Dialog</guilabel>, &kstars; will contact online services to learn about the desired object and then add it directly to &kstars; database. The objects acquired in this manner are stored in a fake catalog, called <quote>_Internet_Resolved</quote>. Thus, you can enable or disable the display of these objects by checking or unchecking the <quote>_Internet_Resolved</quote> catalog from the catalogues list. Note that you can not delete this fake catalogue, as you can do with a custom catalogue. If this checkbox is unchecked, then the <guilabel>Find Object</guilabel> window will be exactly the same, excepting a minor change: the online searching button will no longer be visible.
fr: Vous pouvez choisir d'activer ou de désactiver cette fonctionnalité en cochant ou en décochant la case à cocher <guibutton>Trouver des objets inconnus de &kstars; en utilisant des service en ligne</guibutton> de la page des <guilabel>Catalogues</guilabel> du menu <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Configurer &kstars;</guimenuitem></menuchoice>. Si la case est cochée, tout objet inconnu de &kstars; déclenchera une recherche sur les services en ligne afin d'en obtenir de l'information et de l'ajouter directement dans la base de données de &kstars;. Les objets trouvés ainsi sont enregistrés dans un faux catalogue appelé <quote>_Internet_Resolved</quote>. Vous pouvez activer ou désactiver ce faux catalogue en cochant sa case dans la liste des catalogues. Veuillez noter que vous ne pouvez pas supprimer ce catalogue comme vous pourriez le faire avec un catalogue personnalisé. Si cette case est décochée, la fenêtre <guilabel>Trouver objet</guilabel> aura la même apparence à un détail près : le bouton de recherche en ligne ne sera pas visible.

source: <screeninfo>Find Object Window</screeninfo>
fr: <screeninfo>Fenêtre de recherche d'objets</screeninfo>

source: <phrase>Find Object Window</phrase>
fr: <phrase>Fenêtre de recherche d'objets</phrase>

source: To center the display on an object, highlight the desired object in the list, and press <guibutton>Ok</guibutton>. Note that if the object is below the horizon, the program will warn you that you may not see anything except the ground (you can make the ground invisible in the <guilabel>Guides</guilabel> settings page, or by pressing the <guiicon>Ground</guiicon> button in the View toolbar).
fr: Pour centrer l'affichage sur un objet, choisissez l'objet souhaité dans la liste et cliquez sur le bouton <guibutton>Ok</guibutton>. Notez que si l'objet est situé sous l'horizon, le programme vous avertira que vous risquez de ne rien voir excepté le sol terrestre (vous pouvez rendre le sol invisible dans la page de paramètres <guilabel>Guides</guilabel> ou en cliquant sur le bouton <guiicon>Sol</guiicon> dans la barre d'affichage).

source: Centering and Tracking
fr: Centrage et suivi

source: Tracking
fr: Suivi

source: &kstars; will automatically begin tracking on an object whenever one is centered in the display, either by using the <guilabel>Find Object</guilabel> window, by double-clicking on it, or by selecting <guimenuitem>Center &amp; Track</guimenuitem> from its <mousebutton>right</mousebutton>-click popup menu. You can disengage tracking by panning the display, pressing the <guiicon>Stop Tracking</guiicon> icon in the Main toolbar, or selecting <menuchoice><guimenu>Pointing</guimenu> <guimenuitem>Stop Tracking</guimenuitem></menuchoice> menu item.
fr: &kstars; commencera automatiquement à suivre un objet à chaque fois qu'il est centré dans l'affichage, soit à l'aide de la fenêtre <guilabel>Chercher un objet</guilabel>, en double-cliquant sur l'objet, soit en choisissant <guimenuitem>Centrer et Suivre</guimenuitem> depuis son menu contextuel obtenu par un clic <mousebutton>droit</mousebutton>. On peut cesser la poursuite de l'objet en faisant un panoramique de l'affichage, en cliquant sur l'icône <guiicon>Arrêter la poursuite</guiicon> dans la barre principale ou en choisissant <menuchoice><guimenu>Pointage</guimenu> <guimenuitem>Arrêter la poursuite</guimenuitem></menuchoice>.

source: Orbit Trails
fr: Traces orbitales

source: Attached to centered object
fr: Attachées à l'objet centré

source: When tracking on a Solar System body, &kstars; will automatically attach an <quote>orbit trail</quote>, showing the path of the body across the sky. You will likely need to change the clock's timestep to a large value (such as <quote>1 day</quote>) to see the trail.
fr: En suivant un objet du système solaire, &kstars; attachera automatiquement une <quote>trace orbitale</quote>, montrant la position du corps à travers le ciel. Vous aurez vraisemblablement besoin de changer le pas de l'horloge pour une valeur plus grande (comme <quote>1 jour</quote>) pour voir la trace.

source: <title>Keyboard Actions</title>
fr: <title>Actions du clavier</title>

source: <secondary>Keyboard Actions</secondary>
fr: <secondary>Actions du clavier</secondary>

source: When you click on an object in the map, it becomes the <firstterm>selected object</firstterm>, and its name is identified in the statusbar. There are a number of quick key commands available which act on the selected object:
fr: Quand vous cliquez sur un objet dans la carte, il devient <firstterm>l'objet sélectionné</firstterm>, et son nom est identifié dans la barre d'état. Il y a de nombreuses commandes rapides au clavier qui agissent sur l'objet sélectionné :

source: Center and Track on the selected object.
fr: Centrer et suivre l'objet sélectionné.

source: Show the <link linkend="tool-details">Details window</link> for the selected object.
fr: Afficher la <link linkend="tool-details">Fenêtre des détails</link> pour l'objet sélectionné.

source: Toggle a visible name label on the selected object.
fr: Basculer la visibilité de l'étiquette du nom de l'objet sélectionné.

source: Add the selected object to the <link linkend="tool-obsplanner">Observing wish-list</link>.
fr: Ajouter l'objet sélectionné à la <link linkend="tool-obsplanner">liste de souhaits des observations</link>.

source: Toggle a visible curve on the sky, showing the path of the object across the sky (only applicable to Solar System bodies).
fr: (Dés)activer la visibilité d'une courbe dans le ciel, montrant la trace de l'objet à travers du ciel (applicable seulement aux objets du système solaire).

source: By holding down the &Shift; key, you can perform these actions on the centered object, rather than the selected object.
fr: En maintenant enfoncée la touche &Maj;, on peut effectuer ces actions sur l'objet centré, plutôt que sur l'objet sélectionné.

source: End of the Tour
fr: Fin de la visite

source: This concludes the tour of the &kstars; skymap, although we have only scratched the surface of the available features. &kstars; includes many useful <link linkend="tools">astronomy tools</link>, it can directly <link linkend="indi">control your telescope</link>, and it offers a wide variety of <link linkend="config">configuration and customization options</link>. In addition, this Handbook includes the <link linkend="astroinfo">AstroInfo Project</link>, a series of short, interlinked articles explaining some of the celestial and astrophysical concepts behind &kstars;.
fr: Cela conclut la visite de la carte du ciel de &kstars;, bien que nous ayons à peine égratigné la surface des fonctionnalités disponibles. &kstars; inclut beaucoup d'<link linkend="tools">outils astronomiques</link>, il peut contrôler directement <link linkend="indi">votre télescope</link>, et il offre une grande variété d'options de <link linkend="config">configuration et de personnalisation</link>. De plus, ce manuel inclut le <link linkend="astroinfo">Projet AstroInfo</link>, une série de petits articles liés entre eux, expliquant certains des concepts célestes et astrophysiques qui sous-tendent &kstars;.
