Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_indi.po
Languages: fr

source: The command <command>Slew</command> orders the telescope to move to a particular target, and once the telescope reaches its target, the telescope keeps tracking that target at a <emphasis>sidereal</emphasis> rate (&ie;, the rate at which stars move across the sky). This works well for stars, Messier objects, and about everything outside our solar system. But solar system objects travel differently across the sky and so the telescope must <command>Track</command> the objects as they move.
fr: La commande <command>Pivoter</command> ordonne au télescope de se déplacer vers une cible particulière, et, une fois que le télescope a atteint sa cible, le télescope continue à suivre la cible à une vitesse <emphasis>sidérale</emphasis> (&ie; la vitesse à laquelle l'objet se déplace dans le ciel). Ceci fonctionne bien pour les étoiles, les objets Messier, et à peu près tout hors du système solaire. Mais les objets du système solaire voyagent différemment à travers le ciel, et le télescope doit <command>Suivre</command> les objets comme ils bougent.

source: Therefore, you need to issue a track command if you want to track an object with non-sidereal motion. On the other hand, <command>Sync</command> is used to synchronize the telescope's internal coordinates with that of an object you select.
fr: Pour cela, vous avez besoin d'effectuer une commande de suivi, si vous voulez suivre un objet avec un mouvement non sidéral. D'une autre manière, <command>Synchroniser</command> sert à synchroniser les coordonnées internes du télescope avec un objet que vous sélectionnez.

source: Can I control my telescope remotely?
fr: Puis-je contrôler mon télescope à distance ?

source: Yes. You can start an INDI server on the machine connected to your telescope and the server will listen to requests from &kstars; clients. Once you're connected, you can control your telescope directly from the sky map. This procedure is described in detail in the <link linkend="indi-remote-control">Remote device control</link> section.
fr: Oui. Vous pouvez démarrer un serveur INDI sur la machine connectée à votre télescope, et le serveur écoutera les requêtes des clients &kstars;. Une fois que vous aurez connecté, vous pouvez contrôler votre télescope directement depuis la carte du ciel. Cette procédure est décrite en détail dans la section <link linkend="indi-remote-control">Contrôle de périphérique distant</link>.

source: When I try to <guibutton>Connect</guibutton>, &kstars; reports that the telescope is not connected to the serial/USB port. What can I do?
fr: Lorsque j'essaye de <guibutton>connecter</guibutton>, &kstars; rapporte que le télescope n'est pas connecté au port série / USB. Que puis-je faire ?

source: This message is triggered when &kstars; cannot communicate with the telescope. Here are few things you can do:
fr: Ce message est déclenché lorsque &kstars; ne peut pas communiquer avec le télescope. Voici quelques manipulations que vous pouvez effectuer :

source: Check that you have both reading and writing permission for the port you are trying to connect to.
fr: vérifiez que vous avez à la fois les droits en lecture et en écriture pour le port auquel vous essayez de vous connecter.

source: Check the connection cable, make sure it is in good condition and test it with other applications.
fr: vérifiez la connexion du câble, assurez-vous qu'il est en bon état et testez-le avec d'autres applications.

source: Check your telescope power, make sure the power is on and that the telescope is getting enough power.
fr: vérifiez l'alimentation de votre télescope, assurez-vous que le contact est mis et que le télescope reçoit assez d'énergie.

source: Select the <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>INDI Control Panel...</guimenuitem></menuchoice> menu item and set the correct port in the <guilabel>INDI Control Panel</guilabel> dialog. The default device is <constant>/dev/ttyS0</constant>
fr: Sélectionner le menu <menuchoice><guimenu>Outils</guimenu> <guisubmenu>Périphériques</guisubmenu> <guimenuitem>Panneau de contrôle INDI…</guimenuitem></menuchoice>. Le périphérique par défaut est <constant>/dev/ttyS0</constant>.

source: Restart &kstars; and retry again.
fr: redémarrez &kstars; et réessayez.

source: &kstars; reports that the telescope is online and ready, but I cannot find the telescope's crosshair, where is it?
fr: &kstars; rapporte que le télescope est en ligne et prêt, mais je ne peux pas trouver la croix du télescope. Où est-elle ?

source: &kstars; retrieves the telescopes RA and DEC coordinates upon connection. If your alignment was performed correctly, then you should see the crosshair around your target in the Sky Map. However, the RA and DEC coordinates provided by the telescope may be incorrect (even below the horizon) and you need to <link linkend="indi-sync">Sync</link> your telescope to your current target. You can use the right-click menu to center and track the telescope crosshair in the sky map.
fr: &kstars; trouve les coordonnées AD et Déc du télescope en connexion. Si votre alignement a été effectué correctement, vous pouvez voir la croix près de votre cible dans la carte du ciel. Cependant, les coordonnées AD et Déc fournies par le télescope peuvent être incorrectes (même sous l'horizon) et vous avez besoin de <link linkend="indi-sync">synchroniser</link> votre télescope vers votre cible courante. Vous pouvez utiliser le menu contextuel pour centrer et suivre la croix du télescope dans la carte du ciel.

source: The telescope is moving erratically or not moving at all. What can I do?
fr: Le télescope se déplace d'une manière erratique ou pas du tout. Que puis-je faire ?

source: This behavior is mostly due to incorrect settings, please verify the following check list:
fr: Ce comportement est la plupart du temps dû à des réglages incorrects. Veuillez vérifier la liste suivante :

source: Is the telescope aligned?
fr: Le télescope est-il aligné ?

source: Is the telescope alignment mode correct? Use <guilabel>INDI Control Panel</guilabel> to check and change these settings (<constant>Alt/Az,Polar, Land</constant>).
fr: Le mode d'alignement du télescope est-il correct ? Utilisez le <guilabel>tableau de bord INDI</guilabel> pour le vérifier et changez ces réglages (<constant>Alt / Az, Polar, Land</constant>).

source: Are the telescope's time and date settings correct?
fr: Les réglages d'heure et date du télescope sont-ils corrects ?

source: Are the telescope's longitude and latitude settings correct?
fr: Les réglages de latitude et de longitude du télescope sont-ils corrects ?

source: Is the telescope's UTC offset correct?
fr: Le calage UTC du télescope est-il correct ?

source: Are the telescope's RA and DEC axis locked firmly?
fr: Les axes d'AD et de Déc du télescope sont-ils bien verrouillés ?

source: Is the telescope's N/S switch (when applicable) setup correctly for your hemisphere?
fr: Le réglage d'inverseur N / S de télescope (lorsque applicable) est-il correctement effectué pour votre hémisphère ?

source: Is the cable between the telescope and computer in good condition?
fr: Le câble entre le télescope et l'ordinateur est-il en bon état ?

source: If you think all settings are correct but the telescope still moves erratically or not at all, then please send a report to <email>indi-devel@lists.sourceforge.net</email>.
fr: Si vous pensez que tous les réglages sont corrects, mais que le télescope continue à bouger n'importe comment ou pas du tout, veuillez envoyer un rapport de bogue à <email>indi-devel@lists.sourceforge.net</email>.
