Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: For example, if the current focuser position is 1000, temperature = 4C, and if the Red filter is selected (last good focus position for Red is 990 @ 5C and Ekos is configured to move +3 <guilabel>Ticks / °C</guilabel>). Then, if Adapt Start Pos is off, Autofocus will start at 1000. If Adapt Start Pos is on, Autofocus will start at 990 + (5 - 4) * 3 = 993.
fr: Par exemple, si la position actuelle du moteur de mise au point est 1000, la température de 4°C et que le filtre rouge est sélectionné (la dernière bonne position de mise au point pour le filtre rouge est 990 à 5°C et Ekos est configuré pour se déplacer de °3 <guilabel>Pas / °C</guilabel>), alors si l'option de position de départ est à Off, le moteur de mise au point automatique démarrera à 1000. Si elle est à On, elle démarrera à 990+(5-4)*3=993.

source: This feature is useful to ensure that Autofocus starts from close to the focus point which will mean a more symmetric V-curve. It is particularly useful when changing between filters which have large differences in focus points.
fr: Cette fonctionnalité est utile pour s'assurer que le moteur de mise au point démarrera à une position proche du point de mise au point ce qui impliquera une courbe en V plus symétrique. Cela est particulièrement utile lors de changement de filtres qui ont une position de mise au point très différente.

source: It is possible to use this feature on its own without Adaptive Focus. Just set the checkbox and leave the ticks per degree C set to zero. This way the Autofocus start position will be filter dependent and will start each Autofocus run at the focus point of the last successful Autofocus run for that filter.
fr: Il est possible d'utiliser cette fonctionnalité seule sans la mise au point automatique. Il suffit pour cela de cocher la case et laisser la valeur de Pas / °C à zéro. Ainsi la position de départ de la mise au point automatique sera dépendante du filtre utilisé et démarrera chaque processus à la position de mise au point de la dernière position réussie pour le filtre en question.

source: <guilabel>Max Total Move</guilabel>: The maximum total focuser movement that Adaptive Focus is allowed in the observing session. The purpose of this is as a "dead man's handle" on Adaptive Focus in case it runs away. For example, if the temperature source fails and returns bad temperature readings whilst the equipment is unattended, this could result in Adaptive Focus attempting to make large focuser movements.
fr: <guilabel>Déplacement total maximal</guilabel> : la valeur totale maximale du moteur de mise au point permise pour la mise au point adaptative d'une session d'observation. Cela permet de limiter la course du moteur de mise au point en cas de problème. Par exemple, si la source de température rencontre un problème et échoue à donner une valeur correcte pendant que l'équipement n'est pas surveillé, cela pourrait aboutir à ce que l'algorithme tente de grands déplacements du moteur de mise au point.

source: If the Max Total Move is reached then <guilabel>Adaptive Focus</guilabel> is unchecked until manually re-checked by the user.
fr: Dès que cette valeur est atteinte, l'option <guilabel>Mise au point adaptative</guilabel> est décochée jusqu'à une intervention manuelle de l'opérateur.

source: <title>Focus Process</title>
fr: <title>Procédure de mise au point</title>

source: <screeninfo>Focus Process</screeninfo>
fr: <screeninfo>Procédure de mise au point</screeninfo>

source: <phrase>Focus Process</phrase>
fr: <phrase>Procédure de mise au point</phrase>

source: Focus Process Parameters:
fr: Paramètres du processus de mise au point :

source: <guilabel>Detection</guilabel>: Select star detection algorithm. Each algorithm has its strengths and weaknesses. It is recommended to use SEP, unless you have a specialized use. The following are available:
fr: <guilabel>Détection</guilabel> : choix de l'algorithme de détection d'étoile. Chaque algorithme a ses forces et ses faiblesses. Il est recommandé d'utiliser SEP sauf en cas d'utilisation particulière. Voici ce qui est disponible :

source: <emphasis role="bold">SEP</emphasis>: Source Extraction and Photometry built in library. This is the default value.
fr: <emphasis role="bold">SEP</emphasis> : la bibliothèque intégrée d'extraction de source et de photométrie (Source Extraction and Photometry). C'est la valeur par défaut.

source: <emphasis role="bold">Centroid</emphasis>: An extraction method based on estimating star mass around signal peaks.
fr: <emphasis role="bold">Centroïde</emphasis> : une méthode d'extraction fondée sur une estimation de la masse de l'étoile autour du pic du signal.

source: <emphasis role="bold">Gradient</emphasis>: A single source extraction model based on the Sobel filter.
fr: <emphasis role="bold">Gradient</emphasis> : une méthode d'extraction d'une source unique fondée sur le filtre de Sobel.

source: <emphasis role="bold">Threshold</emphasis>: A single source detection algorithm based on pixel values.
fr: <emphasis role="bold">Seuil</emphasis> : une méthode d'extraction d'une source unique fondée sur la valeur des pixels.

source: <emphasis role="bold">Bahtinov</emphasis>: This detection method can be used when using a Bahtinov mask for focusing. First take an image, then select the star to focus on. A new image will be taken and the diffraction pattern will be analysed. Three lines will be displayed on the diffraction pattern showing how well the pattern is recognized and how good the image is in focus. When the pattern is not well recognized, the <emphasis>Num. of rows</emphasis> parameter can be adjusted to improve recognition. The line with the circles at each end is a magnified indicator for the focus. The shorter the line, the better the image is in focus.
fr: <emphasis role="bold">Bathinov</emphasis> : cette méthode de détection peut être utilisée quand un masque de Bathinov est utilisé pour la mise au point. Prenez d'abord une image, puis sélectionnez l'étoile sur laquelle faire la mise au point. Une nouvelle image sera prise et le motif de diffraction sera analysé. Trois lignes seront affichées sur le motif de diffraction montrant la qualité de la détection et de la mise au point. Quand le motif n'est pas bien détecté, le paramètre <emphasis>Nombre de lignes</emphasis> peut être ajusté pour améliorer la détection. La ligne avec les cercles aux deux bouts est un indicateur grossi pour la mise au point. Plus cette ligne est courte et meilleure sera la mise au point.

source: <guilabel>SEP Profile</guilabel>: If the star detection algorithm is set to <emphasis>SEP</emphasis>, then choose a parameter profile to use with the algorithm. It is recommended to use the default 1-Focus-Default profile as a starting point.
fr: <guilabel>Profile SEP</guilabel> : si l'algorithme de détection d'étoiles est réglé à <emphasis>SEP</emphasis>, il faut ensuite choisir un paramètre de profil pour l'utilisation de l'algorithme. Il est recommandé d'utiliser le profile par défaut 1-Focus-Default comme point de départ.

source: <guilabel>Algorithm</guilabel>: Select the Autofocus process algorithm:
fr: <guilabel>Algorithme</guilabel> : choisissez l'algorithme pour la procédure de mise au point automatique :

source: <emphasis role="bold">Linear 1 Pass</emphasis>: This is the recommended algorithm. In this algorithm, Ekos establishes a V-Curve and fits a curve to the data to find the focus solution. It then moves to the calculated solution.
fr: <emphasis role="bold">Linéaire 1 passe</emphasis> : c'est l'algorithme recommandé. Il débute en établissant une courbe en V puis en interpolant cette courbe pour trouver une solution. Puis il se déplace directement à la solution calculée.

source: This algorithm supports the older style Quadratic curve type as well as the newer <link linkend="Levenberg-Marquardt">Levenberg-Marquardt Solver</link> for Hyperbolic and Parabolic curves. It will also weight the datapoints in the curve fitting process if <guilabel>Use Weights</guilabel> is checked and run a refinement process if <guilabel>Refine Curve Fit </guilabel> is selected.
fr: Cet algorithme gère l'ancien type de courbe quadratique ainsi que le nouveau <link linkend="Levenberg-Marquardt">résolveur Levenberg-Marquardt</link> pour les courbes hyperboliques et paraboliques. Il déterminera aussi les poids des points de régression si l'option <guilabel>Utiliser les poids</guilabel> est cochée et exécutera une procédure d'ajustement si l'option <guilabel>Ajuster la courbe de régression</guilabel> est cochée.

source: <emphasis role="bold">Linear</emphasis>: This algorithm builds a V-Curve with approximately <emphasis role="bold">Out step Multiple</emphasis> steps on each side of the minimum. Having built the V-Curve it then fits a quadratic equation to the curve (parabolic shape) and uses this to calculate the focuser position giving the minimum HFR. Having identified the minimum it then performs a 2nd pass halving the step size, recreating the curve from the 1st pass. It attempts to stop within <emphasis role="bold">Tolerance</emphasis> of the minimum HFR calculated during the 1st pass.
fr: <emphasis role="bold">Linéaire</emphasis> : cet algorithme construit une courbe en V avec approximativement un <emphasis role="bold">multiple de pas extérieur</emphasis> de chaque côté du minimum. Une fois cette courbe en V construite, une régression quadratique est réalisée sur cette courbe (forme parabolique) et l'utilise pour calculer la position du moteur de mise au point, ce qui donne la valeur minimale du HFR. Une fois cette valeur minimale identifiée, une seconde passe est réalisée avec des pas divisés par deux pour recréer la courbe de la première passe. L'algorithme s'arrête une fois que la valeur est dans la <emphasis role="bold">tolérance</emphasis> de la valeur minimale du HFR calculée lors de la première passe.

source: <emphasis role="bold">Iterative</emphasis>: Moves focuser by discreet steps initially decided by the step size. Once a curve slope is calculated, further step sizes are calculated to reach an optimal solution. The algorithm stops when the measured HFR is within <emphasis role="bold">Tolerance</emphasis> of the minimum HFR recorded in the procedure.
fr: <emphasis role="bold">Itératif</emphasis> : déplace le moteur de mise au point par pas discret de taille initiale fixée. Une fois que la pente de la courbe est calculée, les tailles de pas suivants sont calculées pour atteindre une solution optimale. L'algorithme s'arrête dès que la valeur HFR mesurée se trouve dans la plage de <emphasis role="bold">tolérance</emphasis> définie.

source: <emphasis role="bold">Polynomial</emphasis>: Starts with the iterative method. Upon crossing to the other side of the V-Curve, polynomial fitting coefficients along with possible minimum solution are calculated. This algorithm can be faster than a purely iterative approach given a good data set.
fr: <emphasis role="bold">Polynomial</emphasis> : débute avec la méthode itérative. Quand la position passe de l'autre côté de la courbe en V, une régression polynomiale est calculée pour déterminer la position de la solution minimale. Cet algorithme peut être plus rapide que la méthode itérative avec un bon ensemble de données.

source: <guilabel>Curve Fit</guilabel>: The type of curve to fit to the datapoints.
fr: <guilabel>Courbe de régression</guilabel> : le type de courbe pour la régression des points.

source: <emphasis role="bold">Hyperbola</emphasis>: Fits a Hyperbola using a non-linear least squares algorithm supplied by GSL (GNU Science Library). See <link linkend="Levenberg-Marquardt">Levenberg-Marquardt Solver</link> for more details.
fr: <emphasis role="bold">Hyperbole</emphasis> : interpole une hyperbole avec l'algorithme non-linéaire de moindres carrés fourni par la bibliothèque GNU Science GSL. Veuillez voir le <link linkend="Levenberg-Marquardt">résolveur Levenberg-Marquardt Solver</link> pour davantage de détails.

source: This is the recommended option.
fr: Cela est l'option recommandée.

source: <emphasis role="bold">Parabola</emphasis>: Fits a Parabola using a non-linear least squares algorithm supplied by GSL (GNU Science Library). See <link linkend="Levenberg-Marquardt">Levenberg-Marquardt Solver</link> for more details.
fr: <emphasis role="bold">Parabole</emphasis> : interpole une parabole avec l'algorithme non-linéaire de moindres carrés fourni par la bibliothèque GNU Science GSL. Veuillez voir le <link linkend="Levenberg-Marquardt">résolveur Levenberg-Marquardt Solver</link> pour davantage de détails.

source: <emphasis role="bold">Quadratic</emphasis>: Uses a quadratic equation using a linear style least squares algorithm supplied by GSL (GNU Science Library). This is, in effect, a parabolic curve.
fr: <emphasis role="bold">Quadratique</emphasis> : utilise une équation quadratique avec l'algorithme de moindres carrés linéaire fourni par la bibliothèque GNU Science GSL.

source: It is no longer recommended to use this curve.
fr: Il n'est plus recommandé d'utiliser cette courbe.

source: <guilabel>Measure</guilabel>: Select Measure to use in the focus process. The following are available:
fr: <guilabel>Mesure</guilabel> : choisissez une mesure pour la procédure de mise au point automatique. Les options suivantes sont disponibles :

source: <emphasis role="bold">HFR</emphasis>: Half Flux Radius (HFR) is the recommended measure. When a star is detected, Ekos will calculate the HFR for the star. This is the radius of an imaginary circle, centered on the star center, that encloses half the star's total flux.
fr: <emphasis role="bold">HFR</emphasis> : HFR est la mesure recommandée. À la détection d'une étoile, Ekos calculera le HFR de l'étoile. C'est la moitié du flux total de l'étoile contenu dans un cercle imaginaire autour du centre de l'étoile.

source: The point of best focus corresponds to the minimum HFR.
fr: La position de la meilleure mise au point correspond au minimum de HFR.

source: <emphasis role="bold">HFR Adj</emphasis>: This feature uses a brightness adjusted HFR calculation to take account of the fact that the HFR for brighter stars is larger than for smaller stars.
fr: <emphasis role="bold">HFR ajusté</emphasis> : cette fonctionnalité utilise un calcul ajusté du HFR qui tient compte du fait que le HFR des étoiles plus lumineuses est plus large que pour les étoiles peu lumineuses.

source: The algorithm adjusts the value of the measured HFR, usually upwards, so the HFRs obtained by the HFR Adj method will be higher than the measured HFR values. This does not mean that you are getting worse results by using HFR Adj, simply that the measure is different.
fr: L'algorithme ajuste la valuer du HFR mesuré, généralement vers le haut, de telle sorte que le HFR obtenu par cette méthode est plus grand que les valeurs HFR mesurées. Cela ne signifie pas que vous obtenez de moins bons résultats avec cette méthode mais simplement que la mesure est différente.

source: When using this Measure it is usual to get smaller error bars on the datapoints when <guilabel>Use Weights</guilabel> is selected.
fr: Avec cette mesure, il est courant d'obtenir des barres d'erreur plus petites pour l'ensemble de données quand <guilabel>Utiliser les poids</guilabel> est utilisée.

source: The point of best focus corresponds to the minimum adjusted HFR.
fr: La position de la meilleure mise au point correspond au minimum du HFR ajusté.

source: <emphasis role="bold">FWHM</emphasis>: This feature fits a Gaussian surface to each star and uses that to calculate the Full Width Half Maximum (FWHM) of the star. The FWHM is the width of an circle (or ellipse) centered on the star center reaching the edge of the star at half its maximum intensity.
fr: <emphasis role="bold">FWHM</emphasis> : cette fonctionnalité ajuste une surface gaussienne à chaque étoile et l'utilise pour calculer le FWHM de l'étoile. Le FWHM est la largeur d'un cercle (ou d'une ellipse) autour du centre de l'étoile et qui atteint le bord de l'étoile à la moitié de son intensité maximale.

source: The point of best focus corresponds to the minimum FWHM.
fr: La meilleure position de la mise au point correspond au minimum de FWHM.

source: Expect the FWHM to be approximately twice the HFR of a star.
fr: Attendez-vous que le FWHM soit environ le double du HFR de l'étoile.

source: <emphasis role="bold"># Stars</emphasis>: This feature calculates the number of stars in the image and uses this number as the focus measure. The idea is that as you move nearer focus so more stars become detectable.
fr: <emphasis role="bold"># étoiles</emphasis> : cette fonctionnalité calcule le nombre d'étoiles de l'image et utilise ce nombre pour une mesure de la mise au point. L'idée est qu'en s'approchant de plus en plus de la position de mise au point, davantage d'étoiles deviendront détectables.

source: The advantage of this Measure is that it is very simple and does not require algorithms to calculate HFRs or FWHMs.
fr: L'avantage de cette mesure est sa simplicité puisqu'elle ne requiert pas de calculer le HFR ou le FWHM.

source: The point of best focus corresponds to a maximum number of stars.
fr: La position de meilleure mise au point correspond au nombre maximal d'étoiles.

source: <emphasis role="bold">Fourier</emphasis>: Fourier takes a Fourier transform of the image and calculates the image power in frequency space. The assumption is that for an astronomical image of stars and background, the stars will be gaussians. Under a Fourier transform, a gaussian transforms to another gaussian; but wider stars transform to narrower gaussians in frequency space, and vice-versa. So, at focus, summing up the contents in frequency space, which is in effect a measure of power, will be a maximum.
fr: <emphasis role="bold">Fourier</emphasis> : cette méthode utilise une transformée de Fourier de l'image et calcule sa puissance dans l'espace des fréquences. L'hypothèse est que pour une image astronomique d'étoiles et de fond, les étoiles suivront une gaussienne. Dans une transformée de Fourier, une gaussienne se transforme en une autre gaussienne ; mais les étoiles les plus larges se transformeront en une gaussienne plus étroite dans l'espace des fréquences et vice-versa. Ainsi, à la position de meilleure mise au point, la somme en espace des fréquences, qui est une mesure de la puissance, sera un maximum.

source: This follows the main idea suggested by Tan and Schulz in their paper: <ulink url="https://arxiv.org/pdf/2201.12466.pdf">A Fourier method for the determination of focus for telescopes with stars</ulink>. Please note that this paper makes other processing suggestions beyond the idea of using Fourier Transforms that are not included within Ekos
fr: Cette méthode implémente l'idée principale de Tan et Schulz dans leur papier <ulink url="https://arxiv.org/pdf/2201.12466.pdf">A Fourier method for the determination of focus for telescopes with stars</ulink>. Veuillez noter que d'autres idées sont formulées dans ce papier mais ne sont pas implémentées dans Ekos.

source: This is a relatively new method in the Astro Community, and does not require star detection. Tan and Schulz report good results with both amateur and professional telescopes.
fr: Cette méthode est relativement nouvelle dans la communauté astronomique et ne requiert pas de détection d'étoiles. Tan et Schulz rapportent de bons résultats autant avec des télescopes amateurs que professionnels.

source: <guilabel>PSF</guilabel>: If <guilabel>Measure</guilabel> is set to FWHM, then the PSF widget can be selected for use in fitting a surface to the star. At present just Gaussian is supported.
fr: <guilabel>PSF</guilabel> : si <guilabel>Mesure</guilabel> est réglé à FWHM, alors le composant graphique PSF peut être sélectionné pour être utilisé pour appliquer la régression de la surface à l'étoile. Pour le moment seule la méthode gaussienne est proposée.

source: <guilabel>Use Weights</guilabel>: This is only available with the Linear 1 Pass focus algorithm and Curve Fits of Hyperbola and Parabola. It requires Full Field to be selected. The option calculates the standard deviation of star Measure and uses the square of this (mathematically the variance) as a weighting in the curve fitting process. The advantage of this is that datapoints with less reliable data and therefore larger HFR standard deviations will be given less weight than more reliable datapoints. If this option is unchecked, and for all other curve fitting where the option is not allowed, all datapoints are given equal weight in the curve fitting process.
fr: <guilabel>Utiliser les poids</guilabel> : cette option est encore expérimentale et n'est disponible qu'avec l'algorithme de mise au point linéaire à 1 passe et le type de courbe hyperbole et parabole. Elle nécessite l'option Plein Champ. Elle calcule la déviation standard du HFR des étoiles et utilise le carré de cette valeur (la variance mathématique) comme poids pour la courbe de régression. L'avantage de cette méthode est que les points moins fiables, de déviation standard du HFR plus grande, auront un poids plus petit que les points plus fiables. Si cette option n'est pas cochée, et pour toutes les courbes de régression n'autorisant pas cette option, tous les points auront un poids identique dans le calcul de régression.

source: The standard deviation is drawn on the V-Curve for each datapoint as an error bar.
fr: La déviation standard est dessinée comme barre d'erreur sur la courbe en V pour chaque ensemble de points.

source: It is recommended to check this option.
fr: Il est recommandé de cocher cette option.

source: See the <link linkend="Levenberg-Marquardt">Levenberg-Marquardt Solver</link> for more details.
fr: Voir le <link linkend="Levenberg-Marquardt">résolveur de Levenberg-Marquardt</link> pour davantage de détails.

source: <guilabel>R² Limit</guilabel>: This is only available with the Linear 1 Pass focus algorithm and Curve Fits of Hyperbola and Parabola. As part of the Linear 1 Pass algorithm, the degree to which the curve fits the datapoints, or <link linkend="Coefficient_of_Determination">Coefficient of Determination, R²</link>, is calculated. This option allows a minimum acceptable value of R² to be defined that is compared to the value obtained from the curve fitting process. If the minimum value has not been achieved then Autofocus will rerun. Only one rerun will be performed and even if the minimum R² has not been met the second time, the Autofocus run will still be deemed successful.
fr: <guilabel>Limite R²</guilabel> : cette option est encore expérimentale et n'est disponible qu'avec l'algorithme de mise au point linéaire à 1 passe et le type de courbe hyperbole et parabole. Faisant partie de l'algorithme linéaire à 1 passe, le degré de la courbe de régression, ou <link linkend="Coefficient_of_Determination">coefficient de détermination R²</link> est calculé. Cette option permet de définir une valeur minimale acceptable pour R² qui est comparée à la valeur obtenue par la régression. Si la valeur minimale n'a pas été atteinte, alors la procédure de mise au point automatique est relancée. Néanmoins, une seule relance du processus sera réalisée et même si le minimum de R² n'a pas été atteinte, le processus de mise au point automatique sera considérée comme étant un succès.

source: Experiment to find an appropriate value but a good starting point would be 0.8 or 0.9
fr: Testez pour trouver une valeur appropriée mais un bon point de départ serait 0,8 ou 0,9.
