Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_blackbody.po
Languages: fr

source: <title>Blackbody Radiation</title>
fr: <title>Radiation de corps noir</title>

source: <primary>Blackbody Radiation</primary>
fr: <primary>Radiation de corps noir</primary>

source: Star Colors and Temperatures
fr: Couleurs et températures des étoiles

source: A <firstterm>blackbody</firstterm> refers to an opaque object that emits <firstterm>thermal radiation</firstterm>. A perfect blackbody is one that absorbs all incoming light and does not reflect any. At room temperature, such an object would appear to be perfectly black (hence the term <emphasis>blackbody</emphasis>). However, if heated to a high temperature, a blackbody will begin to glow with <firstterm>thermal radiation</firstterm>.
fr: Un <firstterm>corps noir</firstterm> se réfère à un objet opaque qui émet <firstterm>des rayonnements thermiques</firstterm>. Un corps noir parfait absorbe toute la lumière entrante et n'en reflète pas du tout. À la température de la pièce, un corps noir parfait apparaît parfaitement noir (d'où le nom de <emphasis>corps noir</emphasis>). Cependant, lorsqu'on le chauffe à haute température, un corps noir commencera à briller avec les <firstterm>radiations thermiques</firstterm>.

source: In fact, all objects emit thermal radiation (as long as their temperature is above Absolute Zero, or -273.15 degrees Celsius), but no object emits thermal radiation perfectly; rather, they are better at emitting/absorbing some wavelengths of light than others. These uneven efficiencies make it difficult to study the interaction of light, heat and matter using normal objects.
fr: En fait, tous les objets émettent des rayonnements thermiques (tant que leur température est au-dessus du zéro absolu, soit -273,15 degrés Celsius), mais aucun objet n'émet réellement des radiations parfaites ; plus précisément, ils sont meilleurs pour l'émission/absorption de lumière pour certaines longueurs d'onde que pour les autres. Ce comportement irrégulier rend difficile l'étude de l'interaction avec la lumière, la chaleur et la matière en utilisant des objets normaux.

source: Fortunately, it is possible to construct a nearly-perfect blackbody. Construct a box made of a thermally conductive material, such as metal. The box should be completely closed on all sides, so that the inside forms a cavity that does not receive light from the surroundings. Then, make a small hole somewhere on the box. The light coming out of this hole will almost perfectly resemble the light from an ideal blackbody, for the temperature of the air inside the box.
fr: Heureusement, il est possible de construire un corps noir presque parfait. Construisons une boîte faite d'un matériau conduisant la chaleur, comme le métal. La boîte doit être complètement fermée sur tous les côtés, de telle manière que l'intérieur forme une cavité qui ne reçoit pas de lumière de l'extérieur. Puis, faisons un petit trou quelque part dans la boîte. La lumière sortant de ce trou ressemblera presque parfaitement à la lumière émise par un corps noir parfait pour la température de l'air qui se trouve à l'intérieur.

source: At the beginning of the 20th century, scientists Lord Rayleigh, and Max Planck (among others) studied the blackbody radiation using such a device. After much work, Planck was able to empirically describe the intensity of light emitted by a blackbody as a function of wavelength. Furthermore, he was able to describe how this spectrum would change as the temperature changed. Planck's work on blackbody radiation is one of the areas of physics that led to the foundation of the wonderful science of Quantum Mechanics, but that is unfortunately beyond the scope of this article.
fr: Au début du 20<superscript>e</superscript> siècle, les scientifiques Lord Rayleigh et Max Planck (entre autres) ont étudié les rayonnements du corps noir en utilisant un tel matériel. Après beaucoup de travail, Planck a pu décrire empiriquement l'intensité de la lumière émise par un corps noir comme une fonction de la longueur d'onde. De plus, il a pu décrire comment ce spectre changeait avec la température. Le travail de Planck sur les rayonnements du corps noir est l'un des domaines de la physique qui a mené à la fondation de la merveilleuse science de la mécanique quantique, mais est malheureusement au-delà du périmètre de cet article.

source: What Planck and the others found was that as the temperature of a blackbody increases, the total amount of light emitted per second increases, and the wavelength of the spectrum's peak shifts to bluer colors (see Figure 1).
fr: Ce que Planck et les autres ont trouvé est que lorsque la température d'un corps noir augmente, la quantité totale de lumière émise par seconde augmente, et la longueur d'onde du pic spectral se déplace vers les couleurs bleues (voir la figure 1).

source: For example, an iron bar becomes orange-red when heated to high temperatures and its color progressively shifts toward blue and white as it is heated further.
fr: Par exemple une barre de fer devient orange-rouge lorsqu'elle est chauffée à haute température et sa couleur se modifie progressivement vers le bleu puis le blanc lorsqu'elle est chauffée encore davantage.

source: In 1893, German physicist Wilhelm Wien quantified the relationship between blackbody temperature and the wavelength of the spectral peak with the following equation:
fr: En 1893 le physicien allemand Wilhelm Wien a quantifié la relation entre la température du corps noir et la longueur d'onde du pic spectral par l'équation suivante :

source: where T is the temperature in Kelvin. Wien's law (also known as Wien's displacement law) states that the wavelength of maximum emission from a blackbody is inversely proportional to its temperature. This makes sense; shorter-wavelength (higher-frequency) light corresponds to higher-energy photons, which you would expect from a higher-temperature object.
fr: où T est la température en Kelvin. La loi de Wien (aussi connue comme loi de déplacement de Wien) dit que la longueur d'onde d'émission maximale d'un corps noir est inversement proportionnelle à sa température. Cela signifie que les longueurs d'onde courtes (plus haute fréquence) correspondent à des photons de plus haute énergie, ce que vous attendez d'un objet plus chaud.

source: For example, the sun has an average temperature of 5800 K, so its wavelength of maximum emission is given by:
fr: Par exemple le Soleil a une température moyenne de 5 800 K, donc sa longueur d'onde d'émission maximale est donnée par :

source: This wavelengths falls in the green region of the visible light spectrum, but the sun's continuum radiates photons both longer and shorter than lambda(max) and the human eyes perceives the sun's color as yellow/white.
fr: Cette longueur d'onde tombe dans la région verte du spectre visible, mais les radiations continues des photons du Soleil, à la fois plus longues et plus courtes que &lambda;<subscript>max</subscript> font que l'œil humain perçoit la couleur du Soleil comme jaune / blanche.

source: In 1879, Austrian physicist Stephan Josef Stefan showed that the luminosity, L, of a black body is proportional to the 4th power of its temperature T.
fr: En 1879, le physicien autrichien Stephan Josef Stefan montra que la Luminance L d'un corps noir est proportionnelle à la puissance quatrième de sa température T.

source: where A is the surface area, alpha is a constant of proportionality, and T is the temperature in Kelvin. That is, if we double the temperature (e.g. 1000 K to 2000 K) then the total energy radiated from a blackbody increase by a factor of 2<superscript>4</superscript> or 16.
fr: où A est la superficie de la surface, &alpha; est une constante de proportionnalité et T est la température en Kelvin. Ainsi, si nous doublons la température (par ex. 1 000 K à 2 000 K), l'énergie totale rayonnée par un corps noir augmente d'un facteur 2<superscript>4</superscript>, soit 16.

source: Five years later, Austrian physicist Ludwig Boltzman derived the same equation and is now known as the Stefan-Boltzman law. If we assume a spherical star with radius R, then the luminosity of such a star is
fr: Cinq années plus tard, le physicien autrichien Ludwig Boltzman a dérivé la même équation qui est maintenant connue comme loi de Stefan-Boltzman. Si nous prenons une étoile sphérique avec un rayon R, la luminance d'une telle étoile est

source: where R is the star radius in cm, and the alpha is the Stefan-Boltzman constant, which has the value:
fr: où R est le rayon de l'étoile en cm et &alpha; est la constante de Stefan Boltzman, qui a la valeur :
