Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: <title>Aberration Inspector Results</title>
fr: <title>Résultats de l'inspecteur d'aberration</title>

source: <screeninfo>Aberration Inspector Results</screeninfo>
fr: <screeninfo>Résultats de l'inspecteur d'aberration</screeninfo>

source: <phrase>Aberration Inspector Results</phrase>
fr: <phrase>Résultats de l'inspecteur d'aberration</phrase>

source: The calculation results are displayed in this section, based on the data displayed in the table:
fr: Les résultats des calculs sont affichés dans cette section, fondés sur les données affichées dans la table :

source: <guilabel>Backfocus Δ</guilabel>: This is the value of the Backfocus delta. The nearer to perfect backfocus, the lower the backfocus delta. Note that the Backfocus delta gives a clue as to how far out the Backfocus is, in terms of scale and direction, but is not the amount by which the sensor needs to be moved. The relationship between backfocus Delta and how far to move the sensor will vary with the equipment used, and needs to be worked out by the user.
fr: <guilabel>Δ du backfocus</guilabel> : la valeur du delta du backfocus. Le meilleur backfocus est obtenu pour des deltas petits. Veuillez noter que cette valeur donne une indication sur le positionnement du backfocus en terme d'échelle et de direction, mais n'est en aucun cas une mesure de la quantité à déplacer le capteur. La relation entre ces deux grandeurs dépend de l'équipement et nécessite d'être trouvée par l'utilisateur.

source: The field gives the sense of the backfocus movement required to improve backfocus: either move the sensor nearer to the field flattener (telescope) or move it further away.
fr: Le champ donne le sens de mouvement du backfocus nécessaire à l'améliorer ; il faut soit le rapprocher du correcteur de champ du télescope, soit l'en éloigner.

source: <guilabel>Left-Right Tilt</guilabel>: Gives the Left to Right tilt in microns and as a percentage.
fr: <guilabel>Inclinaison gauche-droite</guilabel> : indique l'inclinaison gauche-droite en microns et en pourcentage.

source: <guilabel>Top-Bottom Tilt</guilabel>: Gives the Top to Bottom tilt in microns and as a percentage
fr: <guilabel>Inclinaison haut-bas</guilabel> : indique l'inclinaison haut-bas en microns et en pourcentage.

source: <guilabel>Total Tilt</guilabel>: The diagonal tilt in microns and as a percentage.
fr: <guilabel>Inclinaison totale</guilabel> : l'inclinaison diagonale en microns et en pourcentage

source: The smaller the backfocus delta the nearer the sensor is to perfect backfocus. If the field flattner does not flatten the field all the way to the edges of the sensor then this will be visible by switching the Tiles option between "Centre and outer corners" and "Centre and inner diamond". If the backfocus delta results are consistent when the Tiles option is changed then this indicates that the field flattener is working to the corners of the sensor.
fr: À nouveau, plus le delta est petit et plus le capteur est près du backfocus parfait. Si l'aplatisseur de champ n'aplatit pas le champ jusque dans les coins du capteur, il est possible de voir cela en positionnant l'option de « Centre et coins extérieurs » à « Centre et losanges intérieurs ». Si les résultats du backfocus sont cohérents entre ces deux options, cela signifie que l'aplatisseur de champ fait bien son travail jusqu'aux coins du capteur.

source: There will always be some backfocus delta at least because of noise in the observation data. The important thing is that when in focus, stars are circular in all parts of the sensor.
fr: Il y aura toujours un peu de backfocus, et cela est dû au bruit contenu dans les données. La chose importante est qu'en position de mise au point, les étoiles sont circulaires sur toute la surface du capteur.

source: The smaller the tilt percentages, the nearer the sensor is to being flat to the plane of light from the flattener / telescope. As with backfocus delta, there is always going to be some noise in the data, which will present as tilt. The important thing is that when in focus the star sizes are consistent across all parts of the sensor.
fr: Plus le pourcentage d'inclinaison est petit et plus le capteur est parallèle au plan de la lumière provenant de l'aplatisseur et du télescope. Comme pour le delta du backfocus, il y aura toujours un peu de bruit dans les données, ce qui sera présenté comme du bruit. Le point important est la taille des étoiles qui doit être cohérente sur toute la surface du capteur.

source: Because of the nature of the backfocus delta and tilt calculations, one will affect the other so it will probably be better to try and adjust both together, in small increments, rather than trying to perfect one in isolation, before adjusting the other.
fr: Comme ces deux grandeurs sont liées dans les calculs, l'une affectera l'autre et il sera ainsi plus judicieux d'ajuster les deux grandeurs en même temps, par petite touche, plutôt que d'essayer d'ajuster parfaitement l'une avant d'ajuster l'autre.

source: <title>Aberration Inspector 3D Graphic</title>
fr: <title>Graphique 3D de l'Inspecteur d'aberration</title>

source: <screeninfo>Aberration Inspector 3D Graphic</screeninfo>
fr: <screeninfo>Graphique 3D de l'inspecteur d'aberration</screeninfo>

source: <phrase>Aberration Inspector 3D Graphic</phrase>
fr: <phrase>Graphique 3D de l'inspecteur d'aberration</phrase>

source: The 3D graphic displays the sensor tilted as per the <link linkend="aberration-inspector-results">Aberration Inspector Results</link>. To help visualise the Petzval surface (see <ulink url="https://en.wikipedia.org/wiki/Petzval_field_curvature">Petzval Field Curvature</ulink> for more details) of light coming out of the telescope and incident on the sensor the surface is also modelled. The higher the backfocus error, the more curved the Petzval surface.
fr: Le graphique 3D affiche le capteur incliné selon les <link linkend="aberration-inspector-results">résultats de l'Inspecteur d'aberration</link>. Pour faciliter la visualisation de la surface de Petzval (voir <ulink url="https://en.wikipedia.org/wiki/Petzval_field_curvature">Petzval Field Curvature</ulink> pour davantage de détails) de la lumière provenant du télescope sur le capteur, la surface du capteur est également modélisée. Plus l'erreur de backfocus est importante et plus la surface de Petzval sera courbée.

source: The graphic can be zoomed and rotated using gestures. To zoom use pinch. To rotate use touch-and-move.
fr: Le graphique peut être zoomé et tourné à l'aide de mouvements. Pour zoomer, il faut pincer et pour tourner, il faut toucher et déplacer.

source: The graphic has a Simulation Mode that allows backfocus and tilt to be adjusted by the sliders. The effect on the sensor's tilt and Petzval surface is displayed in the graphic.
fr: Le graphique possède un mode de simulation permettant d'ajuster le backfocus et l'inclinaison à l'aide de curseurs. L'effet de l'inclinaison du capteur et de la surface de Petzval est affiché sur le graphique.

source: The following options are available for the graphic:
fr: Les options suivantes sont disponibles pour le graphique

source: <guilabel>Selection</guilabel>: The following options are available:
fr: <guilabel>Sélection</guilabel> : les options suivantes sont disponibles :

source: None: No selection is possible.
fr: Aucun : aucune sélection possible

source: Item: A datapoint may be selected and data values are displayed.
fr: Point : un point peut être sélectionné et ses valeurs affichées.

source: Slice: A 2D slice through the 3D graphic is displayed.
fr: Tranche : une tranche 2D du graphique 3D est affichée.

source: <guilabel>Theme</guilabel>: A number of colour themes are available.
fr: <guilabel>Thème</guilabel> : un certain nombre de thèmes de couleurs est disponible.

source: <guilabel>Labels</guilabel>: Checkbox to show / hide tile labels on the graphic.
fr: <guilabel>Étiquettes</guilabel> : case à cocher pour afficher/masquer les étiquettes des tuiles sur le graphique.

source: <guilabel>Sensor</guilabel>: Checkbox to show / hide the sensor.
fr: <guilabel>Capteur</guilabel> : case à cocher pour afficher/masquer le capteur.

source: <guilabel>Petzval Wire</guilabel>: Checkbox to show / hide the Petzval surface as a graphic wire.
fr: <guilabel>Câble de Petzval</guilabel> : case à cocher pour afficher/masquer la surface de Petzval comme un câble de Petzval.

source: <guilabel>Petzval Surface</guilabel>: Checkbox to show / hide the Petzval surface.
fr: <guilabel>Surface de Petzval</guilabel> : case à cocher pour afficher/masquer la surface de Petzval.

source: <guilabel>Sim Mode</guilabel>: Checkbox to toggle Simulation Mode on / off. When off, the graphic displays the sensor and Petzval surface based on the calculated results of the Aberration Inspector run. When on, the sliders for Backfocus, Left-to-Right tilt and Top-to-Bottom tilt are activated, and these can be dragged by the user to adjust the graphic. Hover the mouse over each slider to see the tooltips describing what each slider does.
fr: <guilabel>Mode simulation</guilabel> : case à cocher pour (dés)activer le mode simulation. Quand décoché, le graphique affiche le capteur et la surface de Petzval selon les résultats calculés par l'Inspecteur d'aberration. Quand coché, les curseurs du backfocus et des inclinaisons sont activés et peuvent être modifiés par l'utilisateur. Un survol par la souris des curseurs décrit leur fonctionnalité.

source: The 3D graphic is not essential to using Aberration Inspector. All relevant information is displayed in the <link linkend="aberration-inspector-table">Table</link> and <link linkend="aberration-inspector-results">Results</link> sections of the dialog. Its purpose is to aid the user in understanding Aberration Inspector and to orient themselves with the information the tool provides.
fr: Le graphique 3D n'est pas essentiel pour l'utilisation de l'Inspecteur d'aberration. Toute l'information pertinente est affichée dans la section <link linkend="aberration-inspector-table">Tableau</link> et <link linkend="aberration-inspector-results">Résultats</link>. Son intérêt réside surtout dans l'aide qu'il apporte à l'utilisateur pour la compréhension de l'Inspecteur d'aberration et de l'orienter vers l'information que fournit l'outil.
