Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_config.po
Languages: fr

source: Each time it starts up, &kstars; looks for new image overlay images in a special directory, parallel to the logs directory, named <literal>imageOverlays</literal>. On Linux this can be found in <filename class="directory">~/.local/share/kstars/imageOverlays</filename>. The exact location for your system can be found by clicking the <guibutton>Overlay Directory</guibutton> button near the top of the <guilabel>Image Overlays</guilabel> config page shown at the top of this section. To start, add your images to that directory. Ideally, for performance reasons these aren't massive files, but probably images with widths 1000 or 2000 should be fine. To add additional images in the future, add them to the same directory and click the refresh button or restart &kstars;. To remove overlays, remove them from the directory and click the refresh button or restart &kstars;.
fr: À chaque démarrage, &kstars; recherche la présence de nouvelles images de superposition d'image dans un dossier spécial, en parallèle au dossier de fichiers journaux, nommé <literal>imageOverlays</literal>. Sur les systèmes Linux, les images se trouvent dans <filename class="directory">~/.local/share/kstars/imageOverlays</filename>. L'emplacement exact pour votre système peut être trouvé en cliquant sur le bouton <guibutton>Dossier de superposition</guibutton> près du haut de la page de configuration <guilabel>Superposition d'image</guilabel> affiché au début de cette section. Pour commencer, ajoutez vos images à ce dossier. Pour des raisons de performance, elles ne devraient pas être trop lourdes mais des images de largeur de 1000 ou 2000 pixels devraient convenir. Pour ajouter d'autres images dans le futur, ajoutez-les dans ce même dossier et cliquez sur le bouton d'actualisation ou redémarrez &kstars;. Pour les supprimer, effacez-les de ce dossier et cliquez sur bouton d'actualisation ou redémarrez &kstars;.

source: Start &kstars; once you have images in the <literal>imageOverlays</literal> directory. If you then go to the <guilabel>Image Overlays</guilabel> config page, you should see the new files listed in the table. The new images will show their status as <guilabel>Unprocessed</guilabel>. Only images whose status is <guilabel>OK</guilabel> are displayed on the SkyMap. That is because &kstars; needs to know the sky location, size, and orientation for these images before it can display them. To change the status to <guilabel>OK</guilabel> you need to plate-solve the images or add the required information manually--see below.
fr: Démarrez &kstars; une fois que vos images sont dans le dossier <literal>imagesOverlays</literal>. En vous rendant sur la page de configuration de la <guilabel>Superposition d'image</guilabel>, vous devriez voir les nouveaux fichiers dans la table. Leur statut sera <guilabel>Non traité</guilabel>. Seules les images de statut <guilabel>Ok</guilabel> sont affichées sur la carte du ciel. La raison en est que &kstars; a besoin de connaître la position du ciel, la taille et l'orientation de ces images pour pouvoir les afficher. Pour modifier le statut en <guilabel>Ok</guilabel>, il faut effectuer une résolution astrométrique ou ajouter manuellement l'information requise, voir ci-dessous.

source: To prepare your images for display, you need to plate-solve the images (one time only). To do this, find an image in the table, click on its filename, and then click <guibutton>Solve</guibutton> below the table. The <guibutton>Solve</guibutton> button's label should switch to <guibutton>Cancel</guibutton> during the solve, and then when completed successfully, the solved parameters are displayed in the table and the status is changed to <guilabel>OK</guilabel>. A successful plate-solve's information is stored in the user database so that solving doesn't need to be repeated. The solved image should from then on appear in its proper position in the SkyMap. You can plate-solve multiple images in a single operation by clicking on the first image's filename, then holding down the &Shift; key and clicking on another filename. All the image files between the filenames should be selected. Then clicking <guibutton>Solve</guibutton> will attempt to solve them all. However, &kstars; will not attempt to plate-solve images whose status is <guilabel>OK</guilabel>, it will skip those images. (If you wish to re-plate-solve images with status <guilabel>OK</guilabel>, then manually change their status to <guilabel>Unprocessed</guilabel> and click <guibutton>Solve</guibutton>). It is possible that if you select several images, a few of them will not be successfully solved.
fr: La préparation des images pour l'affichage implique de les résoudre (une seule fois). Pour cela, choisissez une image dans la table, cliquez sur nom et cliquez sur le bouton <guibutton>Résoudre</guibutton> sous la table. L'étiquette de ce bouton changera en <guibutton>Annuler</guibutton> durant la résolution, et en cas de succès, les paramètres de résolution seront affichées dans la table et le statut passe à <guilabel>Ok</guilabel>. Cette information est enregistrée dans la base de données de l'utilisateur afin de ne pas devoir répéter la résolution. Les images résolues apparaîtront dès lors à leur correcte position sur la carte du ciel. Vous pouvez résoudre plusieurs images en une seule opération en cliquant sur le nom de la première image puis en cliquant sur d'autres nom de fichier en maintenant la touche « Maj » enfoncée. Toutes les images entre ces deux devraient être sélectionnées. Puis en cliquant sur le bouton <guibutton>Résoudre</guibutton>, toutes les images tenteront d'être résolues. Toutefois &kstars; ignorera les images de statut <guilabel>Ok</guilabel>. (Si vous souhaitez les résoudre à nouveau, modifiez vous-même leur état en <guilabel>Non traité</guilabel>, puis cliquez sur <guibutton>Résoudre</guibutton>.) Il est possible qu'en sélectionnant plusieurs images, certaines échouent à être résolues.

source: Plate solving these images can sometimes be difficult. That is because at this point the system has no information as to the scale or position to look, and thus it is a blind solve. To improve your chance for success, you can enter an approximate RA/DEC center sky position into the <guilabel>RA</guilabel> and <guilabel>DEC</guilabel> columns for the row you are trying to solve. You can also add an image scale, in arcseconds-per-pixel. You can add a default scale to the right of the <guibutton>Solve</guibutton> button in the box labeled <guilabel>Default a-s/px</guilabel> so that all solving attempts use this scale by default. You can also add a scale directly into the table-row-column, which would override the default. You can choose which StellarSolver profile the solver uses (these profiles can be edited in Ekos' <guilabel>Align</guilabel> tab). Finally, you can adjust the solver's <guilabel>Timeout</guilabel> in seconds.
fr: La résolution de ces images peut se révéler difficile. En effet, le système n'a aucune information sur la position et l'échelle de l'image, il résout à l'aveugle. Pour améliorer les chances de succès, vous pouvez indiquer la position approximative du centre de l'image dans le ciel en AD/DEC dans les colonnes <guilabel>AD</guilabel> et <guilabel>DEC</guilabel> de la ligne à résoudre. Vous pouvez également ajouter l'échelle de l'image en secondes d'arc par pixel. Vous pouvez ajouter une échelle par défaut à utiliser dans le champ à droite du bouton <guibutton>Résoudre</guibutton> nommé <guilabel>a-s/px par défaut</guilabel>. Ou alors indiquer une échelle directement dans la table pour passer outre la valeur par défaut. Vous pouvez aussi choisir le profil StellarSolver à utiliser pour la résolution (qui peut être modifié dans le module <guilabel>Alignement</guilabel> d'Ekos). Enfin, vous pouvez le délai d'attente du résolveur en secondes.

source: If you have problematic images that won't solve, you can still display them by manually entering the values (that the solver didn't find) into the table. They are the RA, DEC, arcsecond-per-pixel, orientation angle, and east-to-the-right (or West-to-the-right) settings. Once you have done that, you can then change the status to <guilabel>OK</guilabel> and &kstars; will save these values to the user database as if they had been automatically solved.
fr: Si vous avez quelques images problématiques que vous n'arrivez pas à résoudre, vous pouvez quand même les afficher en saisissant vous-même les valeurs dans la table. Ces valeurs sont les paramètres « AD » et « DEC » en secondes d'arc par pixel, l'angle d'orientation et les réglages par rapport à l'est ou à l'ouest. Une fois fait, modifiez le statut à <guilabel>Ok</guilabel> et &kstars; enregistrera ces valeurs dans la base de données de l'utilisateur comme si elles avaient été résolues automatiquement.

source: There are a few more controls on the <guilabel>Image Overlays</guilabel> settings page. The <guilabel>Show image overlays</guilabel> checkbox at the top of the page enables or disables this feature--that is, toggles whether any image overlays are display on the SkyMap or not.
fr: Il y a quelques autres contrôles sur la page de réglages de <guilabel>Superposition d'images</guilabel>. La case à cocher <guilabel>Afficher la superposition d'images</guilabel> en haut de page permet d'activer ou de désactiver cette fonctionnalité, c'est-à-dire qu'elle permet d'afficher ou non les images sur la carte du ciel.

source: The <guilabel>Maximum image dimension:</guilabel> spinbox allows you to vary the maximum image dimension used for images. That is, if you place images that are, for example, 5000 pixels wide into the <literal>imageOverlays</literal> directory, but this input box's value is 1000, then the 5000-pixel-images will be read in, but then downsampled to 1000-pixels-wide before display. This is done to reduce the memory footprint and cpu usage of this feature. It would be more efficient to add image files with the desired image width.
fr: La boîte <guilabel>Dimension maximale de l'image</guilabel> permet de varier la dimension maximale des images utilisée pour les images. Ainsi, si vous mettez des images, par exemple, de 5000 pixels de large dans le dossier <literal>imageOverlays</literal> mais que la valeur d'entrée de la boîte est de 1000 pixels, ces images seront lues mais réduites à la taille de 1000 pixels avant d'être affichées. Cela est effectué afin de réduire l'empreinte mémoire et la charge du processeur de cette fonctionnalité. Mais il serait plus efficace d'ajouter des images de largeur souhaitée directement.

source: The <guilabel>Center SkyMap on selection</guilabel> checkbox allows you to easily navigate to the overlay images without directly manipulating the SkyMap. With this enabled, you select a row in the overlay table (&ie;, by clicking on the filename field) and the skymap is moved to that image if the image's status is <guilabel>OK</guilabel>. At that point you can move from one image to the next with &Up; and &Down; arrow keyboard commands.
fr: La boîte à cocher <guilabel>Center la carte du ciel à la sélection</guilabel> permet de naviguer facilement vers les images de superposition sans devoir manipuler la carte du ciel. Lorsque que cette option est activée, il suffit de sélectionner une ligne dans la table de superposition (c'est à dire en cliquant sur le champ de nom de fichier) et la carte du ciel est déplacée vers cette image si son statut est <guilabel>Ok</guilabel>. Vous pouvez ensuite passer d'une image à l'autre à l'aide des flèches « Vers le haut » et « Vers le bas » du clavier.

source: <title>Colors</title>
fr: <title>Couleurs</title>

source: <screeninfo>Colors Window</screeninfo>
fr: <screeninfo>Fenêtre des couleurs</screeninfo>

source: <phrase>Colors Window</phrase>
fr: <phrase>Fenêtre des couleurs</phrase>

source: The <guilabel>Colors</guilabel> page allows you to set the color scheme, and to define custom color schemes. The tab is split into two panels:
fr: La page <guilabel>Couleurs</guilabel> vous permet de définir le thème de couleur, et de définir des thèmes de couleurs personnalisés. Cette section est séparée en deux :

source: The left panel shows a list of all display items with adjustable colors. Click on any item to bring up a color selection window to adjust its color. Below the list is the <guilabel>Star color mode:</guilabel> dropdown box. By default, &kstars; draws stars with a <link linkend="ai-colorandtemp">realistic color</link> tint according to the spectral type of the star. However, you may also choose to draw the stars as solid white, black or red circles. If you are using the realistic star colors, you can set the saturation level of the star colors with the <guilabel>Star color intensity:</guilabel> spinbox.
fr: Sur la gauche se trouve la liste de tous les éléments graphiques qui sont ajustables. Cliquez pour faire apparaître une fenêtre de sélection de couleurs. Sous la liste se trouve une boîte de sélection <guilabel>Mode de couleurs des étoiles</guilabel>. Par défaut &kstars; utilise des teintes de <link linkend="ai-colorandtemp">couleurs réalistes</link> qui se basent sur le type spectral des étoiles. Cependant, vous pouvez dire à &kstars; de dessiner les étoiles comme des cercles en utilisant seulement le blanc, le noir et le rouge. En mode réaliste, vous indiquez aussi le niveau de saturation des couleurs à l'aide de l'outil <guilabel>Intensité des couleurs des étoiles</guilabel>.

source: The right panel lists the defined color schemes. There are four predefined schemes: the <guilabel>Default Colors</guilabel> scheme, <guilabel>Star Chart</guilabel>, which uses black stars on a white background, <guilabel>Night Vision</guilabel>, which uses only shades of red in order to protect dark-adapted vision, and <guilabel>Moonless Night</guilabel>, a more realistic, dark theme. Additionally, you can save the current color settings as a custom scheme by clicking the <guibutton>Save As...</guibutton> button. It will prompt you for a name for the new scheme, and then your scheme will appear in the list in all future &kstars; sessions. To remove a custom scheme, simply highlight it in the list, and press the <guibutton>Remove</guibutton> button.
fr: Sur la droite se trouvent des modèles de couleurs prédéfinis. Quatre modèles existent déjà : <guilabel>par défaut</guilabel>, <guilabel>Carte du ciel</guilabel> (étoiles noires sur fond blanc), <guilabel>Vision Nocturne</guilabel> (étoiles de teinte rouge pour protéger les yeux adaptés à l'obscurité) et <guilabel>Nuit sans Lune</guilabel>, un thème sombre plus réaliste. Vous pouvez ajouter votre propre modèle en cliquant sur <guibutton>Enregistrer sous…</guibutton>. On vous demandera alors un nom descriptif, puis ce modèle apparaîtra dans la liste lors des sessions futures de &kstars;. Pour supprimer un modèle personnalisé, surlignez-le dans la liste et actionnez le bouton <guibutton>Supprimer</guibutton>.

source: <screeninfo>FITS Window</screeninfo>
fr: <screeninfo>Fenêtre FITS</screeninfo>

source: <phrase>FITS Window</phrase>
fr: <phrase>Fenêtre FITS</phrase>

source: FITS page
fr: Page FITS

source: <abbrev>FITS</abbrev> (Flexible Image Transport System) is a popular open standard for storage, transmission and processing of digital data. For the details, one is referred to the <ulink url="https://en.wikipedia.org/wiki/FITS">corresponding Wikipedia article</ulink>. This page allows you to configure presentation and processing of FITS data in &kstars;.
fr: <abbrev>FITS</abbrev> (Flexible Image Transport System) est un standard ouvert pour l'enregistrement, la transmission et le traitement de données numériques. Pour les détails on peut se référer à la page correspondante sur <ulink url="https://fr.wikipedia.org/wiki/FITS">Wikipedia</ulink>. Cette section vous permet de configurer la présentation et le traitement de données « FITS » dans &kstars;.

source: The left panel is for configuring FITS viewer itself.
fr: Le panneau de gauche permet la configuration de l'afficheur FITS lui-même.

source: Check the <guilabel>Use FITS viewer</guilabel> item if you want automatically display received images in the FITS Viewer.
fr: Veuillez cocher la case <guilabel>Utiliser l'afficheur FITS</guilabel> si vous souhaitez afficher automatiquement les images FITS reçues dans l'afficheur FITS.

source: The <guilabel>Single preview tab</guilabel> item is to display all captured FITS images in a single tab instead of multiple tabs per image. The <guilabel>Single window capture</guilabel> item is to display captured FITS images from all cameras in a single FITS Viewer window instead of a dedicated window to each camera. The <guilabel>Single window open</guilabel> item is to display opened FITS images in a single FITS Viewer window instead of a dedicated window to each file and the <guilabel>Independent window</guilabel> item is to make FITS Viewer window independent from &kstars;.
fr: La case <guilabel>Onglet d'affichage simple</guilabel> permet d'afficher toutes les images FITS dans un seul onglet plutôt que de multiples onglets par image. La case <guilabel>Fenêtre d'acquisition unique</guilabel> permet d'afficher toutes les images FITS de tous les appareils photo dans une seule fenêtre plutôt que dans une fenêtre dédiée pour chaque appareil photo. La case <guilabel>Ouverture d'une fenêtre unique</guilabel> permet d'afficher les images FITS ouvertes dans une fenêtre d'affichage FITS unique plutôt que dans une fenêtre dédiée à chaque fichier et enfin <guilabel>Fenêtre indépendante</guilabel> permet de détacher la fenêtre de l'afficheur FITS de &kstars;.

source: The right panel lists processing options. The <guilabel>Auto stretch</guilabel> item is to always apply auto stretch to images in FITS Viewer, <guilabel>Limited resources mode</guilabel> is to enable limited resource mode to turn off any resource-intensive operations, namely: <guilabel>Auto debayer</guilabel> (bayered images will not be debayered; only grayscale images are shown), <guilabel>Auto WCS</guilabel> (World Coordinate System data will not be processed; WCS maps sky coordinates to image coordinates; equatorial grid lines, object identification, and telescope slew within an image are disabled), and <guilabel>3D cube</guilabel> (RGB images will not be processed; only grayscale images are shown). You can switch off some of these resource-greedy operations separately as well.
fr: Le panneau de droite liste les options de traitement. <guilabel> Étirement automatique</guilabel> permet de toujours appliquer un étirement automatique sur les images dans l'afficheur FITS, <guilabel>Mode avec ressources limitées</guilabel> active le mode de ressources limitées qui désactive toute opération demandant des ressources intensives : <guilabel>Filtre de Bayer automatique</guilabel> (les images brutes ne seront pas dé-matricées, seulement les images grises seront affichées), <guilabel>WCS automatique</guilabel> (les données WCS ne seront pas traitées) ; les coordonnées du ciel de la carte WCS vers les coordonnées de l'image ; les lignes de la grille équatoriale, les identifiants d'objet et la fonction de pivotage du télescope seront désactivées), et <guilabel>Cube 3D</guilabel> (les images RGB ne seront pas traitées, seules les images grises seront affichées). Vous pouvez également désactiver certaines de ces opérations gourmandes en puissance de calcul.

source: <screeninfo>INDI Window</screeninfo>
fr: <screeninfo>Fenêtre INDI</screeninfo>

source: <phrase>INDI Window</phrase>
fr: <phrase>Fenêtre INDI</phrase>

source: <screeninfo>Ekos Window</screeninfo>
fr: <screeninfo>Fenêtre Ekos</screeninfo>

source: <phrase>Ekos Window</phrase>
fr: <phrase>Fenêtre Ekos</phrase>

source: Ekos is an astrophotography suite, a complete astrophotography solution that can control all INDI devices including numerous telescopes, CCDs, DSLRs, focusers, filters, and a lot more. Ekos supports highly accurate tracking using online and offline astrometry solver, autofocus and autoguiding capabilities, and capture of single or multiple images using the powerful built in sequence manager. For detailed explanation of <guilabel>Ekos</guilabel>, see the <link linkend="ekos">Ekos section of this manual</link>.
fr: Ekos est une suite d'astrophotographie complète qui permet de contrôler tout périphérique INDI tels que des montures, des CCD, des APN, des moteurs de mise au point, des roues à filtres et bien plus encore. Ekos gère le suivi de haute précision en utilisant des résolveurs en ligne et hors ligne, la mise au point automatique et l'autoguidage ainsi que l'acquisition d'images unique ou multiple en utilisant le puissant gestionnaire de séquences. Pour des explications détaillées d'<guilabel>Ekos</guilabel>, veuillez lire la <link linkend="ekos">section Ekos de ce manuel</link>.

source: <screeninfo>Xplanet Window</screeninfo>
fr: <screeninfo>Fenêtre de XPlanet</screeninfo>

source: <phrase>Xplanet Window</phrase>
fr: <phrase>Fenêtre de XPlanet</phrase>

source: <ulink url="http://xplanet.sourceforge.net/">Xplanet</ulink> (should be installed separately) is a solar system planet surface renderer. This page allows you to configure presentation and processing of <application>Xplanet</application> data in &kstars;.
fr: <ulink url="http://xplanet.sourceforge.net/">XPlanet</ulink> est un programme de rendu de surfaces des planètes du système solaire (à installer séparément). Cette page vous permet de configurer la configuration et le traitement des données de <application>XPlanet</application> dans &kstars;.

source: Advanced
fr: Avancé

source: <screeninfo>Advanced Window</screeninfo>
fr: <screeninfo>Fenêtre Avancé</screeninfo>

source: <phrase>Advanced Window</phrase>
fr: <phrase>Fenêtre Avancé</phrase>

source: Atmospheric Refraction
fr: Réfraction atmosphérique

source: The <guilabel>Correct for atmospheric refraction</guilabel> checkbox controls whether the positions of objects are corrected for the effects of the atmosphere. Because the atmosphere is a spherical shell, light from outer space is <quote>bent</quote> as it passes through the atmosphere to our telescopes or eyes on the Earth's surface. The effect is largest for objects near the horizon, and actually changes the predicted rise or set times of objects by a few minutes. In fact, when you <quote>see</quote> a sunset, the Sun's actual position is already well below the horizon; atmospheric refraction makes it seem as if the Sun is still in the sky. Note that atmospheric refraction is never applied if you are using <guilabel>Equatorial coordinates</guilabel>.
fr: La case à cocher <guilabel>Corriger la réfraction atmosphérique</guilabel> contrôle si la position des objets est corrigée pour les effets de l'atmosphère. Du fait que l'atmosphère est une coquille sphérique, la lumière provenant de l'espace extérieur est <quote>courbée</quote> lorsqu'elle passe à travers l'atmosphère vers nos télescopes ou nos yeux à la surface de la Terre. L'effet est plus grand pour les objets proches de l'horizon et change vraiment l'heure de lever ou de coucher de quelques minutes. En fait, quand vous <quote>voyez</quote> un coucher du Soleil, la vraie position du Soleil est déjà au-dessous de l'horizon ; la réfraction atmosphérique le fait apparaître comme s'il était encore dans le ciel. Notez que la réfraction atmosphérique n'est jamais prise en compte si vous utilisez les <guilabel>Coordonnées équatoriales</guilabel>.

source: Animated Slewing
fr: Rotation animé
