Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-profile-wizard.po
Languages: fr

source: <title>Profile Wizard</title>
fr: <title>Assistant de profil</title>

source: Tools
fr: Outils

source: <tertiary>Profile Wizard</tertiary>
fr: <tertiary>Assistant de profil</tertiary>

source: The Profile Wizard is a handy tool to setup your equipment for the first time. It should popup automatically the first time you run &kstars;. Follow the guided instructions to setup your first equipment profile.
fr: L'assistant de profil est un outil pratique pour créer un premier profil de votre matériel. Il devrait apparaître automatiquement la première fois que vous lancez &kstars;. Suivez les instructions pour configurer votre premier profil de matériel.

source: Greeting Page
fr: Page de bienvenue

source: <screeninfo>Profile Wizard Welcome</screeninfo>
fr: <screeninfo>Bienvenue à l'assistant de profil</screeninfo>

source: <phrase>Profile Wizard Welcome</phrase>
fr: <phrase>Bienvenue à l'assistant de profil</phrase>

source: The first greeting screen contains some links to learn more about Ekos &amp; INDI. Click <guibutton>Next</guibutton> to continue.
fr: L'écran de bienvenue contient quelques liens pour en apprendre davantage sur Ekos et INDI. Veuillez cliquer sur <guibutton>Suivant</guibutton> pour continuer.

source: Equipment Location Page
fr: Page de l'emplacement du matériel

source: Next, you will be presented with the equipment location page. Your selection depends on where your equipment is connected to:
fr: Ensuite vous tomberez sur la page de l'emplacement du matériel. Votre sélection dépend de l'emplacement où est connecté votre matériel :

source: <guilabel>Equipment is attached to this device</guilabel>: Select this option if Ekos is running on your StellarMate (via HDMI or VNC), device (&Windows;/&Linux;) or &MacOS;.
fr: <guilabel>Le matériel est connecté à ce périphérique</guilabel> : sélectionnez cette option si Ekos tourne sur votre StellarMate (via HDMI ou VNC), sur votre périphérique (&Windows;, &Linux;) ou sur &MacOS;.

source: <guilabel>Equipment is attached to a remote device</guilabel>: Select this option if Ekos is running on your device (&Windows;/&Linux;) or &MacOS;, and your equipment is connected to a remote computer.
fr: <guilabel>Le matériel est connecté à un périphérique distant</guilabel> : sélectionnez cette option si Ekos tourne sur votre périphérique (&Windows;, &Linux;) ou &MacOS; et votre matériel est connecté à un ordinateur distant.

source: <guilabel>Equipment is attached to StellarMate</guilabel>: Select this option if Ekos is running on your device (&Windows;/&Linux;) or &MacOS;, and your equipment is connected to StellarMate.
fr: <guilabel>Le matériel est connecté à StellarMate</guilabel> : sélectionnez cette option si Ekos tourne sur votre périphérique (&Windows;, &Linux;) ou &MacOS;, et si votre matériel est connecté à StellarMate. Cette option n'est active que pour les versions de &kstars; inférieures à 3.5.8.

source: <screeninfo>Equipment location page</screeninfo>
fr: <screeninfo>Page de l'emplacement de l'équipement</screeninfo>

source: <phrase>Equipment location page</phrase>
fr: <phrase>Page de l'emplacement de l'équipement</phrase>

source: Click <guibutton>Next</guibutton> to continue.
fr: Cliquez sur <guibutton>Suivant</guibutton> pour continuer.

source: Remote Connection Page
fr: Page de connexion à distance

source: In case selected the 2nd option in the last step, you shall be presented with the Remote Connect Page, here you will enter the hostname or IP address of the StellarMate unit. You can get the hostname from the StellarMate mobile App. Alternatively, you can construct the hostname from StellarMate HotSpot SSID. You should see the SSID when you search for WiFi networks nearby. For example, suppose the SSID is <replaceable>stellarmate</replaceable>. The hostname should be <emphasis><replaceable>stellarmate</replaceable>.local</emphasis>. That is, if you remove the underscore, and append <emphasis>.local</emphasis>, then you will get the unit hostname. You can always use the StellarMate App to change the unit default hostname to the name of your choice.
fr: Dans le cas où vous avez sélectionné la seconde option à l'étape précédente, vous verrez apparaître la page de connexion à distance où vous devrez saisir le nom d'hôte ou l'adresse IP de l'appareil sur lequel est installé StellarMate. Vous pouvez obtenir le nom d'hôte depuis l'application mobile de StellarMate. Autrement, vous pouvez construire le nom d'hôte à partir du SSID de StellarMate qui devrait être visible lors d'une recherche de réseaux wifi. Supposons par exemple que le SSID soit <replaceable>stellarmate</replaceable>. Le nom d'hôte sera alors <emphasis><replaceable>stellarmate.local</replaceable></emphasis>. Vous pouvez toujours utiliser l'application StellarMate pour modifier le nom d'hôte par défaut à votre convenance.

source: <screeninfo>Profile Wizard Remote page</screeninfo>
fr: <screeninfo>Page de l'assistant profil à distance</screeninfo>

source: <phrase>Profile Wizard Remote page</phrase>
fr: <phrase>Page de l'assistant profil à distance</phrase>

source: For the INDI Manager question, always select <emphasis role="bold">Yes</emphasis> since StellarMate Web Manager is running by default on the unit. Click <guibutton>Next</guibutton> to continue.
fr: Pour la question concernant le gestionnaire INDI, il faut toujours sélectionner <emphasis role="bold">Oui</emphasis> puisque le gestionnaire Web de StellarMate est lancé par défaut sur l'appareil. Cliquez sur <guibutton>Suivant</guibutton> pour continuer.

source: Profile Creation Page
fr: Page de création de profil

source: Now you get to name your equipment profile. Afterwards select which guider application to use. The <guilabel>Internal Guider</guilabel> is the only officially supported selection in StellarMate. You may opt to select <guimenuitem>PHD2/LinGuider</guimenuitem> but the details are out of the scope of this documentation. If additional services are desired, check the ones you want to run.
fr: Vous pouvez maintenant choisir le nom de profil de votre matériel. Ensuite sélectionnez l'application de guidage que vous souhaitez utiliser. Le <guilabel>guidage interne</guilabel> est le seul officiellement géré par StellarMate. Vous pouvez choisir <guimenu>PHD2</guimenu> ou <guimenu>LinGuider</guimenu> mais les détails ne sont pas couverts pas cette documentation. Si des services additionnels sont souhaités, veuillez cocher ceux que vous voulez utiliser.

source: <screeninfo>The final page of Profile Wizard</screeninfo>
fr: <screeninfo>La dernière page de l'assistant profil</screeninfo>

source: <phrase>The final page of Profile Wizard</phrase>
fr: <phrase>La dernière page de l'assistant de profil</phrase>

source: In the example above, we select Remote Astrometry, WatchDog, and SkySafari drivers. The detailed explanations for each is provided in the tooltip when you over them. Once done, click <guibutton>Create Profile</guibutton> button. You should now be presented with the Profile Editor.
fr: Dans l'exemple ci-dessus, nous avons sélectionné les pilotes Astrométrie distante, WatchDog et SkySafari. Des explications détaillées pour chacun d'entre eux apparaissent dans une infobulle lors du survol avec la souris. Une fois fait, cliquez sur le bouton <guibutton>Créer un profil et Sélectionner des périphériques</guibutton> et l'éditeur de profil apparaît.
