Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_obsplanner.po
Languages: fr

source: Observation Planner
fr: Planificateur d'observations

source: Planner
fr: Planificateur

source: Since &kde; SC 4.4, Prakash Mohan&apos;s GSoC work has been released in &kstars;. &kstars; now has an awesome observation planner to plan your observation sessions. The execute session option allows you to log information about objects as you observe them. Alternately, you may also write a short log in the session planner itself. We wish you a lot of fun planning your observations with &kstars;!
fr: Depuis &kde; SC 4.4, le travail de Prakash Mohan durant les <quote>Google Summer Of Code</quote> a été intégré dans &kstars;. &kstars; possède maintenant un incroyable planificateur d'observations pour organiser les sessions d'observations. L'option de session à réaliser vous permet d'enregistrer des informations à propose des objets pendant que vous les observez. Alternativement, vous pouvez aussi écrit un court journal dans le planificateur de session lui même. Nous vous souhaitons beaucoup de plaisir à planifier vos observations avec &kstars; !

source: You can even add some pictures to the objects. The image list is a Google image search list. To add image to an object just press <guibutton>Find Image</guibutton> button on the right and then find an image that you like. If you do not have an Internet connection you can open an image from your hard drive. Note that images that will be used are going to be cropped to 600x600 pixels.
fr: Vous pouvez même ajouter des images aux objets. La liste d'images est une liste de rechercher d'images de Google. Pour ajouter une image à un objet, tout ce dont vous avez besoin est d'appuyer sur le bouton <guibutton>Remplacer à partir d'Internet</guibutton> sur votre droite et ensuite de trouver l'image que vous souhaitez. Si vous n'avez pas de connexion Internet, vous pouvez ouvrir une image enregistrée sur votre disque dur. Veuillez noter que les images que vous allez utiliser seront rognées à 600 x 600 pixels.

source: The first way of doing this is by pressing <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> or <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> to open the Observation List, then press the <guibutton>Add Object</guibutton> button.
fr: La première méthode pour faire ceci est un appui sur <keycombo action="simul">&Ctrl; <keycap>2</keycap></keycombo> ou <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> pour ouvrir la liste d'observation et ensuite un appui sur le bouton <guibutton>Chercher un Objet</guibutton>.

source: The <guibutton>Download all Images</guibutton> button does a search for the SDSS images and displays the DSS image if the requested RA/Dec is out of the SDSS footprint.
fr: Le bouton <guibutton>Télécharger toutes les images</guibutton> exécute une recherche d'images SDSS et affiche l'image DSS si les coordonnées AD/DEC sont en dehors de l'empreinte SDSS.

source: This is an SDSS image of a galaxy
fr: Ceci est une image SDSS de la galaxie

source: This is an DSS image of the same galaxy
fr: Ceci est une image DSS de la même galaxie

source: The <guibutton>Delete all Images</guibutton> button does the opposite. It deletes all downloaded images.
fr: Le bouton <guibutton>Supprimer toutes les images</guibutton> réalise exactement le contraire. Il permet de supprimer toutes les images téléchargées.

source: The image for the galaxy is now deleted
fr: L'image de la galaxie est maintenant supprimée

source: You can add more objects by pressing the <guibutton>Find Object</guibutton> button. It will open the <guilabel>Find Object</guilabel> tool which provides two accurate methods for sorting out the items, depending on what criteria you want to use. You can filter the list by objects type: Any, Stars, Solar System, Clusters (Globular and Open), Nebulae (Gaseous and Planetary), Galaxies, Comets, Asteroids, Constellations, Supernovae or Satellites. You can also filter the objects list by name. Enter the name of desired object in the <guilabel>Filter by name</guilabel> text box.
fr: Vous pouvez ajouter plus d'objets en appuyant sur le bouton <guibutton>Trouver un objet</guibutton>. Cela ouvrira l'outil <guilabel>Trouver un objet</guilabel> qui fournit deux méthodes précises pour filtrer les éléments selon plusieurs critères. Vous pouvez filtrer la liste des objets par type : Quelconque, Étoiles, Système solaire, Amas (globulaires ou ouverts), Nébuleuses (gazeuses ou planétaires), Galaxies, Comètes, Astéroïdes, Constellations, Supernovae ou encore Satellites. Vous pouvez aussi filtrer par nom. Indiquez le nom de l'objet souhaité dans la boîte <guilabel>Filtrer par nom</guilabel>.

source: Inside Observation Planner window you can see the <quote>Altitude vs Time</quote> widget (AltvsTime), which shows you how the altitude of a selected object varies over time.
fr: Dans la fenêtre du planificateur d'observations vous verrez le tracé <quote>Altitude selon l'heure</quote> qui montre comment l'altitude d'un objet varie avec le temps.

source: Below the AltvsTime widget, there is a text box in that you can add observing notes for current sky object.
fr: Vous pouvez ajouter des notes d'observations sous cette fenêtre dans la boîte de texte.

source: Note that the Wish List is not the Session Plan. In the Wish List you can add objects that you wish to observe at some point. From there you can add them to the Session Plan.
fr: Veuillez noter que la liste de souhaits n'est pas le plan de session. Dans la liste des souhaits, vous pouvez ajouter des objets que vous souhaitez observer à un certain moment. De là, vous pouvez les ajouter dans le plan de session.

source: You can see the pop-up window that comes after right-clicking on an object.
fr: Vous pouvez voir la fenêtre contextuelle apparaissant en faisant un clic droit sur un objet.

source: Add objects to Session Plan window
fr: Ajouter des objets à la fenêtre de planification de session

source: Here is the second way of adding objects in your Observation Plan, using the Observing List Wizard. You just need to press the fourth button on the top-left corner of the Observation Planner window.
fr: Voici la deuxième méthode pour ajouter des objets dans votre planificateur d'observations. Pour utiliser cette méthode, vous avez juste besoin d'appuyer sur la quatrième icône dans le coin supérieur gauche de l'assistant de planificateur d'observations.

source: Despite looking differently this way is basically the same as the first one. Although that it could be a bit more detailed. Here you can see the same categories of objects.
fr: Bien que semblant différent, cette méthode est fondamentalement identique à la première. Cependant, elle peut être un peu plus précise. Vous pouvez voir ici les mêmes catégories d'objets.

source: You can choose where these objects to be on the sky. There are four options available for you: All over the sky (which is the default option), by constellation and in a region (rectangular or circular).
fr: Vous pouvez choisir où les objets doivent être dans le ciel. Il y a quatre options disponibles pour vous : le ciel en entier (le mode par défaut), par constellation et dans une région (rectangulaire ou circulaire).

source: You can choose the date for the observation and the place you are going to observe from.
fr: Vous pouvez choisir la date de l'observation et l'endroit où vous allez faire vos observations.

source: You can choose the threshold of magnitude for the objects to be shown. In astronomy, absolute magnitude (also known as absolute visual magnitude when measured in the standard V photometric band) measures a celestial object&apos;s intrinsic brightness.
fr: Vous pouvez choisir le seuil de magnitude pour les objets qui doivent être affichés. En astronomie, la magnitude absolue (connue aussi comme magnitude visuelle absolue quand elle est mesurée dans la bande photométrique standard V) mesure la luminosité intrinsèque d'un objet céleste.

source: You can save your observation plan. And it will save it with a <literal role="extension">.obslist</literal> extension.
fr: Vous pouvez enregistrer vos planifications d'observations. Et, cela l'enregistrera avec une extension <literal role="extension">.obslist</literal>.

source: You can also access the <guilabel>WUT</guilabel> (What&apos;s up tonight), which could be of a great assistance to you. It can give you ideas what to observe on a date, time and place that you specify using the configuration buttons int the top-right corner of the <guilabel>What&apos;s up tonight</guilabel> window.
fr: Vous pouvez aussi accéder au <guilabel>DCN</guilabel> (Dans le ciel cette nuit), qui peut être d'une grande aide pour vous. Il vous donne des idées sur quoi observer à une date, une heure et une position que vous spécifiez en utilisant les boutons de configuration dans le coin supérieur droit de la fenêtre <guilabel>Dans le ciel cette nuit</guilabel>.

source: Another way of adding objects to your observation plan is using the newly introduced <guibutton>Batch Add</guibutton> will open up a text box where you can type many objects to add in one shot to the observation planner. Any objects not in the &kstars; database already will be resolved using SIMBAD Astronomical Database (provided this has been enabled in the Settings) and added to the database. The entire process of adding objects is slow and may take a while, and you can watch the progress in the Status Bar. Any objects that could not be found are then listed in an error message, so you can identify and fix the errors. Usually this may be because SIMBAD expects a different way of specifying the object (&eg; Sim 147 instead of Simeis 147). This new feature allows you to easily scrape data from observing lists on the web &etc; and add them to your workflow in &kstars;.
fr: Une autre manière d'ajouter des objets à votre plan d'observation est d'utiliser la nouvelle fonctionnalité <guibutton>Traitement par lots</guibutton> qui ouvrira une boîte de texte où vous pouvez saisir autant d'objets que vous le souhaitez qui seront ajoutés d'un coup à votre plan d'observation. Tout objet qui ne serait pas déjà dans &kstars; sera cherché dans la base de données astronomique SIMBAD (à condition d'avoir été activée dans la configuration) et ajouté dans la base de données. Toute cette procédure d'ajout d'objets est lente et peut prendre du temps et vous pouvez voir son avancement dans la barre d'état. Tout objet impossible de trouver sera listé dans un message d'erreur afin de pouvoir l'identifier et le corriger. C'est généralement dû à un problème de nomenclature non géré par SIMBAD (c'est-à-dire Sim 147 plutôt que Simeis 147). Cette nouvelle fonctionnalité vous permet de facilement réutiliser une liste trouvée sur le web afin de l'ajouter à votre flux de travail dans &kstars;.

source: This is how the <guilabel>Execution Session</guilabel> Window look. It can be opened by pressing <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo>. In it you can also see some information about the selected object and you are able to add observing notes.
fr: Voici à quoi ressemble la fenêtre <guilabel>Session d'exécution</guilabel>. Elle peut être ouverte pas un appui sur <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo>. A l'intérieur, vous pouvez aussi voir quelques informations sur l'objet sélectionné et vous avez la possibilité d'ajouter des notes d'observation.

source: First Execute Session window
fr: Première fenêtre pour la session d'exécution

source: By pressing the <guibutton>Next Page</guibutton> button you will access the second page of Session Plan. Here you are able to see information not about your object, but about your equipment.
fr: Un appui sur le bouton <guibutton>Page suivante</guibutton> vous permettra d'accéder à la seconde page du planificateur de session. Vous avez la possibilité de voir ici, les informations, non pas relatif à votre objet mais relatif à votre équipement.

source: Second Execute Session window
fr: Seconde fenêtre pour la session d'exécution

source: Pressing the <guibutton>Next Target</guibutton> button will cause the Execute Session to open the first window about the next object.
fr: Un appui sur le bouton <guibutton>Nouvelle cible</guibutton> permettra à la session d'exécution d'ouvrir la première fenêtre relatif au prochain objet.
