Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-capture.po
Languages: fr

source: The range for Sky Quality is from 22 for the darkest skies, to 16 for the brightest (most light-polluted) skies. The magnitude scale is non-linear; it is a logarithmic scale based on the 5th root of 100. So 5 steps on the scale represent a change in brightness by a factor of 100. (A Sky Quality of 17 is 100 times as bright as a Sky Quality of 22. Each full integer step on the scale is a change by a factor of approximately 2.512.). <ulink url="https://en.wikipedia.org/wiki/Sky_brightness">Wikipedia Sky Brightness</ulink> <ulink url="https://en.wikipedia.org/wiki/Light_pollution">Wikipedia Light Pollution</ulink>
fr: La plage de valeurs pour la qualité du ciel va de 22 pour les ciels les plus noirs à 16 pour les plus brillants (principalement pollué par la lumière). L'échelle de magnitude est non-linéaire ; c'est une échelle logarithmique basée sur la racine cinquième de 100. Ainsi, 5 pas sur cette échelle représente un changement en magnitude d'un facteur 100. (Une qualité du ciel de 17 est 100 fois plus lumineuse qu'une qualité du ciel de 22. Chaque entier représente un changement d'environ 2.512.). Voir <ulink url="https://en.wikipedia.org/wiki/Sky_brightness">Wikipedia Sky Brightness</ulink> et <ulink url="https://fr.wikipedia.org/wiki/Pollution_lumineuse">Pollution lumineuse</ulink>.

source: All light scattered in the background sky is considered to be light pollution regardless of its source, so the effects of moonlight should be considered as "natural" light pollution. But weather conditions can also impact Sky Quality, as humidity or cloud cover can reflect and scatter any source of light through the atmosphere
fr: Toute lumière diffusée dans le fond du ciel est considérée comme de la pollution lumineuse quelque ce soit sa source, ainsi la « lumière » de la lune peut être considérée comme de la pollution lumineuse « naturelle ». Mais les conditions météorologiques peuvent également impacter la qualité du ciel ; ainsi, l'humidité ou la couverture nuageuse peuvent réfléchir ou diffuser toute source de lumière à travers l'atmosphère.

source: A <ulink url="https://en.wikipedia.org/wiki/Sky_quality_meter">Sky Quality Meter (SQM)</ulink> can provide the most accurate reading of sky quality if used during an imaging session, but an estimated value from sky quality surveys may also be found on the web at sites such as <ulink url="https://www.lightpollutionmap.info/">www.lightpollutionmap.info</ulink> or <ulink url="https://clearoutside.com/">www.clearoutside.com</ulink>. But these on-line sources for estimated light pollution generally do not account for the effects of moonlight or local weather conditions. So the values from light pollution web sites should only be considered as a “best case scenario” for a cloudless night during a new moon.
fr: Un appareil de mesure de la qualité du ciel, en anglais <ulink url="https://en.wikipedia.org/wiki/Sky_quality_meter">Sky Quality Meter (SQM)</ulink> permet d'obtenir la mesure la plus précise de la qualité du ciel durant une session d'imagerie mais d'autres sources sur Internet, comme <ulink url="https://www.lightpollutionmap.info/">www.lightpollutionmap.info</ulink> ou <ulink url="https://clearoutside.com/">www.clearoutside.com</ulink> permettent d'obtenir une valeur estimée. Mais ces sources sur Internet ne tiennent en général pas compte des effets de la « lumière » de la Lune et des conditions météorologiques locales. Elles ne représentent donc que le cas idéal d'une nuit sans nuage et à la nouvelle Lune.

source: If a light pollution map value is used for the input value of SQM, but imaging will be performed with a partial moon, then a decrease in the input of the SQM value should be applied in the calculator. Moonlight can be overwhelming; at a location where a light pollution map showed an SQM value of 19.63. An SQM reading was made on a night with a waxing crescent, shortly before half-moon, (moon age 5.4, and KStars moon magnitude = -10). The SQM reading at zenith showed the sky to be much brighter with measured value of 18.48. A reading taken on a night with a waxing gibbous, shortly before a full moon, (moon age 12.4, and KStars moon magnitude = -12). The SQM reading at zenith showed a measured SQM value of 15.95.
fr: Si une valeur provenant d'une carte de pollution lumineuse est utilisée comme valeur d'entrée de la qualité du ciel mais que la session d'imagerie est réalisé durant une lune partielle, il faudra diminuer cette valeur dans le calculateur d'exposition. L'impact de la « lumière » de la lune peut être très important ; par exemple, pour une valeur de 19.63 sur une carte, une lecture avec un appareil de mesure durant une lune croissante juste avant la demi-lune (âge la lune de 5.4 et magnitude dans KStars de -10), donne un résultat au zénith de 18.48, ce qui est bien plus brillant. De même, par une lune gibbeuse, juste après la pleine lune (âge la lune de 12.4 et magnitude dans KStars de -12), une lecture donne 15.95, ce qui est encore plus brillant.

source: The value of Sky Quality has a drastic impact on the calculated exposure because of the logarithmic scale involved. An image taken from a location with heavy light pollution (a low sky quality value), especially when filtering is not applied, may result in a very short exposure time to prevent light pollution from overwhelming the target signal. An image taken from a location with very little light pollution (a high Sky Quality value) may result in an sub-exposure time of several hours.
fr: La valeur de la qualité du ciel a un impact radical sur le temps d'exposition calculé en raison de l'échelle logarithmique. Une image prise depuis un endroit avec forte pollution lumineuse (donc une qualité du ciel basse), et particulièrement si aucun filtre n'est utilisé, aboutira à des durées d'exposition très faibles pour prévenir la pollution lumineuse de noyer le signal de la cible. Au contraire, une image prise dans d'excellentes conditions de qualité du ciel, impliquera des durées d'exposition de plusieurs heures.

source: <guilabel>Focal Ratio</guilabel>: The selector for <guimenu>Focal Ratio</guimenu> sets the value from the optical train, which is needed for the evaluation of light gathering capability.
fr: <guilabel>Rapport F/D</guilabel> : le sélecteur pour le <guimenu>rapport de focale</guimenu> règle la valeur à partir du train optique qui est nécessaire pour l'évaluation de la facilité à obtenir la lumière.

source: The value of the focal ratio of the optic has a direct effect on the exposure calculation. A lower focal ratio is considered to be a "faster optic" as it has a greater light gathering capability than an optic with a longer focal ratio. So the exposure calculation will be reduced when a lower focal ratio is used, and increased when a higher focal ratio is used.
fr: Cette valeur a un effet direct sur le calcul de la durée d'exposition. Un petit rapport est considéré comme une « optique rapide » puisqu'il permet d'obtenir beaucoup plus de lumière qu'une optique de rapport plus grand. Ainsi la durée d'exposition sera diminuée avec une optique de rapport faible et augmentée avec une optique de rapport plus grand.

source: The user might consider making a slight adjustment to the input value of the focal ratio to compensate for the efficiency or for obstructions in the optic.
fr: Il peut être intéressant d'ajuster légèrement cette valeur pour compenser le rendement ou les obstructions dans les optiques.

source: For example, two optics of the same focal ratio, a refractor (with no obstruction) and a reflector (with a secondary mirror obstruction) would be treated as equivalent optics in the computations. One way that a user might compensate for this would be to make an adjustment to the focal ratio input value to compensate for the efficiency of the optic. A refractor is generally considered to have an efficiency of about 94%, a reflector is generally considered to have an efficiency of about 78%.
fr: Prenons par exemple deux optiques de même rapport F/D, un réfracteur (sans obstruction) et un réflecteur (avec une obstruction dû au miroir secondaire) ; ces deux optiques seraient traitées de manière équivalentes dans les calculs. On pourrait compenser l'efficacité optique différente en tenant compte du fait qu'un réfracteur a une efficacité d'environ 94% alors que celle d'un réflecteur est d'environ 78%.

source: An effective / adjusted focal ratio value for a refractor = Optic Focal Ratio / 0.94
fr: La compensation sera calculée pour un réfracteur ainsi : (rapport F/D) / 0.94.

source: An effective / adjusted focal ratio value for a reflector = Optic Focal Ratio / 0.78
fr: Et pour un réflecteur : (Rapport F/D) / 0.78.

source: These adjustments slightly increase the focal ratio, and therefore slightly reduce the computed light gathering capability considered in the calculation.
fr: Ces ajustements augmentent un tout petit peu le rapport F/D et ainsi réduisent un peu l'efficacité de capture de lumière dans les calculs.

source: <guilabel>Filter Bandwidth</guilabel>: The selector for <guimenu>Filter Bandwidth</guimenu> sets the value for the bandwidth (in nanometers), and should be reduced from the default value of 300 when a filter is included in the optical train. The inclusion of filters in the optic train will greatly effect the exposure calculation. The value ranges from 300, for imaging without any filter, down to 2.8 for an extreme narrow-band filter.
fr: <guilabel>Largeur de bande du filtre</guilabel> : le sélecteur <guimenu>Largeur de bande du filtre</guimenu> règle la valeur de largeur de bande (en nanomètres) et devrait être réduit de la valeur par défaut de 300 quand un filtre est ajouté au train optique. L'ajout de filtres dans le train optique affectera grandement la durée d'exposition. La plage de valeur part de 300 pour une imagerie sans filtre jusqu'à 2.8 pour un filtre à bande très étroite.

source: Filters fall generally into two categories: single band, or multi-band. The bandwidth for a single band filter should be relatively easy to determine or estimate. Generally a Red, Green or Blue filter is considered to have a bandwidth of 100 nanometers. Documentation of narrow-band filters will frequently state the bandwidth (usually in the range of 3 to 12 nm). But the bandwidth of multi-band astronomy filters, such as light-pollution filters, or filters specifically designed for use on nebulae may be more difficult to determine as their transmission profiles can be far more complex.
fr: Les filtres tombent généralement dans deux catégories : bande simple et multi-bande. La largeur de bande pour un filtre à bande simple devrait être relativement simple à déterminer ou à estimer. En général, un filtre rouge, vert ou bleu possède une largeur de 100 nanomètres. La documentation des filtres multi-bande contient généralement la largeur de bande (habituellement entre 3 et 12 nm). Mais les largeurs de bande des filtre multi-bande tels que les filtres anti-pollution lumineuses ou ceux spécifiquement conçus pour les nébuleuses peuvent être bien plus difficiles à déterminer puisque leur profil de transmission sont bien plus complexes.

source: Even within the bands that filters are intended to pass, filters are not 100% efficient. So a user of the calculator might wish to slightly reduce the value of the filter bandwidth to compensate for this. Example: if a filter is presumed to have a bandwidth of 100 nm but its transmission efficiency is only 92%, then a value of 92 might better represent this filter, and result in a slightly more accurate exposure calculation.
fr: Les filtres ne sont pas 100% efficaces même dans les bandes qu'ils sont censés utiliser. Par conséquent, l'utilisateur du calculateur souhaitera légèrement réduire la valeur de la largeur de bande pour compenser cela. Par exemple, pour un filtre qui est censé posséder une largeur de bande de 100 nm mais dont l'efficacité de transmission n'est que de 92%, une valeur de 92 représentera probablement mieux ce filtre et conduira à une durée d'exposition un peu plus précise.

source: The value of the filter bandwidth has an inverse effect on the exposure calculation. An unfiltered exposure would use the max value of 300 for the filter bandwidth (representing visible spectrum of 300 nanometers), and will produce the shortest exposure time calculation. An extreme narrow-band filter, (for example a 3 nanometer bandwidth), will produce the longest exposure time.
fr: La valeur de la largeur de bande du filtre a un effet inversement proportionnel à la durée d'exposition. Une image prise sans filtre utilisera la valeur de 300 (ce qui représente le spectre visible de 300 nanomètres) et produira le temps d'exposition le plus court. À l'inverse, l'utilisation d'un filtre très étroit (par exemple 3 nanomètres) produira une durée d'exposition bien plus longue.

source: <guilabel>Camera</guilabel>: The exposure calculation requires a value for the read noise of the camera. Camera read noise is an electronic noise that occurs at the completion of an exposure as the camera is measuring the analog voltage values of the pixels and converting these measurements into digital values. Read noise is not effected by the length of an exposure.
fr: <guilabel>Appareil</guilabel> : le calcul de la durée d'exposition requiert de connaître la valeur du bruit de lecture de l'appareil. Ce bruit apparaît à la fin d'une exposition et provient du fait que l'appareil mesure des valeurs analogiques de la tension des pixels et les convertit ensuite en valeurs digitales. Ce bruit de lecture n'est pas affecté par la durée d'exposition.

source: Camera sensors are one of two types: "Charge Coupled Device" (CCD) or "Complementary Metal-Oxide Semiconductor" (CMOS). For the exposure calculation the main difference between these sensor types is that CCD sensors do not have a variable gain setting that would impact the read noise; so a CCD sensor will have a single constant value for its read noise. A CMOS sensor does have a variable gain (or ISO value), and changes to that setting usually result in a change to the read noise.
fr: Les appareils ont des capteurs de deux types : CCD (Charge Coupled Device) et CMOS (Complementary Metal-Oxide Semiconductor). La différence principale en ce qui concerne le calcul de la durée d'exposition est que les capteurs CCD ne possèdent pas de réglages du gain qui affecte le bruit de lecture ; ainsi, les capteurs CCD n'ont qu'une seule valeur constante pour leur bruit de lecture. Les capteurs CMOS ont un gain variable (ou valeur ISO) et une modification de ce paramètre affecte en général le bruit de lecture.

source: The exposure calculator relies upon the selection of a camera data file so that it can access an appropriate read noise value for use in the calculation. The camera selection drop down allows the user to select an appropriate camera data file. For a CCD camera the file will only hold a single read noise value, but for a CMOS camera the file includes a table (or a few tables) of values which relate the gain or ISO value to a read noise value. Do not be confused by "CCD" appearing in the names of many dedicated astrophotography cameras, most of these cameras are using CMOS sensors.
fr: Le calculateur d'exposition repose sur la connaissance des données de l'appareil pour pouvoir accéder à une valeur adéquate du bruit de lecture à utiliser dans le calcul. La liste déroulante permet de choisir le fichier approprié à l'appareil. Pour les appareils CCD, le fichier ne contient qu'une seule valeur mais pour les appareils CMOS, le fichier inclut une table (ou plusieurs) de valeurs qui associe le gain ou l'ISO à un bruit de lecture. No soyez pas déconcerté par le « CCD » apparaissant dans le nom de beaucoup d'appareils dédiés à l'astrophotographie car la plupart utilisent des capteurs CMOS.

source: The camera data files provided in KStars contain values which are transcribed from manufacturers technical documentation. But actual read noise values for a camera may vary from the published data; so a user may which to utilize a tool that can determine the read noise values for their specific camera. Dr. Glover provides a sensor analysis tool in his MS-Windows based product SharpCap <ulink url="https://www.sharpcap.co.uk/sharpcap/features/sensor-analysis">SharpCap Sensor Analysis</ulink> The specific data from such a tool can be used to create a customized camera data file for use with the KStars exposure calculator.
fr: Les fichiers de données des appareils inclus dans KStars contiennent des valeurs traduites de la documentation techniques des constructeurs. Toutefois, les valeurs réelles du bruit de lecture peuvent varier des valeurs publiées ; ainsi, un utilisateur voudra éventuellement utiliser un outil dédié pour déterminer les vraies valeurs de bruit de lecture de leur appareil. Le Dr Glover fournit un outil d'analyse de capteur dans son outil <ulink url="https://www.sharpcap.co.uk/sharpcap/features/sensor-analysis">SharpCap Sensor Analysis</ulink>. Les données obtenues par cet outil peuvent être utilisées pour créer un fichier personnalisé de données liées à un appareil et pourra être ensuite utilisé avec le calculateur d'exposition de KStars.

source: <guilabel>Read Mode</guilabel>: Some cameras manufactured by QHY have the capability to function in multiple modes. These modes alter the read noise values, so the camera data files for these cameras include multiple read noise tables. When using one of these multi-mode cameras the Read Mode dropdown will become enabled, and allow the user to select the read mode table that would correspond to the mode in which the camera will be operated for imaging.
fr: <guilabel>Mode lecture</guilabel> : certains appareils de la marque QHY ont la possibilité de fonctionner en plusieurs modes. Ces modes modifient les valeurs de bruit de lecture et ainsi les fichiers de données de ces appareils incluent plusieurs tables de bruit de lecture. Lors de l'utilisation de ce type d'appareils multi-modes, la liste déroulante deviendra active et permettra à l'utilisateur de choisir la table correspondante au mode utilisé par l'appareil pour l'imagerie.

source: <guimenuitem>Exposure Time Graph</guimenuitem>: The calculator will present a graph of the potential exposure times determined from the inputs. In the case of CMOS based cameras, this graph will resemble the underlying read noise data from the camera, but is transformed into an exposure time over the range of possible gain or ISO values. In the case of CCD based cameras, the graph will be a simple bar, because the read noise of a CCD sensor is invariable.
fr: <guilabel>Graphique de la durée d'exposition</guilabel> : le calculateur affiche un graphique des durées d'exposition potentielles déterminées par les paramètres d'entrée. Dans le cas des appareils à capteur CMOS, ce graphique ressemblera aux données de lecture de l'appareil mais sera transformé en durée d'exposition en fonction des différents gains ou ISO possibles. Pour les appareils CCD, le graphique sera une simple bar puisque le bruit de lecture est invariable.

source: <guilabel>Gain / ISO Selection</guilabel>: For cameras with CMOS sensors, a Gain or ISO value can be selected. A Gain control will appear for cameras that allow a gain selection, and an ISO selection drop down will appear for DSLR cameras. Adjusting the gain / ISO value will move a selection indicator laterally along the exposure time graph to show how the selected gain value will effect the calculated exposure time.
fr: <guilabel>Gain / ISO</guilabel> : les appareils ayant un capteur CMOS, une valeur de gain ou d'ISO peut être sélectionnée. Un bouton de contrôle de gain permet la sélection de gain et une liste déroulante permet ce choix pour les APN. L'ajustement de ces valeurs déplace un indicateur situé latéralement du graphique de durée d'exposition pour indiquer l'effet de ces valeurs sur la durée d'exposition.

source: CMOS based cameras tend to have high read noise at low gain / ISO values, and the read noise diminishes as the Gain / ISO value is increased. So a user might be tempted to select a higher gain value in an attempt to reduce the amount of read noise. But the camera full well capacity would typically be highest when gain / ISO values are lowest. A greater full well capacity provides a greater dynamic range in the image.
fr: Les appareils à capteur CMOS ont tendance à avoir un bruit de lecture élevé pour des valeurs de gain/ISO faibles, le bruit de lecture diminuant avec une augmentation du gain/ISO. L'utilisateur sera ainsi tenté de monter le gain/ISO pour réduire le bruit de lecture. Mais la pleine capacité de l'appareil est typiquement plus élevée pour des les gains les plus faibles. Les pleines capacités les plus élevées fournissent une plage dynamique de l'image plus large.

source: Selection of a gain / ISO value would be dependent upon the imaging technique being employed. When a long exposure is desired (as with 'typical' DSO imaging), then a low gain / ISO value would usually be preferred to achieve a greater dynamic range in the image. But if a speckle technique ('lucky imaging') is being used, the exposure times would be so low that reducing read noise becomes critical, in such a case the user would likely prioritize a low read noise in the sub-exposures, and will likely need to select a high gain/ISO value.
fr: Le choix d'un gain/ISO dépend de la technique d'imagerie utilisée. Pour les longues durées d'exposition (typiquement utilisées pour l'imagerie du ciel profond), une valeur de gain/ISO faible est préférée afin d'obtenir une plage dynamique plus grande. Mais pour l'imagerie à très courte pose, la réduction du bruit de lecture devient si critique qu'elle devient la priorité et il devient ainsi préférable d'utiliser une valeur de gain/ISO élevée.

source: Some cameras may show a smooth progressive curve in the read-noise over the range of gain values, other cameras may have very pronounced steps (and other anomalies) in their read-noise. These pronounced steps are usually the result of electronic mode switching within the camera. In cases where the graph shows a pronounced step, the user may wish to select a gain value which is at the bottom of that step. This may provide a reduced read noise, and result in a shorter exposure without a significant loss in dynamic range when compared to an image shot at a gain selection that is at the top of that step. But caution is needed when selecting a gain near a “step” on the graph. Some posts on forums indicate that the read-noise data provided by manufacturer documentation may not be exact. The actual “switch” in read-noise may be at a slightly higher or lower gain value, so it is recommended to avoid selecting a gain value that is at a step in read noise.
fr: Certains appareils présentent une courbe de bruit de lecture en fonction du gain très lisse, alors que d'autres en ont une en forme d'escalier (et d'autres anomalies). Ces derniers résultent en général de modes de basculement de l'électronique interne. Dans ces cas, il est préférable de choisir une valeur correspondant au bas d'une marche. Il y aura ainsi un bruit réduit et permettra une durée d'exposition plus courte sans perte significative de la plage dynamique comparée à un choix de gain situé sur le haut de la marche. Mais il faut faire attention pour les valeurs « près » d'une marche. Certains posts sur des forums spécialisés indiquent que les données de bruits de lecture fournies par les constructeurs ne seraient pas tout à fait exactes. Le basculement réel du bruit de lecture pourrait être légèrement plus élevé ou plus faible et il est ainsi recommandé d'éviter de choisir une valeur qui se trouve sur une marche.
