Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-scheduler.po
Languages: fr

source: There is a checkbox and number input right below the Scheduler jobs table that allows you to repeat the entire schedule N times. This can be used to alternate a few jobs. You can just list the jobs on the scheduler, set it to repeat N times, and the jobs will repeat. However, this change is incompatible with 'Remember job progress (above) and unavailable if Remember Job Progress is checked. (Note: Remember Job Progress is recommended.)
fr: Il existe une case à cocher et un champ nombre juste sous la table de tâches qui permet de répéter la programmation entière N fois. Cela peut être utilisé pour alterner quelques tâches. Il suffit de lister les tâches sur l'ordonnanceur, régler pour répéter N fois et les tâches se répéteront. Toutefois, ce changement est incompatible avec l'option « Se souvenir de la progression » et indisponible si cette option est cochée. (Remarque : cette option est recommandée).

source: Editing running jobs
fr: En cours de modification des tâches actives

source: It is possible to edit the scheduler's job table, and attributes of individual jobs, while the scheduler is running. As always, you double click on a job, change the desired attributes, and click the checkbox to finalize the change. If you edit the running job it will be restarted (i.e. the startup steps (slew, focus, align, guide) will be re-done. You can also move jobs up and down in priority, add new jobs, or deleted existing ones. You cannot delete the running job.
fr: Il est possible de modifier la table de tâches et les attributs des tâches individuelles pendant que l'ordonnanceur est actif. Comme toujours, il faut double-cliquer sur une tâche, modifier les attributs et cliquer sur la case à cocher pour enregistrer les modifications. Si vous modifiez une tâche active, celle-ci sera redémarrée (les étapes initiales (rotation, mise au point, alignement, guidage) seront relancées. Vous pouvez également déplacer les tâches pour modifier les priorités, ajouter de nouvelles tâches ou en supprimer. Vous ne pouvez pas supprimer une tâche active.

source: One important attribute of scheduler jobs is their sequence file (.esq) which controls the capture module while the job is running. For example, it sets number of captures, filters used, gain/ISO, etc. The .esq is normally created and edited in the capture tab, but that cannot be done while the scheduler is running. If you desire to make changes to a .esq file while the scheduler is running, or create a new one, the scheduler provides a tool called the Capture Sequence Editor.
fr: Un attribut important des tâches de l'ordonnanceur est leur fichier de séquence (.esq) qui contrôle le module d'acquisition pendant que la tâche est active. Par exemple, il règle le nombre d'acquisitions, les filtres utilisés, le gain/ISO, etc. Le fichier .esq est normalement créé et modifié dans l'onglet d'acquisition, mais cela ne peut pas être fait pendant que l'ordonnanceur est actif. Si vous souhaitez modifier un fichier .esq pendant que l'ordonnanceur est actif, ou en créer un nouveau, il faut utiliser l'outil de modification de la séquence d'acquisition.

source: <title>Capture Sequence Editor</title>
fr: <title>Modificateur de séquences d'acquisition</title>

source: The Capture Sequence Editor is a tool to create and edit capture sequence files (.esq) which can be started by clicking the edit (pencil) icon just above the scheduler table. A screenshot is shown below.
fr: Le Modificateur de séquence d'acquisition est un outil pour créer et modifier les fichiers (.esq) de séquences d'acquisition qui peut être démarré en cliquant sur l'icône en forme de crayon juste au-dessus de la table de l'ordonnanceur. Une capture d'écran est montrée ci-dessous.

source: <screeninfo>Capture Sequence Editor</screeninfo>
fr: <screeninfo>Modificateur de séquences d'acquisition</screeninfo>

source: <phrase>Capture Sequence Editor</phrase>
fr: <phrase>Modificateur de séquences d'acquisition</phrase>

source: The editor is very similar in use and layout to the capture tab--though it is missing all the controls to actually capture image. You edit jobs the same way you do in capture, and load or save sequence queues the same way too (though there are additional Load and Save-To buttons provided in the editor).
fr: Cet outil est très similaire à l'utilisation et dans sa forme à l'onglet d'acquisition, bien qu'il manque tous les boutons pour l'acquisition proprement dit. Les tâches sont modifiées de la même manière que les acquisitions, ainsi que le chargement et l'enregistrement des files de séquences (mais il y a des boutons de chargement et d'enregistrement additionnels).

source: It is important to understand that capture sequences rely to some extent on the filterwheel and camera being used (e.g. the filter names, the possible ISO values, ...). The Capture Sequence Editor, which is not connected to the device drivers, does not have direct access to this information. Instead, the editor uses the values from the last time the capture tab connected to its devices. Thus, it may not make sense to try and create a .esq file for a different camera or filterwheel than the last one connected-to. You may need to wait until your scheduler job is completed and edit that .esq directly in the capture tab.
fr: Il est important de noter que les séquences d'acquisitions dépendent dans une certaine mesure de la roue à filtre et de l'appareil utilisé (p. ex. les noms de filtre, les valeur d'ISO possible, …). Cet outil, qui n'est pas connecté aux pilotes de périphériques, n'a pas accès à cette information. Au contraire, il utilise les valeurs de la dernière connexion des périphériques à l'onglet d'acquisition. Il ne fait ainsi pas de sens de créer un fichier .esq pour un appareil ou une roue à filtres différents que celui utilisé lors de la dernière connexion. Il faudra attendre que la tâche de la séquence soit terminée et modifier le fichier .esl directement dans l'onglet d'acquisition.

source: It is also recommended that you don't overwrite .esq files when scheduler jobs are currently using those same files. (It is OK if the scheduler is running, but not running that job.) This can get the scheduler and capture modules out of sync, as they read the files at different times. Instead, you can save to a different filename and then edit the scheduler job to use the new .esq filename.
fr: Il est également recommandé de ne pas écraser les fichiers .esq pendant que les tâches de l'ordonnanceur utilisent ces mêmes fichiers. (C'est OK de le faire pendant que l'ordonnanceur est en cours mais pas si cette tâche particulière est en exécution). En effet, cela désynchroniserait l'ordonnanceur et les modules d'acquisition, puisqu'ils lisent ces fichiers à des moments différents. Vous devriez plutôt enregistrer sous un nom différent et ensuite modifier la tâche pour utiliser ce nouveau fichier .esq.

source: Workflow
fr: Flux de travail

source: <screeninfo>Scheduler + Planner</screeninfo>
fr: <screeninfo>Ordonnanceur + Planificateur</screeninfo>

source: <phrase>Scheduler + Planner</phrase>
fr: <phrase>Ordonnanceur + Planificateur</phrase>

source: The description above only tackles the <emphasis role="bold">Data Acquisition</emphasis> stage of the observatory workflow. The overall procedure typically utilized in an observatory can be summarized in three primary stages:
fr: La description ci-dessus n'aborde que l'étape d'<emphasis role="bold">acquisition de données</emphasis> du déroulement d'une observation. La procédure complète dans un observatoire peut être résumée par les trois étapes principales :

source: Startup
fr: Démarrage

source: Data Acquisition (including preprocessing and storage)
fr: Acquisition de données (incluant le prétraitement et le stockage)

source: <para>Shutdown</para>
fr: <para>Arrêt</para>

source: Startup Procedure
fr: Procédure de démarrage

source: Startup procedure is unique to each observatory but may include:
fr: La procédure de démarrage est unique à chaque observatoire mais peut inclure :

source: Turning on power to equipment
fr: Mise sous tension du matériel

source: Running safety/sanity checks
fr: Contrôle de sécurité et vérifications

source: Checking weather conditions
fr: Vérification des conditions météorologiques

source: Turning off light
fr: Extinction des lumières

source: Fan/Light control
fr: Contrôle des ventilateurs et de la lumière

source: Unparking dome
fr: Déparcage du dôme

source: Unparking mount
fr: Déparcage de la monture

source: Ekos Scheduler only initiates the startup procedure once the startup time for the first Scheduler job is close (default <emphasis>lead</emphasis> time is 5 minutes before <emphasis>startup</emphasis> time). Once the startup procedure is completed successfully, the scheduler picks the Scheduler job target and starts the sequence process. If a startup script is specified, it shall be executed first.
fr: L'ordonnanceur d'Ekos n'initialise la procédure de démarrage que lorsque l'heure de début de la première observation est proche (le <emphasis>délai</emphasis> par défaut est de 5 minutes avant l'heure de <emphasis>démarrage</emphasis>). Une fois que la procédure de démarrage s'est terminée avec succès, l'ordonnanceur sélectionne la tâche d'observation et démarre le processus de séquence. Si un script de démarrage est spécifié, il sera exécuté en premier.

source: Data Acquisition
fr: Acquisition de données

source: Depending the on the user selection, the typical workflow proceeds as follows:
fr: Selon la sélection de l'utilisateur, un déroulement typique se déroule ainsi :

source: Slew mount to target. If a FITS file was specified, it first solves the files and slew to the file coordinates.
fr: Pivotage de la monture vers la cible. Si un fichier FITS a été spécifié, il sera résolu et la monture pivotera vers les coordonnées de la position.

source: Auto-focus target. The autofocus process automatically selects the best star in the frame and runs the autofocus algorithm against it.
fr: Mise au point de la cible. Le processus de mise au point automatique sélectionne automatiquement la meilleure étoile de la trame et exécute l'algorithme de mise au point.

source: Perform plate solving, sync mount, and slew to target coordinates.
fr: Réalise la résolution, synchronise la monture et pivote vers les coordonnées de la cible.

source: Perform post-alignment focusing since the frame might have moved during the plate solving process.
fr: Réalise une mise au point après l'alignement puisque la trame peut avoir bouger durant le processus de résolution.

source: Perform calibration and start auto-guiding: The calibration process automatically selects the best guide star, performs calibration, and starts the autoguide process.
fr: Réalisation de la calibration et démarrage de l'autoguidage : le processus de calibration sélectionne automatiquement la meilleure étoile guide, réalise la calibration et démarre le processus d'autoguidage.

source: Load the sequence file in the <link linkend="ekos-capture">Capture module</link> and start the imaging process.
fr: Charge le fichier de séquence dans le module d'<link linkend="ekos-capture">acquisition</link> et démarre l'acquisition.

source: Coordinate module issues, such as failures in guiding or alignment. They may result is Scheduler job suspensions and rescheduling.
fr: Coordonne les problème de module telle que l'échec du guidage ou de l'alignement. Cela risque de conduire à la suspension des tâches et à une nouvelle programmation.

source: Note--some of the inter-module interactions are initiated by the modules themselves, but are monitored by the Scheduler. These include meridian flips, autofocus runs initiated by temperature change or timer expiration, and minimum guiding deviation requirements for capture.
fr: Veuillez noter que certaines interactions entre modules sont initiées par les modules eux-même mais sont surveillées par l'ordonnanceur. Cela inclut le retournement au méridien, les mises au point automatiques déclenchées par une variation de température ou l'expiration d'un minuteur ainsi que les conditions de déviation minimale du guidage pour l'acquisition.

source: <title>Shutdown</title>
fr: <title>Arrêt</title>

source: Once the Scheduler job is completed successfully, the scheduler selects the next Scheduler job. If no job can be scheduled at this time, the mount is parked until a next job can run. Furthermore, if the next job is not due for a user-configurable time limit, the scheduler performs a <emphasis>preemptive</emphasis> shutdown to preserve resources and performs the startup procedure again when the target is due.
fr: Une fois que la tâche s'est terminée avec succès, l'ordonnanceur choisit la prochaine tâche. Si l'heure programmée de la prochaine tâche n'est pas encore proche, la monture est parquée jusqu'à ce que la prochaine tâche soit prête. De plus si la prochaine tâche programmée n'est pas proche dans une limite de temps configurable par l'utilisateur, l'ordonnanceur réalise une extinction <emphasis>anticipée</emphasis> pour préserver les resources et réalisera la procédure de démarrage quand la tâche sera prête.

source: If an unrecoverable error occurs, the observatory initiates shutdown procedure. If there is a shutdown script, it will be executed last.
fr: Si une erreur irrécupérable se produit, l'observatoire initie une procédure d'arrêt. S'il existe un script d'arrêt, celui-ci sera exécuté en dernier.

source: The following video demonstrates an earlier version of the scheduler, but the basic principles still apply today:
fr: La vidéo suivante illustre l'utilisation de l'ordonnanceur, et même si elle date un peu, les principes de base restent d'actualité :

source: Ekos Scheduler
fr: Ordonnanceur d'Ekos

source: Weather Monitoring
fr: Surveillance de la météo

source: Another critical feature of any remotely operated robotic observatory is weather monitoring. For weather updates, Ekos relies on the selected INDI weather driver to continuously monitor the weather conditions. For simplicity sake, the weather conditions can be summed in three states:
fr: Un autre aspect critique des observatoires robotiques commandés à distance est la surveillance de la météo. Ekos s'appuie sur le pilote météo d'INDI sélectionné pour surveiller en continu les conditions météorologiques. Par souci de simplicité, les conditions météorologiques se résument en trois états :

source: <emphasis role="bold">Ok</emphasis>: Weather conditions are clear and optimal for imaging.
fr: <emphasis role="bold">Ok</emphasis> : les conditions sont claires et optimales pour imager.

source: <emphasis role="bold">Warning</emphasis>: Weather conditions are not clear, seeing is subpar, or partially obstructed and not suitable for imaging. Any further imaging process is suspended until the weather improves. Warning weather status does not pose any danger to the observatory equipment so the observatory is kept operational. The exact behavior to take under Warning status can be configured.
fr: <emphasis role="bold">Avertissement</emphasis> : les conditions ne sont pas claires, la visibilité (seeing) est sous optimale ou partiellement obstruée et inadaptée pour imager. Tout processus d'acquisition est suspendu en attendant une amélioration. Cet état d'avertissement n'implique pas de danger pour le matériel de l'observatoire, ainsi il reste opérationnel. Les mesures exactes à prendre lors d'état d'avertissement peuvent être configurées.

source: <emphasis role="bold">Alert</emphasis>: Weather conditions are detrimental to the observatory safety and shutdown must be initiated as soon as possible.
fr: <emphasis role="bold">Alerte</emphasis> : les conditions sont préjudiciables à la sécurité de l'observatoire et un arrêt doit être initié le plus rapidement possible.

source: Startup &amp; Shutdown Scripts
fr: Scripts de démarrage &amp; d'arrêt

source: Due to the uniqueness of each observatory, Ekos enables the user to select startup and shutdown scripts. The scripts take care of any necessary procedures that must take place on startup and shutdown stages. On startup, Ekos executes the startup scripts and only proceeds to the remainder of the startup procedure (unpark dome/unpark mount) if the script completes successfully. Conversely, the shutdown procedure begins with parking the mount &amp; dome before executing the shutdown script as the final procedure.
fr: Comme chaque observatoire est unique, Ekos offre la possibilité à l'utilisateur de choisir ses scripts de démarrage et d'arrêt. Les scripts s'occupent de toute procédure qui doivent être activée au démarrage et à l'arrêt. Ekos exécute le script et continue la procédure (déparcage du dôme et de la monture) qu'en cas de succès de l'exécution du script. Inversement, la procédure d'arrêt commence par parquer la monture et le dôme avant d'exécuter le script d'arrêt qui termine la procédure.

source: Startup and shutdown scripts can be written any language that can be executed on the local machine. It must return 0 to report success, any other exist value is considered an error indicator. The script's standard output is also directed to Ekos logger window. The following is an sample demo startup script in Python:
fr: Les scripts peuvent être écrits dans n'importe quel langage qui peut être exécuté sur la machine locale. Un script doit retourner la valeur 0 pour être considéré comme succès, tout autre valeur indique une erreur. La sortie standard du script est dirigée vers la fenêtre des fichiers journaux d'Ekos. Voici un exemple de script de démarrage écrit en Python :

source: #!/usr/bin/env python # -*- coding: utf-8 -*- import os import time import sys print "Turning on observatory equipment..." sys.stdout.flush() time.sleep(5) print "Checking safety switches..." sys.stdout.flush() time.sleep(5) print "All systems are GO" sys.stdout.flush() exit(0)
fr: #!/usr/bin/env python # -*- coding: utf-8 -*- import os import time import sys print "Mise sous tension de l'observatoire&hellip;" sys.stdout.flush() time.sleep(5) print "Test de confiance&hellip;" sys.stdout.flush() time.sleep(5) print "Tout est nominal." sys.stdout.flush() exit(0)

source: The startup and shutdown scripts must be <emphasis>executable</emphasis> in order for Ekos to invoke them (&eg; use <userinput>chmod +x startup_script.py</userinput> to mark the script as executable). Ekos Scheduler enables truly simple robotic operation without the need of any human intervention in any step of the process. Without human presence, it becomes increasingly critical to gracefully recover from failures in any stage of the observation run. Using &plasma; notifications, the user can configure audible alarms and email notifications for the various events in the Scheduler.
fr: Les scripts doivent être <emphasis>exécutables</emphasis> pour qu'Ekos puisse les invoquer (c'est-à-dire utilisez la commande <userinput>chmod u+x startup_script.py</userinput> pour le rendre exécutable). L'ordonnanceur d'Ekos permet d'opérer un observatoire de manière complètement robotisée sans aucune intervention humaine. Il est donc critique que le système puisse se rétablir après des erreurs, et cela à n'importe quelle étape du processus d'observation. L'utilisation des notifications &plasma; permet de configurer des alarmes audibles et l'envoi automatique de courriels pour divers évènements de l'ordonnanceur.

source: <title>Mosaic Planner</title>
fr: <title>Planificateur de mosaïques</title>

source: <screeninfo>Mosaic Planner</screeninfo>
fr: <screeninfo>Planificateur de mosaïques</screeninfo>

source: <phrase>Mosaic Planner</phrase>
fr: <phrase>Planificateur de mosaïques</phrase>

source: Hubble-like super wide field images of <ulink url="http://darkskyart.com/?page_id=96">galaxies</ulink> and nebulae are truly awe-inspiring, and while it takes great skills to obtain such images and process them; many notable names in the field of astrophotography employ gear that is not <emphasis>vastly</emphasis> different from yours or mine. I emphasize <emphasis>vastly</emphasis> because some do indeed have impressive equipment and dedicated observatories worth tens of the thousands of dollars. Nevertheless, many amateurs can obtain stellar wide-field images by combining smaller images into a single grand mosaic.
fr: Les images super grand champ du télescope spacial Hubble de <ulink url="http://darkskyart.com/?page_id=96">galaxies</ulink> ou de nébuleuses sont source d'émerveillement. Bien que des compétences pointues soient nécessaires pour obtenir de telles images et les traiter, les grands noms en astrophotographie emploient du matériel qui n'est pas <emphasis>très éloigné</emphasis> du vôtre ou du mien. Je souligne <emphasis>très éloigné</emphasis> parce certains ont en effet du matériel très impressionnant et des observatoires dédiés valant une fortune. Néanmoins, beaucoup d'amateurs peuvent obtenir des images grand champ en combinant plusieurs petites images en une seule et grande mosaïque.

source: We are often limited by our camera+telescope Field of View (FOV). By increasing FOV by means of a focal reducer or a shorter tube, we gain a larger sky coverage at the expense of spatial resolution. At the same time, many attractive wide-field targets span multiple FOVs across the sky. Without any changes to your astrophotography gear, it is possible to create a super mosaic image <emphasis>stitched</emphasis> together from several smaller images. There are two major steps to accomplish a super mosaic image:
fr: Nous sommes souvent limités par le champ de vision de l'ensemble caméra et télescope. En augmentant le champ de vision à l'aide d'un réducteur de focale ou un tube plus court, on obtient une couverture du ciel plus importante au coût d'une diminution de la résolution spatiale. En même temps, beaucoup de cibles grand champ couvrent plusieurs champs de vision dans le ciel. Sans aucune modification de votre matériel, il est possible de créer une super mosaïque en <emphasis>joignant</emphasis> ensemble plusieurs images plus petites. Il y a deux étapes principales pour accomplir une mosaïque :

source: Capture multiple images spanning the target with some overlap between images. The overlap is necessary to enable the processing software from aligning and joining the sub-images.
fr: Acquérir plusieurs images couvrant la cible qui se chevauchent partiellement. Le chevauchement est nécessaire pour permettre au logiciel de traitement d'aligner et de joindre les petites images.

source: Process the images and <emphasis>stitch</emphasis> them into a super mosaic image.
fr: Traiter les images et les <emphasis>joindre</emphasis> ensemble pour créer la mosaïque.
