Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ai-contents.po
Languages: fr

source: AstroInfo: Table of Contents
fr: AstroInfo : table des matières

source: The Sky and Coordinate Systems
fr: Le ciel et le système de coordonnées célestes

source: Celestial Coordinate Systems
fr: Système de coordonnées célestes

source: Celestial Equator
fr: Équateur céleste

source: Celestial Poles
fr: Pôles célestes

source: Celestial Sphere
fr: Sphère céleste

source: The Ecliptic
fr: L'écliptique

source: The Equinoxes
fr: Les équinoxes

source: Geographic Coordinates
fr: Coordonnées géographiques

source: Great Circles
fr: Grands cercles

source: The Horizon
fr: L'horizon

source: Hour Angle
fr: Angle horaire

source: Local Meridian
fr: Méridien local

source: Precession
fr: Précession

source: The Zenith
fr: Le zénith

source: Time
fr: Heure

source: Epoch
fr: Époque

source: Julian Day
fr: Jour Julien

source: Leap Years
fr: Années bissextiles

source: Sidereal Time
fr: Heure sidérale

source: Time Zones
fr: Fuseaux horaires

source: Universal Time
fr: Heure universelle

source: Telescopes
fr: Télescopes

source: Physics
fr: Physique

source: Blackbody Radiation
fr: Radiation de corps noir

source: Dark Matter
fr: Matière sombre

source: Luminosity
fr: Luminosité

source: Parallax
fr: Parallaxe

source: Retrograde Motion
fr: Mouvement rétrograde

source: Astrophysics
fr: Astrophysique

source: Elliptical Galaxies
fr: Galaxies elliptiques

source: Spiral Galaxies
fr: Galaxies spirales

source: The Magnitude Scale
fr: L'échelle de magnitude

source: Stars: An Introductory &FAQ;
fr: Étoiles : une &FAQ; introductive

source: Star Colors and Temperatures
fr: Couleurs et températures des étoiles

source: The Cosmic Distance Ladder
fr: L'échelle des distances cosmiques
