Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-focus.po
Languages: fr

source: <emphasis role="bold">Classic</emphasis>: This is the recommended setting. The equation used is displayed in the top right of the dialog and is the equation most commonly seen on the internet. The equation comes from a linear optics treatment using the Airy Disc and is acknowledged to have limitations. For this reason it includes a "tolerance" factor that can be adjusted by the user. For example, in the often quoted “In Perfect Focus” article by Don Goldman and Barry Megdal in Sky &amp; Telescope 2010 they suggest setting t=1/3.
fr: <emphasis role="bold">Classique</emphasis> : c'est le réglage recommandé. L'équation utilisée est affichée en haut à droite du panneau et est l'équation la plus utilisée sur l'Internet. Elle provient d'un traitement d'optique linéaire qui utilise un disque d'Airy et est connue pour avoir quelques limitations. Elle inclut pour cette raison un facteur de tolérance qui peut être ajusté par l'opérateur. Par exemple dans l'article souvent cité « In perfect Focus » par Don Goldman et Barry Megdal paru dans Sky &amp; Telescope 2010, ils suggèrent d'utiliser t=1/3.

source: <emphasis role="bold">Wavefront</emphasis>: The equation used is displayed in the top right of the dialog. The equation comes from a wavefront approach to the CFZ. Again, it has limitations and again, for this reason it includes a "tolerance" factor that can be adjusted by the user.
fr: <emphasis role="bold">Front d'onde</emphasis> : l'équation utilisée est affichée en haut à droite du panneau. Elle provient d'une approche de front d'onde de la CFZ. Elle contient également des limitations et pour cette raison elle inclut un facteur de tolérance qui peut être ajusté par l'opérateur.

source: <emphasis role="bold">Gold</emphasis>: This method is based on work done by Gold Astro and presented <ulink url="https://www.goldastro.com/goldfocus/ncfz.php">here</ulink>.
fr: <emphasis role="bold">Gold</emphasis> : cette méthode est fondée sur le travail de Gold Astro qui est présenté <ulink url="http://www.goldastro.com/goldfocus/ncfz.php">ici</ulink>.

source: <guilabel>Tolerance</guilabel>: This is used by Classic and Wavefront algorithms and is a scaling factor between 0 and 1.
fr: <guilabel>Tolérance</guilabel> : cette valeur est utilisée par les algorithmes Classique et Front d'onde et est un facteur d'échelle dont la valeur est comprise entre 0 et 1.

source: For the Classic algorithm, Goldman and Megdal suggest 1/3.
fr: Pour l'algorithme Classique, Goldman et Megdal suggère la valeur 1/3.

source: For the Wavefront algorithm, some have suggested 1/3 or even 1/10.
fr: Pour l'algorithme du front d'onde, certains suggèrent la valeur 1/3 ou même 1/10.

source: <guilabel>Tolerance (τ)</guilabel>: This is used by the Gold algorithm and is a focus tolerance as a percentage of total seeing. The Gold website suggests 3-5% for a good focuser or 1-2% for a top quality focuser. See the <ulink url="https://www.goldastro.com/goldfocus/ncfz.php">Gold Astro website</ulink> for more details.
fr: <guilabel>Tolérance (τ)</guilabel> : cette valeur est utilisée pour l'algorithme Gold et est une tolérance de la mise au point exprimée comme un pourcentage de la qualité totale du ciel (seeing). Le site web de Gold suggère une valeur de 3 à 5 % pour un bon moteur de mise au point et 1 à 2 % pour les meilleurs moteurs. Pour davantage d'informations, veuillez consulter le <ulink url="http://www.goldastro.com/goldfocus/ncfz.php">site web de Gold Astro</ulink>.

source: <guilabel>Display</guilabel>: Check this box to display the calculated CFZ on the V-Curve after a successful Autofocus run. It is displayed as a yellow moustache.
fr: <guilabel>Affichage</guilabel> : cochez cette case pour afficher la CFZ calculée sur la courbe en V après une exécution réussie de la mise au point automatique. Elle sera affichée comme une moustache jaune.

source: <guilabel>Reset to OT</guilabel>: Press this button to reset any parameters to values defaulted from the currently connected Optical Train.
fr: <guilabel>Réinitialiser le train optique</guilabel> : cliquez sur ce bouton pour réinitialiser les paramètres à leur valeur par défaut obtenu du train optique actuellement utilisé.

source: <guilabel>Wavelength (λ)</guilabel>: This is the light wavelength to use. It is defaulted from the currently used filter. Remember to set this up in <link linkend="focus-filter-settings">Filter Settings</link> for your filters.
fr: <guilabel>Longueur d'onde (λ)</guilabel> : c'est la longueur d'onde de la lumière à utiliser. Sa valeur est obtenue du filtre actuellement utilisé. N'oubliez pas de régler ceci dans les <link linkend="focus-filter-settings">Réglages de filtres</link> de vos filtres.

source: <guilabel>Aperture (A)</guilabel>: This is the aperture of the telescope in mm. It is defaulted from the currently connected Optical Train.
fr: <guilabel>Ouverture (A)</guilabel> : c'est l'ouverture du télescope en mm. Sa valeur est obtenue du train optique actuellement utilisé.

source: <guilabel>Focal Ratio (f)</guilabel>: This is the focal ratio of the telescope. It is defaulted from the currently connected Optical Train.
fr: <guilabel>Ratio de la focale (f)</guilabel> : c'est le ratio de la focale du télescope. Sa valeur est obtenue du train optique actuellement utilisé.

source: <guilabel>FWHM (θ)</guilabel>: This is used by the Gold Algorithm and is the total seeing. This is the combined contribution of the diffraction limit of your telescope and the astronomical seeing. The <ulink url="https://www.goldastro.com/goldfocus/ncfz.php">Gold Astro website</ulink> describes how you might approximate the total once you have values for the individual contributions.
fr: <guilabel>FWHM (θ)</guilabel> : cette valeur est utilisée par l'algorithme Gold et est la qualité totale du ciel (seeing). C'est la contribution combinée de la limite de diffraction de votre télescope et de la qualité astronomique du ciel (seeing). Le <ulink url="http://www.goldastro.com/goldfocus/ncfz.php">site web de Gold Astro</ulink> décrit la manière d'approximer ce total une fois les contributions individuelles obtenues.

source: <guilabel>CFZ</guilabel>: This is calculated CFZ in microns and in ticks.
fr: <guilabel>CFZ</guilabel> : c'est la CFZ calculée en microns et en pas

source: <guilabel>Step Size</guilabel>: This must be input by the user (as it cannot be calculated by Ekos). It relates how far 1 tick moves the focal plane in microns.
fr: <guilabel>Taille de pas</guilabel> : cette valeur doit être indiquée par l'opérateur (puisqu'elle ne peut pas être calculée par Ekos). Elle mesure la distance d'un pas en microns dans le plan focal.

source: For a refractor this is how far the drawtube moves when the focuser is moved by 1 tick. You might be able to get this value from the specification of your focuser (how many ticks for a complete revolution of your focuser) and the thread pitch of your telescope drawtube along with any gearing involved.
fr: Pour un réfracteur, c'est la distance de déplacement du tube quand le moteur de mise au point se déplace d'un pas. Vous pouvez peut-être obtenir cette valeur des spécifications de votre moteur de mise au point (le nombre de pas pour un tour complet du moteur) et du pas de filetage de votre télescope ainsi que de tout autre engrenage impliqué dans le mouvement.

source: Alternatively, you can measure how far the drawtube moves from end to end (be careful not to force the drawtube) with a set of calipers or a ruler. By subtracting the furthest "in" position (in ticks) from the furthest "out" position (in ticks) you have how many ticks moved the drawtube the distance you measured. From this you can calculate the distance in microns a single tick moves the drawtube.
fr: Alternativement, vous pouvez mesurer la distance totale de mouvement de tube depuis la position fermée jusqu'à l'ouverture complète (faites attention de ne pas forcer le tube) à l'aide d'une règle. En prenant la différence (en pas), vous obtiendrez le nombre de pas de déplacement. À partir de cela, vous pouvez calculer la distance en microns d'un seul pas.

source: Other types of telescope will have other ways to adjust the focal plane, for example, by moving the primary or secondary mirrors. You will need to either get the Step Size from the documentation for your equipment or work out how to measure it in a way that are consistent with that described above.
fr: Les autres types de télescope ont une autre manière d'ajuster le plan focal, comme par exemple, en déplaçant les miroirs primaires et secondaires. Vous devrez obtenir la taille de pas de la documentation ou trouver comment la mesurer en tenant compte de ce qui a été décrit ci-dessus.

source: <guilabel>CFZ Camera</guilabel>: The pixel size of the camera attached via the Optical Train may have a limiting effect on the CFZ. So an equivalent CFZ for the attached camera is calculated assuming a Nyquist 2* limit.
fr: <guilabel>CFZ de l'appareil</guilabel> : la taille de pixel de l'appareil attaché via le train optique peut avoir un effet limitant sur la CFZ. Par conséquent, une CFZ équivalente pour l'appareil attaché est calculée en supposant une limite de Nyquist de 2*.

source: <guilabel>Final CFZ</guilabel>: This is the larger of the CFZ calculated using the selected algorithm for the specified parameter and the <guilabel>CFZ Camera</guilabel>. It is the display value and is, in effect, the CFZ of your equipment.
fr: <guilabel>CFZ finale</guilabel> : c'est la plus grande des valeurs entre la CFZ calculée en utilisant l'algorithme choisi pour les paramètres spécifiés et la <guilabel>CFZ de l'appareil</guilabel>. C'est la valeur affichée et donc celle effective de votre équipement.

source: <title>Focus Advisor</title>
fr: <title>Conseiller de mise au point</title>

source: <screeninfo>Focus Advisor</screeninfo>
fr: <screeninfo>Conseiller de mise au point</screeninfo>

source: <phrase>Focus Advisor</phrase>
fr: <phrase>Conseiller de mise au point</phrase>

source: This is the Focus Advisor dialog. It is a feature to assist with management of focus parameters.
fr: Ceci est le panneau du conseiller de mise au point. C'est une fonctionnalité d'assistance à la gestion des paramètres de mise au point.

source: The purpose of Focus Advisor is to help people struggling to use the Focus module within Ekos. The Focus module is functionally rich and contains a lot of parameters that need to be set self-consistently to achieve good results. Focus Advisor is designed to help with basic parameter setup that should achieve focus. It is not designed to achieve the best possible focus for your equipment; you will have to experiment with your setup to achieve that. But Focus Advisor provides a place to start that experimentation.
fr: Le but de ce conseiller de mise au point est d'aider les personnes qui ont des difficultés pour utiliser le module de mise au point d'Ekos. Ce module est riche en fonctionnalités et contient beaucoup de paramètres qui doivent être réglés de manière cohérente entre eux pour donner de bons résultats. Le conseiller est conçu pour aider à régler les paramètres de base pour obtenir la mise au point, mais n'est néanmoins pas conçu pour obtenir la meilleure mise au point possible pour votre équipement ; il sera donc nécessaire d'expérimenter avec votre montage pour obtenir cela. Mais cela est un bon point de départ pour ces tests.

source: So Focus Advisor is aimed towards the less experienced users.
fr: Ainsi, le conseiller de mise au point est destiné aux opérateurs moins expérimentés.

source: If Focus Advisor does not appear to give good results on your setup why not start a discussion on the forum so it can be enhanced to give better results in the future. This way it will build over time to be more useful.
fr: Si le conseiller de mise au point ne donne pas de bons résultats, pourquoi ne pas ouvrir une discussion sur le forum afin de permettre de l'améliorer pour donner de meilleurs résultats dans le futur ? Cela permettra de l'améliorer avec le temps.

source: When you click on Focus Advisor it works out a series of parameter recommendations based on the Optical Train you are using in Focus.
fr: En cliquant sur le bouton du conseiller de mise au point, une série de paramètres est recommandée, fondée sur le train optique que vous êtes en train d'utiliser dans le module de mise au point.

source: At the top of the dialog it displays information about the connected Optical Train. Then it displays 6 lines relating to various sets of parameters used within Focus. Against each line is a checkbox to update the associated Focus fields with Focus Advisor's recommendations.
fr: En haut du panneau est affiché de l'information concernant le train optique utilisé. Ensuite, six lignes sont affichées liées aux différents ensembles de paramètres utilisés par le module de mise au point. Et à côté de chaque ligne il y a une case à cocher permettant d'utiliser les données des recommandations du conseiller pour les champs de mise au point associés.

source: Focus parameters are broken into the following groupings:
fr: Les paramètres de mise au point sont regroupés de la manière suivante :

source: <guilabel>Step Size</guilabel>: This is the suggested focus step size to use. This is a critical parameter. It is defaulted from the Critical Focus Zone (CFZ) dialog. So the first thing to do is set this dialog up and get a reasonable value for the CFZ. Alternatively, if you know a reasonable value for your equipment from other sources you can just enter that.
fr: <guilabel>Taille de pas</guilabel> : c'est la taille de pas recommandée, qui est un paramètre critique. La valeur provient de la boîte de dialogue de la zone critique de mise au point (CFZ). Ainsi, la première chose à faire est de configurer ce panneau et y mettre une valeur raisonnable pour la CFZ. Alternativement, si vous avez obtenu une bonne valeur pour votre équipement d'autres sources, vous pouvez simplement la saisir ici.

source: <guilabel>Out Step Multiple</guilabel>: This is the suggested outward step multiple to use.
fr: <guilabel>Multiple de pas extérieur</guilabel> : c'est le multiple de pas extérieur à utiliser.

source: <guilabel>Camera &amp; Filter Wheel Parameters</guilabel>: This sets the parameters in the <link linkend="focus-ccd-filter-wheel">CCD &amp; Filter Wheel</link> section of the Focus screen. By hovering the mouse over this label you can see in the tooltip what values Focus Advisor is recommending.
fr: <guilabel>Appareil &amp; paramètres de la roue à filtre</guilabel> : ce sont les paramètres de la section <link linkend="focus-ccd-filter-wheel">Appareil &amp; Roue à filtres</link> de l'écran de mise au point. En survolant cette étiquette avec la souris, vous pouvez voir dans l'info-bulle les valeurs recommandées par le conseiller de mise au point.

source: <guilabel>Settings Parameters</guilabel>: This sets the parameters in <link linkend="focus-settings">Focus Settings</link>. By hovering the mouse over this label you can see in the tooltip what values Focus Advisor is recommending.
fr: <guilabel>Paramètres des réglages</guilabel> : ce sont les paramètres du panneau des <link linkend="focus-settings">Réglages de la mise au point</link> de l'écran de mise au point. En survolant cette étiquette avec la souris, vous pouvez voir dans l'info-bulle les valeurs recommandées par le conseiller de mise au point.

source: <guilabel>Process Parameters</guilabel>: This sets the parameters in <link linkend="focus-process">Focus Process</link>. By hovering the mouse over this label you can see in the tooltip what values Focus Advisor is recommending.
fr: <guilabel>Paramètres du processus</guilabel> : ce sont les paramètres du panneau du <link linkend="focus-process">Processus de mise au point</link> de l'écran de mise au point. En survolant cette étiquette avec la souris, vous pouvez voir dans l'info-bulle les valeurs recommandées par le conseiller de mise au point.

source: <guilabel>Mechanics Parameters</guilabel>: This sets the parameters in <link linkend="focus-mechanics">Focus Mechanics</link>. By hovering the mouse over this label you can see in the tooltip what values Focus Advisor is recommending.
fr: <guilabel>Paramètres de la mécanique</guilabel> : ce sont les paramètres du panneau de la <link linkend="focus-mechanics">Mécanique de la mise au point</link> de l'écran de mise au point. En survolant cette étiquette avec la souris, vous pouvez voir dans l'info-bulle les valeurs recommandées par le conseiller de mise au point.

source: <guilabel>Help</guilabel>: Press this button to get help on using Focus Advisor.
fr: <guilabel>Aide</guilabel> : cliquez sur ce bouton pour obtenir de l'aide sur l'utilisation du conseiller de mise au point.

source: <guilabel>Update Params</guilabel>: Press this button to accept the Focus Advisor recommendations and update the Focus parameters where the associated <guilabel>Update</guilabel> checkbox is checked..
fr: <guilabel>Mettre à jour les paramètres</guilabel> : cliquez sur ce bouton pour accepter les recommandations du conseiller de mise au point et mettre à jour les paramètres quand la case à cocher associée <guilabel>Mise à jour</guilabel> est cochée…

source: Filter Settings
fr: Réglages des filtres

source: <screeninfo>Filter Queue</screeninfo>
fr: <screeninfo>File d'attente des filtres</screeninfo>

source: <phrase>Filter Queue</phrase>
fr: <phrase>File d'attente des filtres</phrase>

source: Click the filter icon <inlinemediaobject><imageobject><imagedata fileref="view-filter.png" format="PNG"/></imageobject> </inlinemediaobject> from either Capture or Focus to open the filter settings dialog. This popup allows the user to configure data associated with each filter, and used for various functions within the system.
fr: Cliquez sur l'icône de réglages des filtres <inlinemediaobject><imageobject><imagedata fileref="view-filter.png" format="PNG"/></imageobject> </inlinemediaobject> depuis le module Acquisition ou le module de Mise au point pour ouvrir la fenêtre de réglages des filtres. Elle permet à l'opérateur de configurer les données de chaque filtre qui sont utilisées par de nombreuses fonctions du système.

source: Focusing with different filters can be done in one of three ways within Ekos.
fr: La mise au point avec des filtres différents peut être réalisée de trois manières différentes dans Ekos.

source: <emphasis role="bold">Direct Autofocus</emphasis>: When Capture changes to this filter it is possible to automatically refocus this filter. The exposure to use for the selected filter is taken from the <guilabel>Exposure</guilabel> field. This allows, for example, narrowband filters to use a longer exposure than broadband filters during Autofocus.
fr: <emphasis role="bold">Mise au point automatique directe</emphasis> : quand le module Acquisition change de filtre, il est possible de refaire une mise au point automatique pour ce filtre. La durée d'exposition pour ce filtre est obtenue du champ <guilabel>Durée d'exposition</guilabel>. Cela permet par exemple d'augmenter la durée d'exposition des filtres à bande étroite par rapport à des filtres à large bande pour la mise au point automatique.

source: Check <guilabel>Auto Focus</guilabel> to use the filter in this way.
fr: Cochez <guilabel>Mise au point automatique</guilabel> pour utiliser le filtre de cette manière.

source: <emphasis role="bold">Autofocus on Lock Filter</emphasis>: It is possible to specify a Lock filter to use when it is required to focus this filter. For example, if the Ha filter is used and an Autofocus run required, it is possible to run Autofocus using the Lum filter and then, when complete, adjust the focus position by an Offset value corresponding to the predetermined focus difference between the Lum and Ha filters (100 ticks in this example). This is useful when, for example, it is difficult to focus some filters directly without excessively long exposure times. Note that this locked filter approach may also be used in the <link linkend="ekos-align">Alignment Module</link> whenever it performs a capture for astrometry.
fr: <emphasis role="bold">Mise au point automatique pour filtre verrouillé</emphasis> : il est possible de spécifier un filtre verrouillé quand il est requis d'utiliser ce filtre pour la mise au point. Par exemple, si un filtre Ha est utilisé et qu'une mise au point automatique est nécessaire, il est possible de lancer une mise au point automatique avec le filtre de luminance et une fois fait, d'ajuster la position de la mise au point en décalant la position d'une valeur correspondant à la différence de position entre les mises au point du filtre Ha et du filtre de luminance (100 pas dans cet exemple). Cela est utile quand, par exemple, il est difficile d'effectuer de mettre au point avec certains filtres qui demandent des durées d'exposition excessivement longues. Veuillez noter que cette approche peut également être utilisée avec le <link linkend="ekos-align">module d'alignement</link> pour une résolution astrométrique.

source: To use a filter in this way, check <guilabel>Auto Focus</guilabel>, specify the <guilabel>Lock Filter</guilabel> to use and make sure that the Offsets for this filter and the <guilabel>Lock Filter</guilabel> are set.
fr: Pour utiliser un filtre de cette manière, cochez <guilabel>Mise au point automatique</guilabel>, spécifiez le <guilabel>Filtre verrouillé</guilabel> à utiliser et veillez que le décalage entre ce filtre et le <guilabel>Filtre verrouillé</guilabel> est bien réglé.

source: <emphasis role="bold">Use Offsets</emphasis>: It is possible to use filter offsets to adjust focus when swapping between filters, without running Autofocus. This requires some setup work ahead of time but has the advantage of reducing the number of Autofocus runs and therefore reducing the time spent autofocusing.
fr: <emphasis role="bold">Utiliser décalages</emphasis> : il est possible d'utiliser des décalages pour les filtres pour ajuster la mise au point quand on permute les filtres sans exécuter de mise au point automatique. Cela nécessite un peu de travail préparatoire mais a l'avantage de réduire le nombre de passes de mise au point automatique et par conséquent le temps consacré à ces opérations.
