Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_ekos-align.po
Languages: fr

source: Before you begin the alignment process, select the desired optical train. You can explore astrometry.net options that are passed to the astrometry.net solver each time an image is captured:
fr: Avant de démarrer la procédure d'alignement polaire, il faut sélectionner le bon train optique. Vous pouvez explorer les options d'astrometry.net qui sont passées au résolveur à chaque acquisition d'image :

source: <guilabel>Accuracy</guilabel>: Acceptable difference between the desired target position and the solved coordinates from the captured image. If the difference exceeds this many arc-seconds, then the system will continue to capture, solve and slew until the solved position is close enough to the target position.
fr: <guilabel>Précision</guilabel> : différence acceptable entre la position souhaitée de la cible et les coordonnées obtenues de la résolution de l'image acquise. Si cette différence dépasse cette valeur en secondes d'arc, le système poursuivra les acquisitions, la résolution et le pivotement jusqu'à trouver une position assez proche de la position de la cible.

source: <guilabel>Train</guilabel>: Select the Optical Train which will be used to capture the image to be aligned. It is also used to compute the image scale.
fr: <guilabel>Train</guilabel> : sélectionnez le train optique qui sera utilisé pour l'acquisition de l'image pour l'alignement. Également utilisé pour calculer l'échelle de l'image.

source: <guilabel>Exposure</guilabel>: Exposure duration in seconds.
fr: <guilabel>Exposition</guilabel> : durée d'exposition en secondes.

source: <guilabel>Bin</guilabel>: The binning of the image before solving.
fr: <guilabel>Bin</guilabel> : réglage du groupement de pixels vertical du CCD.

source: <guilabel>Gain/ISO</guilabel>: The camera gain or ISO.
fr: <guilabel>Gain/ISO</guilabel> : le gain ou l'ISO de l'appareil

source: <guilabel>Filter/Use Current</guilabel>: The filter to use when capturing the image. <guilabel>Use Current</guilabel> uses whatever filter is currently active.
fr: <guilabel>Filtre/Utiliser actuel</guilabel> : le filtre à utiliser pour l'acquisition de l'image. <guilabel>Utiliser actuel</guilabel> utilise le filtre actuellement activé.

source: <guilabel>Dark</guilabel>: Whether to use the dark-image subtraction scheme before analyzing the captured image.
fr: <guilabel>Dark</guilabel> : indique s'il faut soustraire l'image Dark avant l'analyse de l'image acquise.

source: <title>Polar Alignment</title>
fr: <title>Alignement polaire</title>

source: When setting up a German Equatorial Mount (GEM) for imaging, a critical aspect of capturing long-exposure images is to ensure proper polar alignment. A GEM mount has two axis: Right Ascension (RA) axis and Declination (DE) axis. Ideally, the RA axis should be aligned with the celestial sphere polar axis. A mount's job is to track the star's motion around the sky, from the moment they rise at the eastern horizon, all the way up across the median, and westward until they set.
fr: Un des aspects critiques de l'installation d'une monture équatoriale allemande pour l'imagerie longue durée est un alignement polaire aussi précis que possible. Ces montures ont deux axes : l'ascension droite (AD) et la déclinaison (DEC). Idéalement l'axe du paramètre « AD » devrait être aligné avec l'axe polaire de la sphère céleste. Le travail d'une monture est de suivre le déplacement d'une étoile dans le ciel depuis son lever à l'horizon est jusqu'au passage au méridien puis enfin jusqu'à son coucher vers l'ouest.

source: <phrase>Polar Alignment Assistant</phrase>
fr: <phrase>Assistant d'alignement polaire</phrase>

source: In long exposure imaging, a camera is attached to the telescope where the image sensor captures incoming photons from a particular area in the sky. The incident photons have to strike the same photo-site over and over again if we are to gather a clear and crisp image. Of course, actual photons do not behave in this way: optics, atmosphere, seeing quality all scatter and refract photons in one way or another. Furthermore, photons do not arrive uniformly but follow a Poisson distribution. For point-like sources like stars, a point spread function describes how photons are spatially distributed across the pixels. Nevertheless, the <emphasis>overall</emphasis> idea we want to keep the source photons hitting the same pixels. Otherwise, we might end up with an image plagued with various trail artifacts.
fr: Dans l'imagerie longue durée, une caméra est montée sur le télescope qui enregistre les photons qui arrivent sur son capteur depuis une région particulière du ciel. Ces photons doivent frapper le même pixel encore et encore pour obtenir une image claire et étincelante. Bien sûr, les vrais photons ne se comportent pas exactement comme cela. Les défauts d'optique, l'atmosphère turbulente, la qualité du ciel (« Seeing » en anglais) génèrent une légère dispersion des photons sur le capteur. De plus, ils n'arrivent pas uniformément mais suivant une distribution de Poisson. Pour des sources ponctuelles comme les étoiles, une fonction de dispersion de point (Point Spread Function ou PSF en anglais) décrit leur distribution spatiale à travers les pixels. Cela dit, l'idée <emphasis>principale</emphasis> est de faire en sorte que les photons frappent toujours le même pixel. Sinon, l'image finale sera polluée de diverses traînées et autres artefacts.

source: <screeninfo>Polar Alignment</screeninfo>
fr: <screeninfo>Alignement polaire</screeninfo>

source: <phrase>Polar Alignment</phrase>
fr: <phrase>Alignement polaire</phrase>

source: Since mounts are not perfect, they cannot perfectly keep track of object as it transits across the sky. This can stem from many factors, one of which is the misalignment of the mount's Right Ascension axis with respect to the celestial pole axis. Polar alignment removes one of the biggest sources of tracking errors in the mount, but other sources of error still play a factor. If properly aligned, some mounts can track an object for a few minutes with the only deviation of 1-2 arcsec RMS.
fr: Les montures n'étant pas parfaites non plus, elles ne peuvent suivre parfaitement un objet lors de sa course dans le ciel. Cela peut provenir de plusieurs facteurs, l'un d'entre eux étant l'alignement imparfait de l'axe d'ascension droite par rapport à l'axe du pôle céleste. Un alignement polaire précis supprime (ou minimise) l'une des plus importantes sources d'erreur de suivi de la monture mais d'autres sources d'erreur ont également un impact. Une monture correctement alignée peut suivre un objet pendant plusieurs minutes avec seulement 1 ou 2 secondes d'arc d'erreur RMS.

source: However, unless you have a top of the line mount, then you'd probably want to use an autoguider to keep the same star locked in the same position over time. Despite all of this, if the axis of the mount is not properly aligned with the celestial pole, then even a mechanically-perfect mount would lose tracking with time. Tracking errors are proportional to the magnitude of the misalignment. It is therefore very important for long exposure imaging to get the mount polar aligned to reduce any residual errors as it spans across the sky.
fr: Toutefois, même avec un monture alignée très soigneusement, vous souhaiterez probablement utiliser un guide pour conserver une étoile verrouillée à la même position dans le temps. Malgré tout cela, si l'axe de la monture n'est pas correctement aligné avec le pôle céleste, même un monture mécaniquement parfaite ne permettra pas un suivi dans le temps. Les erreurs de suivi sont proportionnelles à la grandeur de l'erreur d'alignement. Il est par conséquent très important pour les longues poses d'obtenir un alignement le plus précis possible afin de réduire les erreurs résiduelles lors du déplacement dans le ciel.

source: Before starting the process, point the mount as close as possible to the celestial pole with the counterweights down. If you are living in the Northern Hemisphere, point it as close as possible to Polaris. If Polaris is not visible (&eg; blocked by trees or buildings) you may point elsewhere, preferably near the Meridian. Make sure there is at least 30-60 degrees of sky viewable in an arc East or West of the Meridian from the position you choose. Select the direction of free sky, the number of degrees for each of two slews, the mount slew speed, and whether the mount will be slewing automatically (recommended) or manually.
fr: Avant le début de la procédure, pointez la monture aussi près que possible vers le pôle céleste avec le contre-poids vers le bas. Si vous habitez dans l'hémisphère nord, pointez vers l'étoile polaire Polaris. Si Polaris n'est pas visible (par exemple masquée par des arbres ou des bâtiments), vous pouvez pointer ailleurs mais de préférence vers le méridien. Assurez-vous qu'il y a au moins 30 à 60 degrés de ciel visible à l'est ou à l'ouest de la position choisie. Choisissez la direction du ciel libre, le nombre de degrés de déplacement pour chaque rotation, la vitesse de rotation et si la monture se déplace automatiquement (ce qui est recommandé) ou manuellement.

source: The tool works by capturing and solving three images. After capturing each, the mount rotates by the fixed amount you entered and another image is captured and solved. If you choose manual, you will need to slew the mount by roughly the angle chosen.
fr: L'outil fonctionne en prenant et en résolvant trois images. Après chaque acquisition, la monture tourne d'une quantité fixe et une nouvelle image est prise et résolue. Si vous choisissez le mode manuel, vous devrez tourner la monture de l'angle choisi.

source: <screeninfo>Polar Alignment Assistant</screeninfo>
fr: <screeninfo>Assistant d'alignement polaire</screeninfo>

source: Plate Solve Correction Scheme
fr: Schéma de correction de la résolution

source: The images below show the workflow when the <emphasis>Plate Solve</emphasis> correction technique is used. The image below shows a display after the 3 measurement images are captured and solved. It shows an error of almost 18' in altitude and that the mount's axis needs to be moved up. Similarly it shows an azimuth error of almost 15' and that the axis needs to be moved to the right (as viewed from behind the telescope).
fr: Les images affichées ci-dessous montrent le flux de travail quand la technique de correction de la <emphasis>résolution</emphasis> est utilisée. L'image ci-dessous montre l'affichage après que trois images aient été acquises et résolues. On voit une erreur de 18' en altitude et donc que l'axe de la monture doit être réajustée en fonction. On voit de même une erreur de 15' en azimut et un réajustement de l'axe de la monture vers la droite (vu de derrière le télescope).

source: Polar Alignment Assistant, Plate Solve Workflow 1
fr: Assistant d'alignement polaire, flux de travail 1 de la résolution

source: If your error is low enough (&eg; less than an arc-minute) then you don't need to make any adjustments. Simply press stop and you're done.
fr: Si l'erreur est suffisamment petite (moins d'une minute d'arc), il est inutile de faire des ajustements. Cliquez sur stop et c'est terminé.

source: If you will be making corrections to your mount's axis, you should select the adjustment approach (we're using Plate Solve in this example), and how often the system should recapture images to re-measure the polar alignment error. The refresh interval should be frequent, but it doesn't make sense to make it faster that your CPU can capture and plate-solve the images. We're using 2s in this example. Then press the <guibutton>Refresh</guibutton> button to begin the correction process.
fr: Si vous faites des corrections sur l'axe de votre monture, vous devriez choisir l'approche des ajustements (nous utilisons la résolution dans cet exemple) et précisez le rythme d'acquisition des images pour les mesures d'erreur de l'alignement polaire. L'intervalle de rafraîchissement devrait être fréquent mais il ne fait pas de sens de le rendre plus rapide que ce que le processeur est capable de faire pour les acquisitions et la résolution des images. Nous utilisons un intervalle de 2 secondes dans cet exemple. Ensuite cliquez sur le bouton <guibutton>Rafraîchissement</guibutton> pour démarrer la procédure de correction.

source: The system will capture images, and re-estimate the polar alignment error after each image. You can try to reduce the error by adjusting the Altitude and Azimuth correction knobs on your mount. The image below shows the screen after the altitude error has been almost zeroed. See the difference between the <emphasis>Measured Error</emphasis> row, which shows the originally measured error after the original 3 captures, and the <emphasis>Updated Error</emphasis> row which shows the current error estimate.
fr: Le système procédera à l'acquisition des images, puis ré-estimera l'erreur d'alignement polaire après chaque image. Vous pouvez essayer de diminuer ces erreurs en ajustant les molettes d'altitude et d'azimut de la monture. L'image ci-dessous montre l'écran après que l'erreur en altitude ait été réduite quasiment à zéro. Observez la différence sur la ligne <emphasis>Erreur mesurée</emphasis> qui montre l'erreur mesurée de départ après l'acquisition de trois images et la ligne de l'<emphasis>erreur mise à jour</emphasis> qui montre l'estimation de l'erreur actuelle.

source: Polar Alignment Assistant, Plate Solve Workflow 2
fr: Assistant d'alignement polaire, flux de travail 2 de la résolution

source: Below the user has also adjust Azimuth to reduce the error further. Now the error is very low and the process is done. The user should press the stop button.
fr: Ci-dessous, l'opérateur a aussi ajusté l'azimut afin de réduire encore plus l'erreur. Elle est maintenant très petite et la procédure est terminée. L'opérateur doit cliquer sur le bouton stop.

source: Polar Alignment Assistant, Plate Solve Workflow 3
fr: Assistant d'alignement polaire, flux de travail 3 de la résolution

source: Move Star Correction Scheme
fr: Schéma de correction de déplacement d'étoile

source: We also have an alternative schemes for correcting polar alignment. Two variations are <emphasis>Move Star &amp; Calc Error</emphasis> and <emphasis>Move Star</emphasis>. When you select this scheme, the system place a yellow/green/violet triangle on the screen. The triangle can be moved by clicking near a star, and the yellow/violet corner is moved to that star. In this scheme the user corrects polar alignment by first adjusting the mount's azimuth knob so that the selected star moves along the yellow side of the triangle. Once the star is near the next vertex, the azimuth knob should be adjusted so that the star moves along the green side of the triangle. Once the star is moved to the green/violet vertex, the mount is polar aligned, and the user can click <emphasis>stop</emphasis>.
fr: Il existe un schéma alternatif pour corriger les erreurs d'alignement polaire. Les deux variations sont <emphasis>Déplacement d'étoile &amp; Calcul d'erreur</emphasis> et <emphasis>Déplacement d'étoile</emphasis>. En choisissant ce schéma, le système place un triangle jaune/vert/violet sur l'écran. Il peut être déplacé en cliquant près d'une étoile et le coin jaune/violet se déplace vers cette étoile. L'utilisateur corrige les erreurs d'alignement polaire en ajustant d'abord l'azimut de la monture afin que l'étoile sélectionnée se déplace le long du côté jaune du triangle. Une fois que l'étoile se trouve près du prochain sommet, l'azimut doit être ajusté pour l'étoile se déplace le long du côté vert du triangle. Une fois que l'étoile est sur le sommet vert/violet, la monture est alignée sur la polaire et l'opérateur peut cliquer sur le bouton <emphasis>stop</emphasis>.

source: The difference between <emphasis>Move Star &amp; Calc Error</emphasis> and <emphasis>Move Star</emphasis> is that in the former, the system attempts to track the star the user has selected, and places a circle around that star. In that scheme it also attempts to update the <emphasis>Updated Err</emphasis> row. If the star tracking isn't reliable, simply ignore it or use the <emphasis> Move Star </emphasis>scheme and move the star by-eye until it's close to the final target. An example of using this technique is shown in this video: <ulink url="https://www.youtube.com/watch?v=iOp7hrxw0oU">https://www.youtube.com/watch?v=iOp7hrxw0oU</ulink>
fr: La différence entre les deux méthodes réside dans le fait que dans la première le système tente de suivre l'étoile sélectionnée et place un cercle autour d'elle. Il tente également de mettre à jour la ligne <emphasis>Erreur mise à jour</emphasis>. Si le suivi de l'étoile n'est pas fiable, ignorez-le simplement ou utiliser le schéma <emphasis>Déplacement d'étoile</emphasis> et déplacez l'étoile visuellement jusqu'à ce qu'elle est près de la cible finale. Un exemple d'utilisation de cette technique est montré dans cette vidéo : <ulink url="https://www.youtube.com/watch?v=iOp7hrxw0oU">https://www.youtube.com/watch?v=iOp7hrxw0oU</ulink>.
