Repository: gstax/kstars_trad_fr
Catalog: */docmessages/kstars/kstars_commands.po
Languages: fr

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Geographic...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Configuration</guimenu> <guimenuitem> Position géographique…</guimenuitem>

source: Select a new <link linkend="setgeo">geographic location</link>.
fr: Permet de choisir une nouvelle <link linkend="setgeo">position géographique</link>

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Keyboard Shortcuts...</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer les raccourcis clavier…</guimenuitem>

source: Open the Configure Shortcuts window which allows you to modify &kstars; shortcuts. You can use &kstars; default shortcuts scheme or define your own shortcuts scheme. In order to add a new custom shortcut to an action, you need to click on action's name and then press the <guibutton>Custom:</guibutton> checkbox. Then click on the button next to <guibutton>Custom:</guibutton> checkbox and enter the shortcut you would like to use in &kstars;. You can also remove a shortcut by pressing the <guibutton>Delete</guibutton> button after you select an action from the list. &kstars; helps you to find an action by providing its search method; just enter the name of the action and the list will be reduced to its best matches. For example, I will give you a brief example on how to use &kstars; Configure Shortcuts feature:
fr: Ouvrir la fenêtre de configuration des raccourcis clavier pour modifier les raccourcis dans &kstars;. Vous pouvez utiliser le schéma de raccourci par défaut de &kstars; ou définir votre propre schéma de raccourcis. Afin d'ajouter un nouveau raccourci personnalisé à une action, vous devez cliquer sur le nom d'une action et ensuite cliquer sur la case à cocher <guibutton>Personnaliser</guibutton>. Ensuite cliquez sur le bouton à côté de <guibutton>Personnaliser</guibutton> et saisissez le raccourci que vous souhaitez utiliser dans &kstars;. Vous pouvez supprimer un raccourci en cliquant sur le bouton <guibutton>Supprimer</guibutton> après avoir choisi une action dans la liste. &kstars; vous aide à trouver une action en fournissant une méthode de recherche ; il suffit d'indiquer le nom de l'action pour réduire la liste aux meilleures correspondances. Par exemple, je vais vous donner un bref exemple sur la manière d'utiliser la fonctionnalité de configuration des raccourcis de &kstars; :

source: Firstly, open the Configure Shortcuts window from the <guimenu>Settings</guimenu> menu.
fr: Veuillez d'abord ouvrir la fenêtre de configuration des raccourcis depuis le menu de <guimenu>Configuration</guimenu>.

source: Then select the action you would like to add a shortcut (&ie; Artificial Horizon). You can use the search method provided by &kstars;. Just type <quote>art</quote> in the search text box and the list will be reduced to only four actions. The Artificial Horizon is the first action in the list.
fr: Ensuite, sélectionnez l'action à laquelle vous souhaitez rattacher un raccourci (c'est-à-dire horizon artificiel). Vous pouvez utiliser la méthode de recherche fournie par &kstars;. Veuillez simplement saisir <quote>art</quote> et la liste sera réduite à seulement trois actions. L'horizon artificiel est la dernière des trois dans la liste.

source: Now that you find your desired action, you can add a new shortcut by clicking on its name. After you click on the action name, press the <guibutton>Custom</guibutton> checkbox. There is a button next to <guibutton>Custom</guibutton> checkbox used for adding new shortcuts. By default, if an action has no custom shortcut, the <quote>None</quote> tag will be assigned to this button. Press this button and then add your custom shortcut. For example, for Artificial Horizon, you can use &Ctrl;+H shortcut. Hold the &Ctrl; key and press H. Your shortcut be automatically saved, thus you can use it next time when you open &kstars;.
fr: Maintenant que vous avez trouvé l'action souhaitée, vous pouvez ajouter un nouveau raccourci en cliquant sur son nom. Après avoir cliqué sur le nom de l'action, choisissez <guibutton>Personnaliser</guibutton>. Il y a un bouton juste à côté de ce bouton <guibutton>Personnaliser</guibutton> utilisé pour ajouter de nouveaux raccourcis. Par défaut, si une action n'a aucun raccourci personnalisé, le choix <quote>Aucun</quote> sera assigné à ce bouton. Cliquez sur ce bouton et ajoutez ensuite votre raccourci personnalisé. Dans notre exemple pour l'horizon artificiel, vous pouvez utiliser le raccourci &Ctrl;+H. Gardez enfoncé la touche &Ctrl; et appuyez sur H. Ce raccourci sera automatiquement enregistré et vous pourrez ainsi l'utiliser la prochaine fois que vous lancerez &kstars;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer &kstars;…</guimenuitem>

source: Modify <link linkend="config">configuration options</link>.
fr: Permet de modifier les <link linkend="config">options de configuration</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Startup Wizard...</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Démarrer l'assistant…</guimenuitem>

source: Shows the <guilabel>Setup Wizard</guilabel> dialog. It is the same window that you saw when you ran &kstars; for the very first time. &kstars; Setup Wizard will help you set up some basic options, such as your location on Earth. The first page of Setup Wizard is a welcome page and if you press <guibutton>Next</guibutton> button, you will get the <guilabel>Choose Your Home Location</guilabel> page. Here you can select your exact home location or a city near your home location if your accurate location is not present in &kstars; cities database. Browsing the entire list is not so efficient and thus, &kstars; provides you a easy-to-use method for selecting your desired city in a short time. You may filter the list of cities by the name of your city, province and country. By giving more details about your location, the list's size will reduced only to its best matches. When you highlight a city in the cities list, the <guilabel>Longitude:</guilabel> and <guilabel>Latitude:</guilabel> boxes will be updated, containing the accurate information of your selected location. When you hit the <guibutton>Next</guibutton> button, you will get the last page of &kstars; Setup Wizard: <quote>Download Extra Data Files</quote> page. Here you may download optional data files via the Internet, in order to enhance &kstars;, such as Messier object images, or a more complete NGC/IC catalog. Press the <guibutton>Download Extra Data...</guibutton> button to proceed. After you pressed this button, the <guilabel>Get Hot New Stuff</guilabel> dialog will appear. It is &kstars; Add-On Installer, which will help you to manage what extra information you added to &kstars;. Firstly, you can choose how the add-ons list is displayed, by pressing the <guibutton>Details view mode</guibutton> or <guibutton>Icons view mode</guibutton> button. You may also order the list by various criteria like: newest, rating, most downloads or installed. This can be easily done by selecting an option using the radio button. You can also make searches using the <guilabel>Search:</guilabel> text box. Regarding the list of add-ons, you may perform several actions by selecting an add-on from the list: you can install or uninstall an add-on using the <guibutton>Install</guibutton> / <guibutton>Uninstall</guibutton> button, you can open the Details window using the <guibutton>Details</guibutton> button or you can rate an add-on by giving a number of gold stars, up to five stars. If you want to send an email to the author of an add-on, you are able to do that by clicking on his e-mail address. Then, your default e-mail application will guide you through the sending process. After you managed your &kstars; add-ons, then you can close the window by pressing the <guibutton>Close</guibutton> button. You can also use the Download Extra Data Files tool later, by selecting the <menuchoice><guimenu>Data</guimenu> <guimenuitem>Download New Data...</guimenuitem></menuchoice> menu item.
fr: Affiche l'<guilabel>Assistants de configuration</guilabel>. C'est la même fenêtre que vous avez vu lorsque vous avez lancé &kstars; pour la première fois. Cet assistant vous aidera à régler les options de base telles que votre position sur Terre. La première page de cet assistant est une page de bienvenue et si vous cliquez sur <guibutton>Suivant</guibutton> vous tomberez sur la page <guilabel>Sélectionner votre position actuelle</guilabel>. Vous pouvez choisir ici votre position actuelle exact ou une ville proche si votre position précise ne se trouve pas dans la base de données de villes de &kstars;. Parcourir la liste entière n'est pas très efficace et donc &kstars; fournit une méthode facile à utiliser pour choisir une ville rapidement. Vous pouvez ainsi filtrer la liste de villes par ville, département et pays. En donnant davantage de détails, la liste sera réduite aux meilleures correspondances. Quand vous surlignez une ville dans cette liste, les boîtes de <guilabel>Latitude</guilabel> et <guilabel>Longitude</guilabel> seront mises à jour avec les coordonnées exacte de la position sélectionnée. En cliquant sur le bouton <guibutton>Suivant</guibutton>, vous irez sur la dernière page de l'assistant de configuration de &kstars; : <quote>Télécharger des données supplémentaires</quote>. Ici, vous pourrez télécharger via Internet des fichiers de données optionnels afin d'améliorer &kstars;, telles que des images des objets Messier ou encore un catalogue NGC/IC plus complet. Cliquez sur le bouton <guibutton>Télécharger des données supplémentaires</guibutton> pour commencer. Après avoir cliqué sur ce bouton, la fenêtre <guilabel>Obtenir les dernières nouveautés</guilabel> apparaîtra. C'est l'installateur d'extensions de &kstars; qui vous aidera à gérer l'information supplémentaire que vous avez ajouté à &kstars;. Vous pouvez d'abord choisir le type d'affichage de la liste d'extensions en cliquant sur le bouton <guibutton>Mode d'affichage détaillé</guibutton> ou <guibutton>Mode d'affichage des icônes</guibutton>. Vous pouvez aussi trier la liste selon différents critères comme le plus récent, la notation, le plus téléchargé ou installé. Cela peut être réalisé facilement en sélectionnant une option avec le bouton radio. Vous pouvez aussi effectuer des recherches en utilisant le champ texte <guilabel>Recherche</guilabel>. En ce qui concerne la liste des extensions, vous pouvez agir de différentes manières en sélectionnant une extension de la liste. Vous pouvez installer ou désinstaller une extension en utilisant le bouton <guibutton>Installer/Désinstaller</guibutton>, vous pouvez ouvrir une fenêtre détaillées en utilisant le bouton <guibutton>Détails</guibutton> ou vous pouvez évaluer cette extension en donnant un nombre d'étoiles dorées, jusqu'à cinq. Si vous souhaitez envoyer un courriel à l'auteur d'une extension, vous pouvez le faire en cliquant sur son courriel. Ensuite votre client de messagerie par défaut vous guidera dans le processus d'envoi. Après avoir géré vos extensions de &kstars;, vous pouvez fermer la fenêtre en cliquant sur le bouton <guibutton>Fermer</guibutton>. Vous pouvez aussi utiliser l'outil de téléchargement de données supplémentaires plus tard en choisissant <menuchoice><guimenu>Données</guimenu> <guimenuitem>Télécharger de nouvelles données…</guimenuitem></menuchoice>.

source: Additionally &kstars; has the common &kde; <guimenu>Settings</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/menus.html#menus-settings">Settings Menu</ulink> of the &kde; Fundamentals.
fr: &kstars; possède additionnellement les menus courants de <guimenu>Configuration</guimenu> de &kde;. Pour davantage d'informations, veuillez lire les sections concernant les <ulink url="help:/fundamentals/menus.html#menus-settings">Menus de configuration</ulink> dans les indispensables de &kde;.

source: Help Menu
fr: Menu Aide

source: &kstars; has the common &kde; <guimenu>Help</guimenu> menu items, for more information read the section about the <ulink url="help:/fundamentals/menus.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
fr: &kstars; possède le menu <guilabel>Aide</guilabel> courant de &kde;. Pour davantage d'informations, veuillez lire la section concernant le menu <ulink url="help:/fundamentals/menus.html#menus-help">Aide</ulink> des Indispensables de &kde;.

source: <title>Popup Menu</title>
fr: <title>Menu contextuel</title>

source: <primary>Popup Menu</primary>
fr: <primary>Menu contextuel</primary>

source: The <mousebutton>right</mousebutton> click popup menu is context-sensitive, meaning its content varies depending on what kind of object you click on. We list all possible popup menu items here, with the relevant object type [in brackets].
fr: Le menu sur un clic avec le bouton <mousebutton>droit</mousebutton> de la souris est contextuel : il varie selon le type d'objet cliqué. Nous listons tous les éléments des menus contextuels ici avec l'objet associé entre [crochets].

source: [All]
fr: [Tous]

source: Identification and quick info: The top several lines are devoted to the name(s) of the object, its type and the constellation in which it lies. The magnitude is shown with the superscript 'm' if it is available. For stars, the Spectral Type is also shown here. For deep-sky objects, the dimensions, if known, are shown in arcminutes (eg: 6'×3') and the source catalog is also shown.
fr: Identification et info rapide : les premières lignes sont dévolues au(x) nom(s) de l'objet, son type et la constellation dans laquelle il se trouve. La magnitude est indiquée avec l'exposant <quote>m</quote> si disponible. Pour les étoiles, le type spectral est aussi montré ici. Pour les objets du ciel profond, la dimension, si connue, est indiquée en minutes d'arc (c'est-à-dire 6'x3') et le catalogue de la source est aussi montré.

source: Rise, Transit, and Set times for the object on the current simulation date are shown on the next three lines.
fr: Les heures du lever et du coucher pour l'objet à la date de simulation courante sont affichées sur les trois lignes suivantes.

source: <guimenuitem>Center &amp; Track</guimenuitem>: Center the display on this location, and engage tracking. Equivalent to double-clicking.
fr: <guimenuitem>Centrer et Suivre</guimenuitem> : centre l'image sur cet endroit et suit cet objet. C'est équivalent à un double clic.

source: <guimenuitem>Add flag...</guimenuitem>: Open &kstars; <quote>Flag manager</quote> window. Here you can manage your flags and use some of &kstars; features. When <quote>Flag manager</quote> window is open for a selected object, <guilabel>Right ascension</guilabel> and <guilabel>Declination</guilabel> text boxes will be automatically filled with the coordinate values of the selected object on the Sky Map. Besides these two text boxes, you can set the <guilabel>Epoch</guilabel>, add a <guilabel>Label</guilabel>, set the <guilabel>Label color</guilabel> or even add an <guilabel>Icon</guilabel>. To add custom icons, just add images in <filename class="directory">`qtpaths --paths GenericDataLocation`/kstars/</filename>. File names must begin with the <quote>flag</quote> keyword. For example, the file <quote>flagSmall_red_cross.gif</quote> will be shown as Small red cross in the combo box. After you set up the information of the new flag, you can add it to the flags list using the <guibutton>Add</guibutton> button. You may also change flags details (&ie; RA/Dec, label or icon) and then save the new ones by pressing the <guibutton>Save changes</guibutton> button. Using the Flag manager, you can easily center an object in Map or in Telescope, by pressing <guibutton>Center in Map</guibutton> or <guibutton>Center in Telescope</guibutton> button. In order to delete a value from the list, just select it in the list and then press <guibutton>Delete</guibutton> button. Your flags are saved after you close current session and thus you will be able to see them everytime you will use &kstars; again.
fr: Fenêtre <guimenuitem>Ajouter drapeau</guimenuitem> : Ouvrir le <quote>Gestionnaire de drapeaux</quote>. Vous pouvez gérer ici vos drapeaux et utiliser quelques fonctionnalités de &kstars;. Quand la fenêtre de <quote>Gestionnaire de drapeaux</quote> est ouverte pour un objet sélectionné, les boîtes pour l'<guilabel>ascension droite</guilabel> et la <guilabel>déclinaison</guilabel> seront automatiquement remplies avec les coordonnées de l'objet sélectionné dans la carte du ciel. Outre ces deux boîtes, vous pouvez régler l<guilabel>Epoch</guilabel>, ajouter une <guilabel>étiquette</guilabel>, ajuster la <guilabel>couleur de l'étiquette</guilabel> et même ajouter une <guilabel>icône</guilabel>. Pour ajouter des icônes personnalisées, il suffit d'ajouter des images dans le dossier <filename class="directory">`qtpaths --paths GenericDataLocation`/kstars</filename>. Les noms de fichier doivent commencer par le mot-clé <quote>flag</quote>. Par exemple, le fichier <quote>flagSmall_red_cross.gif</quote> sera affiché comme « Small red cross » dans la boîte. Après avoir spécifié l'information du nouveau drapeau, vous pouvez l'ajouter à la liste de drapeaux en utilisant le bouton <guibutton>Ajouter</guibutton>. Vous pouvez aussi modifier les détails du drapeau (c'est-à-dire AD/DEC, l'étiquette ou l'icône) et ensuite les enregistrer avec le bouton <guibutton>Enregistrer les changements</guibutton>. Avec le gestionnaire de drapeaux, vous pouvez facilement centrer un objet dans la carte ou dans le télescope en cliquant sut le bouton <guibutton>Centrer sur la carte</guibutton> ou <guibutton>Centrer dans le télescope</guibutton>. Pour supprimer une entrée dans la liste, sélectionner le simplement dans la liste et cliquez sur le bouton <guibutton>Supprimer</guibutton>. Vos drapeaux sont enregistrés après la fermeture de la session et vous pourrez ainsi les voir chaque fois que vous ouvrirez &kstars; à nouveau.

source: <guimenuitem>Angular Distance To...</guimenuitem>: Enter "angular distance mode". In this mode, a dotted line is drawn from the first target object to the current mouse position. When you click with the &RMB; on a second object, this will display the angular distance between the two objects near the second object. You can press the &Esc; key to exit angular distance mode without measuring an angle.
fr: <guimenuitem>Distance angulaire à…</guimenuitem> : entre en <quote>mode distance angulaire</quote>. Dans ce mode, une ligne pointillée est dessinée depuis le premier objet ciblé vers la position courante de la souris. Quand vous invoquez le menu contextuel avec le bouton droite de la souris sur un second objet, cela affichera la distance angulaire entre deux objets à proximité du second objet. Vous pouvez actionner la touche <keycap>Échap</keycap> pour quitter le mode de distance angulaire sans mesurer d'angle.

source: <guimenuitem>Starhop from here to</guimenuitem>: will enable you to find a path between two points in the sky. Star hopping is a technique that uses bright stars as a guide for finding fainter objects. So if you have a bright star, you can use it as a reference to find a fainter object. Starting from your reference star, &kstars; will find a route to the destination, traversing a sequence of stars/patterns of stars. The object for which you called <guilabel>Starhop from here to</guilabel> tool will be your starting point. When your starting point is established, a dotted line will appear, allowing you to decide which will be your end point. You have to move the mouse cursor to your destination object position and right click on it. Then, a dialog box will pop up, requiring you to set the FOV used for star hopping. For selecting a FOV, you need to make a choice from the FOV combo box list of values. The values you can choose include default FOV values (7x35 Binoculars, Telrad, One Degree, HST WFPC2 and 30m at 1.3cm) plus your customized FOVs. After you selected the FOV, &kstars; will find a route for you. Thus, the dialog box will contain a list of object used in the starhop. If &kstars; did not manage to find a route, then an error dialog box will be displayed, giving you a helping hand. When the Star-Hopper algorithm ends, the dialog box will contain a list of objects used in starhop route. For every object from the list, you can perform a set of actions: you can ask for details using the <guibutton>Details</guibutton> button, center selected object in the map using <guibutton>Center on map</guibutton> button or you can go to next star by pressing the <guibutton>Next</guibutton> button. Note that when go to next star, it will be automatically centered on the map. Also, Star-Hopper tool provides directions to star hop for every object of the list.
fr: <guimenuitem>Saute-mouton astronomique depuis ici vers</guimenuitem> : vous permet de trouver un chemin entre deux points du ciel. Le saute-mouton astronomique est une technique qui utilise des étoiles brillantes comme guide pour trouver des étoiles plus faibles. Ainsi, si vous avez une étoile brillante, vous pouvez l'utiliser comme référence pour en trouver une plus faible. En commençant de cette étoile de référence, &kstars; trouvera un chemin vers la destination en passant par une séquence d'étoiles ou d'astérisme d'étoiles. L'objet à partir duquel vous avez lancé cet outil sera l'étoile de départ. Quand le premier point est établi, une ligne pointillée va apparaître vous permettant de décider quel sera le point d'arrivée. Vous devez déplacer le pointeur de la souris vers ce point d'arrivée et faire un clic droit sur lui. Ensuite, une boîte de dialogue apparaîtra où il faudra spécifier le champ de vue (FOV) à utiliser pour le saute-mouton. La sélection de champ de vue se fait parmi une liste de valeurs préétablie (jumelles 7x35, Telrad, Un degrés, HST WFPC2, 30m à 1,3cm, ainsi que vos propres champs de vue). Cette sélection faite, &kstars; trouvera une route pour vous et vous affichera une liste d'objets utilisée pour le saute-mouton. Si &kstars; ne parvient pas à trouver une route, une boîte de dialogue affichera une erreur qui vous aidera à corriger le problème. Quand l'algorithme de saute-mouton se termine, une boîte de dialogue contiendra une liste des objets utilisés pour la route. Pour chaque objet de cette liste, vous pouvez effectuer une série d'actions. Vous pouvez afficher des détails avec le bouton <guibutton>Détails</guibutton>, centrer l'objet sélectionné avec le bouton <guibutton>Centrer sur la carte</guibutton> ou aller à la prochaine étoile en cliquant sur le bouton <guibutton>Suivant</guibutton>. Veuillez noter que la prochaine étoile sera automatiquement centrée sur la carte. Cet outil fournit également des directions pour chaque objet de la liste.

source: <guimenuitem>Details</guimenuitem>: Open the <link linkend="tool-details">Object Details window</link> for this object.
fr: <guimenuitem>Détails</guimenuitem> : ouvre la <link linkend="tool-details">fenêtre de détails de l'objet</link> pour cet objet.

source: <guimenuitem>Attach Label</guimenuitem>: Attach a permanent name label to the object. If the object already has a label attached, this item will read <guilabel>Remove Label</guilabel>.
fr: <guimenuitem>Attacher une étiquette</guimenuitem> : attache une étiquette permanente à l'objet. Si l'objet a déjà une étiquette, cet élément sera <guilabel>Supprimer l'étiquette</guilabel>.
