Repository: gstax/kstars_trad_fr
Catalog: kstars_ekos-focus.po
Languages: fr

source: <emphasis role="bold">Bahtinov</emphasis>: This detection method can be used when using a Bahtinov mask for focusing. First take an image, then select the star to focus on. A new image will be taken and the diffraction pattern will be analysed. Three lines will be displayed on the diffraction pattern showing how well the pattern is recognized and how good the image is in focus. When the pattern is not well recognized, the 'Num. of rows' parameter can be adjusted to improve recognition. The line with the circles at each end is a magnified indicator for the focus. The shorter the line, the better the image is in focus.
fr: <emphasis role="bold">Bathinov</emphasis> : cette méthode de détection peut être utilisée quand un masque de Bathinov est utilisé pour la mise au point. Prenez d'abord une image, puis sélectionnez l'étoile sur laquelle faire la mise au point. Une nouvelle image sera prise et le motif de diffraction sera analysé. Trois lignes seront affichées sur le motif de diffraction montrant la qualité de la détection et de la mise au point. Quand le motif n'est pas bien détecté, le paramètre <quote>Nombre de lignes</quote> peut être ajusté pour améliorer la détection. La ligne avec les cercles aux deux bouts est un indicateur grossi pour la mise au point. Plus cette ligne est courte et meilleure sera la mise au point.

source: V-Curve
fr: Courbe en V

source: <screeninfo>Focus V-Curve</screeninfo>
fr: <screeninfo>Courbe en V de la mise au point</screeninfo>

source: <phrase>Focus V-Curve</phrase>
fr: <phrase>Courbe en V de la mise au point</phrase>

source: The V-shaped curve displays absolute position versus Half-Flux-Radius (HFR) values. The center of the V-curve is the optimal focus position. Once Ekos crosses from one side of the V-curve to the other, it backtracks and tries to find the optimal focus position. The final focus position is decided by which algorithm is selected.
fr: Le graphique de la courbe en V affiche le HFR selon la position absolue. Le centre de cette courbe représente la position optimale de la mise au point. Une fois qu'Ekos passe de l'autre côté de la courbe, il recule pour trouver la position optimale. La position finale de la mise au point dépend de l'algorithme choisi.

source: When framing, the horizontal axis denotes the frame number. This is to aid you in the framing process as you can see how HFR changes between frames.
fr: Lors d'acquisitions en boucle, l'axe horizontal représente le numéro de la trame. Cela peut vous aider dans ce processus puisque vous pouvez voir comment le HFR change au cours du processus.

source: Relative Profile
fr: Profil relatif

source: <screeninfo>Focus Relative Profile</screeninfo>
fr: <screeninfo>Profil relatif de la mise au point</screeninfo>

source: <phrase>Focus Relative Profile</phrase>
fr: <phrase>Profil relatif de la mise au point</phrase>

source: The relative profile is a graph that displays the relative HFR values plotted against each other. Lower HFR values correspond to narrower shapes and vice-versa. The solid red curve is the profile of the current HFR value, while the dotted green curve is for the previous HFR value. Finally, the magenta curve denotes the first measured HFR and is displayed when the autofocus process concludes. This enables you to judge how well the autofocus process improved the relative focus quality.
fr: Le profil relatif est un graphique qui représente les valeurs HFR affichées les unes contre les autres. Les valeurs basses de HFR correspondent à des formes plus étroites et inversement. La courbe en rouge plein représente le profil de la valeur HFR courante, alors que la courbe en vert pointillé représente la valeur précédente. Enfin, la courbe en magenta montre la première valeur HFR mesurée et est affichée quand la procédure de mise au point automatique est terminée. Ce graphique vous permet de juger de la qualité de la mise au point relative.
