Repository: gstax/kstars_trad_fr
Catalog: kstars_ekos-focus.po
Languages: fr

source: <title>Focus</title>
fr: <title>Mise au point</title>

source: Tools
fr: Outils

source: <tertiary>Focus</tertiary>
fr: <tertiary>Mise au point</tertiary>

source: Theory Of Operation
fr: Théorie de la procédure

source: <screeninfo>Ekos Focus</screeninfo>
fr: <screeninfo>Mise au point Ekos</screeninfo>

source: <phrase>Ekos Focus</phrase>
fr: <phrase>Mise au point Ekos</phrase>

source: In order to focus an image, Ekos needs to establish a numerical method for gauging how <emphasis>good</emphasis> your focus is. It's easy when you look at an image and can see it as <emphasis>unfocused</emphasis>, as the human is very good at detecting that, but <emphasis>how</emphasis> can Ekos possibly know that?
fr: Afin de faire la mise au point d'une image, Ekos a besoin d'établir une méthode numérique pour juger la <emphasis>valeur</emphasis> de votre mise au point. Il est très facile pour un humain d'estimer si une image n'est pas <emphasis>nette</emphasis>, mais <emphasis>comment</emphasis> est-ce qu'Ekos peut le savoir ?

source: There are multiple methods. One is to calculate the Full Width at Half Maximum (FHWM) of a star profile within an image, and then adjust the focus until an optimal (narrower) FWHM is reached. The problem with FWHM is that it assumes the initial focus position to be close to the critical focus. Additionally, FWHM does not perform very well under low-intensity fluxes. An Alternative method is Half-Flux-Radius (HFR), which is a measure of the width in pixels counting from the center of the stars until the accumulated intensity is half of the total flux of the star. HFR proved to be much more stable in conditions where you might have unfavorable sky conditions, when the brightness profile of the stars is low, and when the starting position of the focus is far from the optimal focus.
fr: Il existe plusieurs méthodes. L'une d'entre elles est de calculer la largeur complète à la moitié de la hauteur (FWHM ou Full Width at Half Maximum) du profil d'une étoile de l'image et ensuite ajuster la mise au point jusqu'à minimiser cette valeur. Le problème avec cette méthode est qu'elle suppose que la position initiale de mise au point est proche de la mise au point optimale. De plus, elle ne se comporte pas très bien pour des flux très faibles. Une méthode alternative est le HFR (Half-Flux-Radius) qui mesure la largeur en pixels en comptant du centre de l'étoile jusqu'à ce que la valeur accumulée de l'intensité vaut la moitié du flux total de l'étoile. Cette méthode est bien plus stable dans des conditions de ciel défavorables et quand le profil de luminosité des étoiles est faible ou encore quand la position de départ de la mise au point est éloignée de la position optimale.

source: After Ekos processes an image, it selects the brightest star and starts measuring its HFR. It can automatically select the star, or you can select the star manually. It is usually recommended to select stars that are not too bright as they might get saturated during the focusing process. A magnitude 3 or 4 star is often sufficient.
fr: Après qu'Ekos ait traité une image, il sélectionne l'étoile la plus brillante et commence à mesurer son HFR. Il peut sélectionner une étoile automatiquement ou vous pouvez lui indiquer quelle étoile utiliser. Il est en général recommandé de sélectionner des étoiles pas trop brillantes car elles risqueraient d'être saturées durant la procédure de mise au point. Une magnitude d'étoile de 3 ou 4 est souvent suffisante.

source: Ekos then begins the focusing process by commanding the focuser to focus inwards or outwards, and re-measures the HFR. This establishes a V-shaped curve in which the sweet spot of optimal focus is at the center of the V-curve, and the slope of which depends on the properties of the telescope and camera in use. In Ekos, a full V-curve is never constructed as the focusing process works iteratively, so under most circumstances, a half V-curve shape as illustrated in the Focus Module image is measured.
fr: Ekos commence ensuite la procédure de mise en point en indiquant au moteur de mise au point de faire la mise au point vers l'intérieur et vers l'extérieur et de mesurer à nouveau le HFR. Ce processus itératif produit une courbe en V dont le centre correspond à la position de mise au point optimale et dont la pente dépend des propriétés du télescope et de la caméra. Dans Ekos, une courbe en V complète n'est jamais construite puisque la procédure de mise au point fonctionne de manière itérative et que la plupart du temps, une demi courbe en V est mesurée, comme illustrée dans l'image du module de mise au point.

source: Because the HFR varies linearly with focus distance, it is possible to calculate the optimal focus point. In practice, Ekos operates iteratively by moving in discrete steps, decided initially by the user-configurable step size and later by the slope of the V-curve, to get closer to the optimal focus position where it then changes gears and performs smaller, finer moves to reach the optimal focus. In the default <guilabel>Iterative</guilabel> algorithm, the focus process stops when the measured HFR is within the configurable tolerance of the minimum recorded HFR in the process. In other words, whenever the process starts searching for a solution within a narrowly limited range, it checks if the current HFR is within % difference compared to the minimum HFR recorded, and if this condition is met then the autofocus process is considered successful. The default value is set to 1% and is sufficient for most situations. The <guilabel>Step</guilabel> options specify the number of <emphasis>initial</emphasis> ticks the focuser has to move. If the image is severely out of focus, we set the step size high (&ie; &gt; 250). On the other hand, if the focus is close to optimal focus, we set the step size to a more reasonable range (&lt; 50). It takes trial and error to find the best starting tick, but Ekos only uses that for the first focus motion, as all subsequent motions depend on the V-Curve slope calculations.
fr: La valeur variant linéairement avec la distance de mise au point, il est possible de calculer la valeur optimale de la position de mise au point. Dans la pratique, Ekos fonctionne de manière itérative en déplaçant le moteur de mise au point par pas discrets dont la valeur a été décidée initialement par l'utilisateur et ensuite par la valeur de la pente de la courbe en V, afin de s'approcher de plus en plus de la position optimale et enfin en réduisant le nombre de pas lorsque la solution optimale est proche. Avec l'algorithme <guilabel>Itératif</guilabel> par défaut, la procédure s'arrête quand la valeur HFR mesurée se trouve dans une plage de tolérance prédéfinie. En d'autres termes, quand la procédure commence à chercher une solution dans cette plage de tolérance, elle vérifie si la valeur courante du HFR est % de différence comparée à la valeur HFR minimale mesurée et si c'est le cas, la procédure est réputée réussie. La valeur par défaut est 1% et est suffisante dans la plupart des situations. L'option <guilabel>Pas</guilabel> spécifie le nombre <guilabel>initial</guilabel> de pas pour le mouvement du moteur de mise au point. Si l'image est très loin de la mise au point optimale, on règle la taille des pas à une grande valeur (&cad; &gt; 250). Sinon, on peut réduire cette valeur (&lt; 50). Il faut procéder par tâtonnements pour trouver la meilleure valeur de départ, mais Ekos ne l'utilise que pour le premier mouvement de mise au point, les mouvements des suivantes dépendant des calculs de la pente de la courbe en V.

source: When using the <guilabel>Polynomial</guilabel> algorithm, the process starts in the <guilabel>Iterative</guilabel> mode, but once we cross to the other side of the V-curve (&ie; once HFR values start increasing again after decreasing for a while), the Ekos performs polynomial fitting to find a solution that predicts the minimum possible HFR position. If a valid solution is found, the autofocus process is considered successful.
fr: Quand l'algorithme <guilabel>Polynomial</guilabel> est utilisé, la procédure débute en mode <guilabel>Itératif</guilabel> mais une fois que l'on franchit l'autre côté de la courbe en V (&cad; quand les valeurs HFR recommencent d'augmenter après avoir diminué pour un moment), Ekos commence un calcul d'interpolation polynomial afin de trouver une solution qui prédit la position HFR minimale. Si une solution valable est trouvée, la procédure de mise au point est réputée réussie.

source: While Ekos Focus Module supports relative focusers, it is <emphasis role="bold">highly recommended</emphasis> to use absolute focusers.
fr: Bien que le module de mise au point d'Ekos gère les moteurs de mise au point à position relative, il est <emphasis role="bold">hautement recommandé</emphasis> d'utiliser des moteurs de mise au point à position absolue.

source: Focuser Group
fr: Moteur de mise au point

source: <screeninfo>Focuser Settings</screeninfo>
fr: <screeninfo>Réglages du moteur de mise au point</screeninfo>

source: <phrase>Focuser Settings</phrase>
fr: <phrase>Réglages du moteur de mise au point</phrase>

source: Any INDI-compatible focuser is supported. It is recommended to use <emphasis role="bold">absolute</emphasis> focusers since their absolute position is known on power up. In INDI, the focuser <emphasis>zero</emphasis> position is when the drawtube is <emphasis role="bold">fully retracted</emphasis>. When focusing <emphasis>outwards</emphasis>, the focuser position increases, while it decreases when focusing <emphasis>inwards</emphasis>. The following focuser types are supported:
fr: Tout moteur de mise au point compatible INDI est géré. Il est recommandé d'utiliser des moteurs de mise au point à position <emphasis role="bold">absolue</emphasis> puisque leur position absolue est connue à l'allumage. Dans INDI, la position <emphasis>zéro</emphasis> du moteur de mise au point correspond à un tube <emphasis role="bold">complètement rentré</emphasis>. Quand la mise au point se fait vers l'extérieur, la position du moteur de mise au point augmente et inversement. Les types suivants de moteurs de mise au point sont gérés :

source: <emphasis role="bold">Absolute</emphasis>: Absolute Position Focusers such as RoboFocus, MoonLite, &etc;
fr: <emphasis role="bold">Position absolue</emphasis> : moteurs de mise au point à position absolue tels que RoboFocus, Moonlite, &etc;

source: <emphasis role="bold">Relative</emphasis>: Relative Position Focusers.
fr: <emphasis role="bold">Position relative</emphasis> : moteur de mise au point à position relative.

source: <emphasis role="bold">Simple Focusers</emphasis>: DC/PWM focusers with no position feedback.
fr: <emphasis role="bold">Simple</emphasis> : moteurs de mise au point DC/PWM avec aucun retour de position.

source: For absolute focusers, you can set the ticks count. To view a continuous feed of the camera, click the <guibutton>Framing</guibutton> button. An image shall be captured repeatedly according to the CCD settings in the <guilabel>CCD and Filter Wheel</guilabel> group. You can focus in and out by pressing the respective buttons, and each shall move by the step size indicated in the focus settings. For absolute and relative focusers, the step size is in units of <emphasis>ticks</emphasis> and for simple DC focusers, the step size is in <emphasis>milliseconds</emphasis>.
fr: Pour les moteurs de mise au point à position absolue, vous pouvez régler le comptage des pas. Pour avoir une visualisation en continu de la caméra, cliquez sur le bouton <guibutton>En boucle</guibutton>. Une image sera prise régulièrement selon les réglages du groupe <guilabel>CCD et roue à filtres</guilabel>. Vous pouvez mettre au point en avant ou en arrière en utilisant les boutons respectifs et chacun fera bouger d'un certain nombre de pas en fonction de ce qui a été configuré dans les réglages de la mise au point. Pour les moteurs de mise au point à position relative et absolue, la taille du pas est mesurée en <emphasis>cran</emphasis> et pour les moteurs de mise au point DC simple, il est mesuré en <emphasis>millisecondes</emphasis>.

source: To begin the autofocus process, simply click the <guibutton>Auto Focus</guibutton> button.
fr: Pour débuter la procédure de mise au point automatique, cliquez simplement sur le bouton <guibutton>Démarrer</guibutton>.

source: CCD &amp; Filter Wheel Group
fr: CCD &amp; roue à filtres

source: <screeninfo>Focus CCD &amp; Filter Wheel Group</screeninfo>
fr: <screeninfo>Mise au point CCD &amp; roue à filtres</screeninfo>

source: <phrase>Focus CCD &amp; Filter Wheel Group</phrase>
fr: <phrase>Mise au point CCD &amp; roue à filtres</phrase>

source: You must specify the CCD and Filter Wheel (if any) to be used during the focusing process. You can <emphasis role="bold">lock</emphasis> a specific filter within the filter wheel to be utilized whenever the autofocus process is invoked. Usually, the user should select the Clear/Luminescence filter for this purpose so that Ekos always uses the same filter to perform the autofocus process. This locked filter is also used in the <link linkend="ekos-align">Alignment Module</link> whenever it performs any astrometry capture.
fr: Vous devez spécifier le CCD et la roue à filtres (si vous en avez une) à utiliser pour la procédure de mise au point automatique. Vous pouvez <emphasis role="bold">verrouiller</emphasis> un filtre spécifique de la roue à filtres chaque fois que la procédure de mise au point automatique est invoquée. Généralement, l'utilisateur devrait choisir le filtre Clair/Luminance pour cet usage pour qu'Ekos puisse toujours utiliser le même filtre pour cette procédure. Ce filtre verrouillé est également utilisé pour le module <link linkend="ekos-align">Alignement</link> pour les acquisitions d'astrométrie.

source: You may also select an <guilabel>Effect</guilabel> filter to enhance the image for preview purposes. It is highly advisable to turn off any effects during the focusing process as it may interfere with HFR calculations. For DSLRs cameras, you can change the ISO settings. You may reset the focusing subframe to full frame capture if you click the <guibutton>Reset</guibutton> button.
fr: Vous pouvez aussi choisir un filtre <guilabel>Effets</guilabel> pour améliorer l'image pour les aperçus. Il est grandement conseillé d'éteindre tout effet durant la procédure de mise au point automatique puisqu'il risque d'interférer avec les calculs de HFR. Pour les APN, vous pouvez modifier les réglages d'ISO. Vous pouvez réinitialiser les sous-trames de mise au point à des acquisitions plein format en cliquant sur le bouton <guibutton>Réinitialiser</guibutton>.

source: Settings
fr: Réglages

source: <screeninfo>Focus Settings</screeninfo>
fr: <screeninfo>Réglages de la mise au point</screeninfo>

source: <phrase>Focus Settings</phrase>
fr: <phrase>Réglages de la mise au point</phrase>

source: You may need to adjust focus settings in order to achieve a successful and reliable autofocus process. The settings are retained between sessions.
fr: Il peut être nécessaire d'ajuster les réglages de mise au point pour réaliser une procédure de mise au point automatique réussie et fiable. Les réglages sont conservés entre les sessions.

source: <emphasis role="bold">Auto Star Select</emphasis>: Automatically select the best focus star from the image.
fr: <emphasis role="bold">Sélection automatique d'étoile</emphasis> : sélectionner automatiquement la meilleure étoile de mise au point de l'image.

source: <emphasis role="bold">Subframe</emphasis>: Subframe around the focus star during the autofocus procedure. Enabling subframing can significantly speed up the focus process.
fr: <emphasis role="bold">Sous-trame</emphasis> : sous-trame autour de l'étoile à mettre au point durant la procédure de mise au point automatique. L'activation de cette option peut accélérer de manière significative la procédure.

source: <emphasis role="bold">Dark Frame</emphasis>: Check this option to capture a dark frame if necessary and perform dark-frame subtraction. This option can be useful in noisy images.
fr: <emphasis role="bold">Image Dark</emphasis> : cochez cette option pour l'acquisition d'image Dark si nécessaire et réaliser une soustraction de cette image Dark.

source: <emphasis role="bold">Suspend Guiding</emphasis>: Suspend Guiding while autofocus in progress. If the focus process can disrupt the guide star (&eg; when using Integrated Guide Port IGP whereas the guider is physically attached to the primary CCD), then it is recommended to enable this option. When using Off-Axis guider, then this option is not necessary.
fr: <emphasis role="bold">Suspendre le guidage</emphasis> : suspend le guidage pendant que la mise au point automatique est en cours. Si la procédure de mise au point peut perturber l'étoile guide (&cad; lors de l'utilisation du port guide intégré IGP où le guide est physiquement attaché au CCD primaire), alors il est recommandé d'activer cette option. Elle n'est cependant pas nécessaire pour les guides hors axe (OAG).

source: <emphasis role="bold">Box size</emphasis>: Sets the box size used to enclose the focus star. Increase if you have very large stars. For Bahtinov focus the box size can be increased even more to better enclose the Bahtinov diffraction pattern.
fr: <emphasis role="bold">Taille de la boîte</emphasis> : règle la taille de la boîte qui délimite l'étoile de mise au point. Augmentez si vous avez de très grosses étoiles, Pour la mise au point avec un masque de Bathinov, vous pouvez encore plus l'augmenter pour inclure les motifs de diffraction.

source: <emphasis role="bold">Max Travel</emphasis>: Maximum travel in ticks before the autofocus process aborts.
fr: <emphasis role="bold">Déplacement maximum</emphasis> : déplacement maximum en cran avant que la procédure de mise au point automatique ne s'arrête.

source: <emphasis role="bold">Step</emphasis>: <emphasis>Initial</emphasis> step size in ticks to cause a noticeable change in HFR value. For timer-based focuser, it is the initial time in milliseconds to move the focuser inward or outward.
fr: <emphasis role="bold">Pas</emphasis> : taille <emphasis>initiale</emphasis> de pas en cran pour causer un changement notable de la valeur HFR. Pour les moteurs de mise au point simple fondé sur le temps, cela correspond au temps en millisecondes pour déplacer le moteur de mise au point vers l'avant ou vers l'arrière.

source: <emphasis role="bold">Tolerance</emphasis>: The tolerance percentage values decides when the autofocus process stops in the <guilabel>Iterative</guilabel> algorithm. During the autofocus process, HFR values are recorded, and once the focuser is close to an optimal position, it starts measuring HFRs against the minimum recorded HFR in the sessions and stops whenever a measured HFR value is within % difference of the minimum recorded HFR. Decrease value to narrow optimal focus point solution radius. Increase to expand solution radius.
fr: <emphasis role="bold">Tolérance</emphasis> : le pourcentage de tolérance est le critère d'arrêt de la procédure de mise au point automatique pour l'algorithme <guilabel>Itératif</guilabel>. Durant cette procédure, les valeurs HFR sont enregistrées et une fois que le moteur de mise au point est proche de la position optimale, il compare les HFR aux valeurs de HFR minimales et s'arrête dès qu'une valeur HFR est dans cette plage de tolérance. Diminuez cette valeur pour restreindre le rayon de la solution et inversement.

source: Setting the value too low might result in a repetitive loop and would most likely result in a failed autofocus process.
fr: Veuillez noter que si cette valeur est trop faible, il est possible que l'algorithme entre dans une boucle qui fera échouer la procédure de mise au point automatique.

source: <emphasis role="bold">Threshold</emphasis>: Threshold percentage value is used for star detection using the <emphasis>Threshold</emphasis> detection algorithm. Increase to restrict the centroid to bright cores. Decrease to enclose fuzzy stars.
fr: <emphasis role="bold">Seuil</emphasis> : la valeur en pourcentage du seuil est utilisée pour détecter les étoiles pour l'algorithme de détection <emphasis>Seuil</emphasis>. Augmentez cette valeur pour restreindre le centroïde aux cœurs brillants. Diminuez-là pour inclure les étoiles floues.

source: <emphasis role="bold">Algorithm</emphasis>: Select the autofocus process algorithm:
fr: <emphasis role="bold">Algorithme</emphasis> : choisissez l'algorithme pour la procédure de mise au point automatique :

source: <emphasis role="bold">Iterative</emphasis>: Moves focuser by discreet steps initially decided by the step size. Once a curve slope is calculated, further step sizes are calculated to reach an optimal solution. The algorithm stops when the measured HFR is within percentage tolerance of the minimum HFR recorded in the procedure.
fr: <emphasis role="bold">Itératif</emphasis> : déplace le moteur de mise au point par pas discret de taille initiale fixée. Une fois que la pente de la courbe est calculée, les tailles de pas suivants sont calculés pour atteindre une solution optimale. L'algorithme s'arrête dès que la valeur HFR mesurée se trouve dans la plage de tolérance définie.

source: <emphasis role="bold">Polynomial</emphasis>: Starts with the iterative method. Upon crossing to the other side of the V-Curve, polynomial fitting coefficients along with possible minimum solution are calculated. This algorithm can be faster than a purely iterative approach given a good data set.
fr: <emphasis role="bold">Polynomial</emphasis> : débute avec la méthode itérative. Quand la position passe de l'autre côté de la courbe en V, une interpolation polynomiale est calculée pour déterminer la position de la solution minimale. Cet algorithme peut être plus rapide que la méthode itérative avec un bon ensemble de données.

source: <emphasis role="bold">Frames</emphasis>: Number of average frames to capture. During each capture, an HFR is recorded. If the instantaneous HFR value is unreliable, you can average a number of frames to increase the signal to noise ratio.
fr: <emphasis role="bold">Trames</emphasis> : nombre moyen de trames à acquérir. Un HFR est enregistré pour chaque acquisition. Si une valeur instantanée de HFR n'est pas fiable, vous pouvez faire la moyenne sur ce nombre de trames pour augmenter le rapport signal sur bruit.

source: <emphasis role="bold">Detection</emphasis>: Select star detection algorithm. Each algorithm has its strengths and weaknesses. It is recommended to keep the default value unless it fails to properly detect stars.
fr: <emphasis role="bold">Détection</emphasis> : choix de l'algorithme de détection d'étoile. Chaque algorithme a ses forces et ses faiblesses. Il est recommandé de conserver les valeurs par défaut sauf s'il échoue à détecter correctement les étoiles.
