Repository: gstax/kstars_trad_fr
Catalog: kstars_ekos-guide.po
Languages: fr

source: <title>Guide</title>
fr: <title>Guidage</title>

source: Tools
fr: Outils

source: <tertiary>Guide</tertiary>
fr: <tertiary>Guidage</tertiary>

source: <screeninfo>Ekos Guide Module</screeninfo>
fr: <screeninfo>Module de guidage Ekos</screeninfo>

source: <phrase>Ekos Guide Module</phrase>
fr: <phrase>Module de guidage Ekos</phrase>

source: Ekos Guide Module enables autoguiding capability using either the powerful built-in guider, or at your option, external guiding via <ulink url="https://openphdguiding.org/">PHD2</ulink> or <ulink url="https://sourceforge.net/projects/linguider/">lin_guider</ulink>. Using the internal guiding, guider CCD frames are captured and sent to Ekos for analysis. Depending on the deviations of the guide star from its lock position, guiding pulses corrections are sent to your mount <guilabel>Via</guilabel> any device that supports ST4 ports. Alternatively, you may send the corrections to your mount <emphasis>directly</emphasis>, if supported by the mount driver. Most of the &GUI; options in the Guide Module are well documented so just hover your mouse over an item and a tooltip will popup with helpful information.
fr: Le module de guidage d'Ekos permet le guidage en utilisant soit le puissant guidage interne ou un guidage externe comme <ulink url="https://openguiding.org/">PHD2</ulink> ou encore <ulink url="https://sourceforge.net/projects/linguider/">lin_guider</ulink>. Lors de l'utilisation du guidage interne, des trames CCD de guidage sont prises et envoyées à Ekos pour analyse. Selon les déviations de l'étoile guide par rapport à sa position de verrouillage, des impulsions de correction sont envoyées à la monture <guilabel>via</guilabel> tout périphérique qui gère les ports ST4. Vous pouvez alternativement envoyer les corrections à la monture <emphasis>directement</emphasis> si cela est géré par le pilote de la monture. La plupart des options qui se trouve dans le module de guidage sont bien documentées, il vous suffit de survoler un élément et une infobulle apparaîtra contenant de l'information très utile.

source: To perform guiding, you need to select a Guider CCD in <link linkend="ekos-profile-wizard">Ekos Profile Setup</link>. The telescope aperture and focal length must be set in the telescope driver. If the Guider CCD is attached to a separate Guide Scope, you must also set the Guide Scope's <guilabel>Focal Length</guilabel> and <guilabel>Aperture</guilabel>. You can set these values under the <guilabel>Options</guilabel> tab of the <link linkend="indi-telescope-setup">telescope driver</link> or from the Mount module. Autoguiding is a two-step process: Calibration &amp; Guiding.
fr: Pour le guidage, il faut sélectionner un CCD de guidage dans la <link linkend="ekos-profile-wizard">configuration de profil d'Ekos</link>. Il faut renseigner l'ouverture et la longueur focale dans le pilote du télescope. Si le CCD de guidage est monté sur un télescope de guidage séparé, il faut également indiquer sa <guilabel>longueur focale</guilabel> et son <guilabel>ouverture</guilabel>. Vous pouvez renseigner ces valeurs dans l'onglet <guilabel>Options</guilabel> du <link linkend="indi-telescope-setup">pilote du télescope</link> ou depuis le module Monture. Le guidage automatique est un processus à deux étapes : la calibration &amp; et le guidage.

source: Guiding introduction
fr: Introduction au guidage

source: During the two processes, you must set the following:
fr: Durant les deux processus, vous devez configurer ce qui suit :

source: <guilabel>Guider</guilabel>: Select the Guider CCD.
fr: <guilabel>Guide</guilabel> : sélectionne le CCD du guide.

source: <guilabel>Via</guilabel>: Selects which device receives the autoguiding correction pulses from Ekos. Usually, guider CCDs have an ST4 port. If you are using the guider's ST4 to autoguide your telescope, set the guider driver in the <guilabel>Via</guilabel> combo box. The guider CCD will receive the correction pulses from Ekos and will relay them to the mount via the ST4 port. Alternatively, some telescopes support pulse commands and you can select the telescope to be a receiver of the Ekos correction pulses.
fr: <guilabel>Via</guilabel> : sélectionne le périphérique qui reçoit les impulsions de correction pour le guidage automatique par Ekos. Les CCD de guidage ont généralement un port ST4. Si vous utilisez le port ST4 du guide pour guider le télescope, réglez le pilote du guide dans la boîte <guilabel>Via</guilabel>. Le CCD du guide recevra les impulsions de corrections d'Ekos qui les transmettra à la monture via le port ST4. Alternativement, certains télescopes gèrent des commandes impulsions et vous pouvez ainsi configurer le télescope pour être le récepteur des impulsions de corrections d'Ekos.

source: <guilabel>Exposure</guilabel>: CCD Exposure in seconds.
fr: <guilabel>Exposition</guilabel> : durée d'exposition du CCD en seconde.

source: <guilabel>Binning</guilabel>: CCD Binning.
fr: <guilabel>Groupement</guilabel> : groupement de pixels du CCD (binning).

source: <guilabel>Box</guilabel>: Size of the box enclosing the guide star. Select a suitable size that is neither too large or too small for the selected star.
fr: <guilabel>Boîte</guilabel> : taille de la boîte entourant l'étoile guide. Sélectionnez une taille adaptée qui ne doit être ni trop grande ni trop petite pour l'étoile sélectionnée.

source: <guilabel>Effects</guilabel>: Specify filter to be applied to the image to enhance it.
fr: <guilabel>Effets</guilabel> : spécifie le filtre à appliquer à l'image pour l'améliorer.

source: Dark Frames
fr: Trames Dark

source: Dark frames are <emphasis>immensely</emphasis> helpful in reducing noises in your guide frames. It is highly recommended to take dark frames before you begin and calibration or guiding procedure. To take a dark frame, check the <guilabel>Dark</guilabel> checkbox and then click <guibutton>Capture</guibutton>. For the first time this is performed, Ekos will ask you about your camera shutter. If your camera does not have a shutter, then Ekos will warn you anytime you take a dark frame to cover your camera/telescope before proceeding with the capture. On the other hand, if the camera already includes a shutter, then Ekos will directly proceed with taking the dark frame. All dark frames are automatically saved to Ekos Dark Frame Library. By default, the Dark Library keeps reusing dark frames for 30 days after which it will capture new dark frames. This value is configurable and can be adjusted in <link linkend="ekos">Ekos settings</link> in the &kstars; settings dialog.
fr: Les trames Dark sont <emphasis>immensément</emphasis> utiles pour aider à réduire le bruit des trames de guidage. Il est hautement recommandé d'en prendre avec de commencer la calibration et la procédure de guidage. Pour prendre une trame Dark, cochez la case <guilabel>Dark</guilabel> et ensuite cliquez sur le bouton <guibutton>Acquisition</guibutton>. La première fois que vous réaliserez cela, Ekos vous demandera si votre caméra possède un obturateur et si ce n'est pas le cas, il vous avertira de couvrir votre caméra ou télescope avant le début de l'acquisition. Si votre caméra en possède un, alors Ekos procédera directement à l'acquisition des trames Dark. Toutes les trames Dark seront automatiquement enregistrées dans la bibliothèque de Dark. Par défaut ces trames seront utilisées pendant 30 jours après quoi une nouvelle série sera prise. Cette durée peut être configurée dans <link linkend="ekos">Configuration Ekos</link> dans la boîte de dialogue de la configuration de &kstars;.

source: <screeninfo>Ekos Dark frames library</screeninfo>
fr: <screeninfo>Bibliothèque de trames Dark d'Ekos</screeninfo>

source: <phrase>Ekos Dark frames library</phrase>
fr: <phrase>Bibliothèque de trames Dark d'Ekos</phrase>

source: It is recommended to take dark frames covering several binning and exposure values so that they may be reused transparently by Ekos whenever needed.
fr: Il est recommandé de prendre des trames Dark couvrant plusieurs groupements de pixels et différentes durées d'exposition afin qu'elles puissent être utilisées de manière transparente par Ekos lorsque c'est nécessaire.

source: <screeninfo>Calibration Settings</screeninfo>
fr: <screeninfo>Réglages de la calibration</screeninfo>

source: <phrase>Calibration Settings</phrase>
fr: <phrase>Réglages de la calibration</phrase>

source: In the calibration phase, you need to capture an image, select a guide star, and click <guibutton>Guide</guibutton> to begin the calibration process. If calibration was already completed successfully before, then the autoguiding process shall begin immediately, otherwise, it would start the calibration process. If <guilabel>Auto Star</guilabel> is checked, then you are only required to click <guibutton>Capture</guibutton> and Ekos will automatically select the best-fit guide star in the image and continues the calibration process automatically. If <guilabel>Auto Star</guilabel> is disabled, Ekos will try to automatically highlight the best guide star in the field. You need to confirm or change the selection before you can start the calibration process. The calibration options are:
fr: Dans la phase de calibration, vous devez prendre une image, choisir une étoile guide et cliquez sur le bouton <guibutton>Guide</guibutton> pour débuter la procédure de calibration. Si la calibration avait déjà été faite préalablement et avait été couronnée de succès, alors le guidage démarrera immédiatement, sinon la procédure de calibration débutera. Si la case <guilabel>Étoile automatique</guilabel> est cochée, alors il ne reste qu'à cliquer sur le bouton <guibutton>Acquisition</guibutton> et Ekos va sélectionner automatiquement la meilleure étoile guide de l'image et poursuivre la procédure de calibration. Si cette case est décochée, Ekos va essayer de sélectionner la meilleure étoile guide dans le champ mais vous devrez confirmer ou modifier la sélection avant de pouvoir débuter la procédure de calibration. Les options de calibrations sont :

source: <guilabel>Pulse</guilabel>: The duration of pulses in milliseconds to be sent to the mount. This value should be large enough to cause a noticeable movement in the guide star. If you increase the value and you do not notice any movement of the guide star, then this suggests possible mount issues such as jamming or connection issues via the ST4 cable.
fr: <guilabel>Impulsions</guilabel> : la durée des impulsions en millisecondes à envoyer à la monture. Cette valeur devrait être assez grande pour causer un mouvement perceptible de l'étoile guide. Si aucun mouvement de l'étoile guide n'est perceptible après avoir augmenté cette valeur, cela peut suggérer un problème avec la monture comme un encombrement de câbles ou un problème de connexion avec le câble ST4.

source: <guilabel>Two axis</guilabel>: Check if you want the calibration process makes calibration in both RA &amp; DEC. If unchecked, the calibration is only performed in RA.
fr: <guilabel>Deux axes</guilabel> : cochez si vous souhaitez que la procédure de calibration se fasse sur les axes en AD &amp; en DEC. Si décochée, la calibration ne sera réalisée que sur l'axe en AD.

source: <guilabel>Auto Star</guilabel>: If checked, Ekos will attempt to select the best guide star in the frame and begins the calibration process automatically.
fr: <guilabel>Étoile automatique</guilabel> : si cette option est sélectionnée, Ekos va essayer de trouver la meilleure étoile guide dans l'image et commencer la procédure de calibration automatiquement.

source: The reticle position is the guide star position selected by you (or by the auto selection) in the captured guider image. You should select a star that is not close to the edge. If the image is not clear, you may select different <guilabel>Effects</guilabel> to enhance it.
fr: La position du réticule représente la position de l'étoile guide que vous (ou la sélection automatique) avez choisi dans l'image de guidage. Vous devriez choisir une étoile qui ne se trouve pas trop près des bords et si l'image n'est pas claire, vous pouvez appliquer différents <guilabel>effets</guilabel> pour l'améliorer.

source: Ekos begins the calibration process by sending pulses to move the mount in RA and DEC. If the calibration process fails due to short drift, try increasing the pulse duration. To clear calibration, click the trash bin icon next to the <guibutton>Guide</guibutton> button.
fr: Ekos débute la procédure de calibration en envoyant des impulsions à la monture pour la déplacer en AD et en DEC. Si la procédure échoue à cause de petite dérive, essayez d'augmenter la durée des impulsions. Pour réinitialiser la calibration, cliquez sur l'icône poubelle à côté du bouton <guilabel>Guide</guilabel>.

source: Calibration can fail for a variety of reasons. To improve the chances of success, try the tips below.
fr: La calibration peut échouer pour plusieurs raisons. Pour augmenter les chances de succès, vous pouvez essayer les astuces suivantes.

source: <guilabel>Better Polar Alignment</guilabel>: This is critical to the success of any astrophotography session. Perform a quick polar alignment with a polar scope (if available) or by using Ekos <link linkend="ekos-align-polaralignment">Polar Alignment procedure</link> in the <guilabel>Align</guilabel> module.
fr: <guilabel>Meilleur alignement polaire</guilabel> : c'est un point critique pour assurer le succès de toute session d'astrophotographie. Réalisez un rapide alignement polaire avec un télescope polaire (si disponible) ou en utilisant la <link linkend="ekos-align-polaralignment">procédure d'alignement polaire</link> d'Ekos du module d'<guilabel>alignement</guilabel> d'Ekos.

source: <guilabel>Set binning to 2x2</guilabel>: Binning improves SNR and is often very important to the success of the calibration and guiding procedures.
fr: <guilabel>Réglez le groupement de pixels sur 2x2</guilabel> : le groupement de pixels augmente le rapport signal sur bruit et est souvent très important pour le succès des procédures de calibration et de guidage.

source: Prefer to use ST4 cable between guide-camera and mount over using mount pulse commands.
fr: Préférez l'utilisation de câble ST4 entre la caméra guide et la monture plutôt que l'envoi de commandes d'impulsions vers la monture.

source: Select different filter (&eg; High contrast) and see if that makes a difference to bring down the noise.
fr: Essayez différents filtres (&cad; à haut contraste) et voyez si cela permet de réduire le bruit.

source: Smaller Square Size.
fr: Taille réduites des carrés.

source: Take dark frames to reduce noise.
fr: Prenez des trames Dark pour réduire le bruit.

source: Play with DEC Proportional Gain or disable DEC control completely and see the difference.
fr: Essayez le gain proportionnel en DEC ou désactiver complètement le contrôle en DEC et voyez si cela fait une différence.

source: Leave algorithm to the default value (<guimenuitem>Smart</guimenuitem>).
fr: Laissez l'algorithme à sa valeur par défaut (<guimenuitem>Intelligent</guimenuitem>).

source: Guiding
fr: Guidage

source: <screeninfo>Guide Settings</screeninfo>
fr: <screeninfo>Réglages du guidage</screeninfo>

source: <phrase>Guide Settings</phrase>
fr: <phrase>Réglages du guidage</phrase>

source: Once the calibration process is completed successfully, the guiding shall begin automatically hereafter. The guiding performance is displayed in the <guilabel>Drift Graphics</guilabel> region where <guilabel>Green</guilabel> reflects deviations in RA and <guilabel>Blue</guilabel> deviations in DEC. The colors of the RA/DE lines can be changed in <link linkend="colors">&kstars; color scheme</link> in &kstars; settings dialog. The vertical axis denotes the deviation in arcsecs from the guide star central position and the horizontal axis denotes time. You can hover over the line to get the exact deviation at this particular point in time. Furthermore, you can also zoom and drag/pan the graph to inspect a specific region of the graph.
fr: Une fois que la procédure de calibration s'est terminée avec succès, le guidage débutera automatiquement. Les performances de guidage sont affichées dans le <guilabel>graphique de la dérive</guilabel> où la déviation en AD est tracée en <guilabel>vert</guilabel> et la déviation en DEC en <guilabel>bleu</guilabel>. Ces couleurs peuvent être modifiées dans le <link linkend="colors">schéma de couleurs de &kstars;</link> dans &kstars;. L'axe vertical désigne la déviation en secondes d'arc de la position centrale de l'étoile guide et l'axe horizontal représente le temps. Vous pouvez survoler les lignes pour connaître les déviations exactes à chaque instant. De plus, vous pouvez zoomer et déplacer le graphique pour inspecter une zone particulière.

source: Ekos can utilize multiple algorithms to determine the center of mass of the guide star. By default, the <emphasis>smart</emphasis> algorithm is suited best for most situation. The <emphasis>fast</emphasis> algorithm is based on HFR calculations. You can try switching guiding algorithms if Ekos cannot keep of the guide star within the guiding square properly.
fr: Ekos peut utiliser divers algorithmes pour déterminer le centre de masse de l'étoile guide. Par défaut, c'est l'algorithme <emphasis>Intelligent</emphasis> qui convient à la plupart des situations. L'algorithme <emphasis>Rapide</emphasis> est basé sur les calculs de HFR. Vous pouvez essayer de changer d'algorithme si Ekos ne parvient pas à garder correctement l'étoile guide dans le carré de guidage.

source: The info region displays information on the telescope &amp; FOV, in addition to the deviations from the guide star along with the correction pulses sent to the mount. The RMS value for each axis is displayed along with the total RMS value in arcsecs. The internal guider employs <ulink url="https://en.wikipedia.org/wiki/PID_controller">PID controller</ulink> to correct the mount tracking. Currently, the <emphasis>only</emphasis> the proportional and integral gains are utilized within the algorithm, so adjusting it should affect the length of the generated pulses sent to the mount in milliseconds.
fr: La zone d'informations affiche des informations sur le télescope &amp; CdV, ainsi que sur les déviations de l'étoile guide et les impulsions de corrections envoyées à la monture. La valeur RMS pour chaque axe est affichée avec la valeur RMS totale en secondes d'arc. Le guidage interne emploie un <ulink url="https://fr.wikipedia.org/wiki/Régulateur_PID">régulateur PID</ulink> pour corriger le suivi de la monture. Actuellement <emphasis>seuls</emphasis> les gains proportionnels et intégraux sont utilisés par l'algorithme, ainsi leur ajustement devrait affecter la longueur des impulsions (en millisecondes) générées qui seront envoyées à la monture.

source: To enable automatic dithering between frames, make sure to check the <guilabel>Dither</guilabel> checkbox. By default, Ekos should dither (&ie; move) the guiding box by up to 3 pixels after each frame captured in <link linkend="ekos-capture">Ekos Capture Module</link>. The motion duration and direction are randomized. Since the guiding performance can oscillate immediately after dithering, you can set the appropriate <guilabel>Settle</guilabel> duration to wait after dither is complete before resuming the capture process. In rare cases where the dithering process can get stuck in an endless loop, set the appropriate <guilabel>Timeout</guilabel> to abort the process. But even if dithering fails, you can select whether this failure should terminate the autoguiding process or not. Toggle <guilabel>Abort Autoguide on failure</guilabel> to select the desired behavior.
fr: Pour activer les mini-déviations (dithering) entre les trames, assurez-vous de cocher la case <guilabel>Déviations</guilabel>. Par défaut, Ekos déplacera la boîte de guidage jusqu'à trois pixels après chaque acquisition dans le <link linkend="ekos-capture">module d'acquisition</link>. La durée de déplacement et sa direction sont aléatoires. Comme la performance de guidage peut osciller juste après le déplacement, vous pouvez configurer une durée de <guilabel>stabilisation</guilabel> avant la poursuite de la procédure d'acquisition. Dans les rares cas où la procédure de mini-déviations se bloque dans une boucle sans fin, vous pouvez configurer un <guilabel>délai maximal</guilabel> adéquat pour annuler la procédure. Mais même dans ce cas, vous pouvez choisir si cet échec doit mettre fin à la procédure de guidage automatique ou non. L'option <guilabel>Abandonner guidage automatique si échec</guilabel> permet de configurer le comportement souhaité.

source: Non-guide dithering is also supported. This is useful when no guide camera is available or when performing short exposures. In this case, the mount can be commanded to dither in a random direction for up to the pulse specified in the <guilabel>Non-Guide Dither Pulse</guilabel> option.
fr: Les mini-déviations sans guide sont également possibles. Cela est utile si aucune caméra guide n'est disponible ou lors d'exposition très courte. Dans ce cas, la monture peut être commandée pour réaliser de mini-déviations dans une direction aléatoire pour une durée configuré avec l'option <guilabel>Impulsion déviation sans guide</guilabel>.

source: Ekos supports multiple guiding methods: Internal, PHD2, and LinGuider. You need to select the desired guider in your Ekos equipment profile:
fr: Ekos permet différentes méthodes de guidage : interne, PHD2 et LinGuider. Vous devez en sélectionner une dans le profil de votre matériel :

source: <guilabel>Internal Guider</guilabel>: Use Ekos internal guider. This is the default and recommended option.
fr: <guilabel>Guidage interne</guilabel> : utilise le guidage interne d'Ekos. C'est l'option par défaut et qui est recommandée.

source: <guilabel>PHD2</guilabel>: Use PHD2 as the external guider. If selected, specify the host and port of the PHD2. Leave to default values if Ekos and PHD2 are running on the same machine.
fr: <guilabel>PHD2</guilabel> : utilise PHD2 comme guidage externe. Si vous sélectionnez cette option, il faut spécifier l'hôte et le port sur lequel tourne PHD2. Laissez les valeurs par défaut si Ekos et PHD2 tournent sur la même machine.

source: <guilabel>LinGuider</guilabel>: Use LinGuider as the external guider. If selected, specify the host and port of the LinGuider. Leave to default values if Ekos and LinGuider are running on the same machine.
fr: <guilabel>LinGuider</guilabel> : utilise LinGuider comme guidage externe. Si vous sélectionnez cette option, il faut spécifier l'hôte et le port sur lequel tourne LinGuider. Laissez les valeurs par défaut si Ekos et LinGuider tournent sur la même machine.

source: <title>Guiding Direction Control</title>
fr: <title>Contrôle de direction du guidage</title>

source: <screeninfo>Guiding Direction Control</screeninfo>
fr: <screeninfo>Contrôle de direction du guidage</screeninfo>

source: <phrase>Guiding Direction Control</phrase>
fr: <phrase>Contrôle de direction du guidage</phrase>
