Repository: gstax/kstars_trad_fr
Catalog: kstars_ekos-guide.po
Languages: fr

source: You can fine-tune the guiding performance in the Control Section. The autoguide process works like a <ulink url="https://en.wikipedia.org/wiki/PID_controller">PID controller</ulink> when sending correction commands to the mount. You can alter the Proportional and Integral gains to improve the guiding performance if necessary. By default, guiding corrective pulses are sent to both mount axis in all directions: positive and negative. You can fine-tune control by selecting which axis shall receive corrective guiding pulses and within each axis, you can indicate which direction <guilabel>(Positive) +</guilabel> or <guilabel>Negative (-)</guilabel> receives the guiding pulses. For example, for the Declination axis, the <guilabel>+</guilabel> direction is North and <guilabel>-</guilabel> is South.
fr: Vous pouvez affiner les performances de guidages dans la section de contrôle. Le guidage automatique fonctionne comme un <ulink url="https://fr.wikipedia.org/wiki/Régulateur_PID">régulateur PID</ulink> quand les commandes de corrections sont envoyées à la monture. Vous pouvez modifier les valeurs de gains proportionnels et intégraux pour améliorer la performance de guidage. Par défaut les impulsions de correction de guidage sont envoyées aux deux axes de la monture et dans toutes les directions (positives et négatives). Vous pouvez affiner ce contrôle en choisissant quel axe doit recevoir les impulsions et pour chaque axe la direction (<guilabel>positive +</guilabel> ou <guilabel>négative -</guilabel>). Par exemple pour l'axe de déclinaison, la direction positive est le nord et la négative le sud.

source: Guiding Rate
fr: Taux de guidage

source: Each mount has a particular guiding rate in (x15"/sec) and usually ranges from 0.1x, to 1.0x with 0.5x being a common value used by many mounts. The default guiding rate is 0.5x sidereal, which is equivalent to a proportional gain of 133.33. Therefore, set the guiding rate value to whatever value used by your mount, and Ekos shall display the <emphasis>recommended</emphasis> proportional gain value that you may set in the proportional gain field under the <guilabel>Control Parameters</guilabel>. Setting this value <emphasis>does not</emphasis> change your mount guiding rate! You must change your mount guiding rate either via the <link linkend="indi-telescope-setup">INDI driver</link>, if supported, or via the hand controller.
fr: Chaque monture possède un taux de guidage particulier (x15 secondes d'arc par seconde) et varie habituellement de 0,1x à 1,0x, 0,5x étant une valeur communément utilisées par de nombreuses montures. Le taux de guidage par défaut est 0,5x sidéral ce qui équivaut à un gain proportionnel de 133,33. Par conséquent, réglez la valeur du taux de guidage à celle utilisée par votre monture et Ekos affichera le gain proportionnel <emphasis>recommandé</emphasis> que vous pourrez indiquer dans le champ de gain proportionnel dans <guilabel>Paramètres de contrôle</guilabel>. Le réglage de cette valeur <emphasis>ne change pas</emphasis> le taux de guidage de votre monture ! Vous devez le modifier soit via le <link linkend="indi-telescope-setup">pilote INDI</link>, soit, si cela est géré, via la manette de contrôle.

source: <title>Drift Graphics</title>
fr: <title>Graphique de la dérive</title>

source: <screeninfo>Drift Graphics</screeninfo>
fr: <screeninfo>Graphique de la dérive</screeninfo>

source: <phrase>Drift Graphics</phrase>
fr: <phrase>Graphique de la dérive</phrase>

source: The drift graphics is a very useful tool to monitor the guiding performance. It is a 2D plot of guiding <emphasis>deviations</emphasis> and <emphasis>corrections</emphasis>. By default, only the guiding deviations in RA and DE are displayed. The horizontal axis is the time in seconds since the autoguiding process was started while the vertical axis plots the guiding drift/deviation in arcsecs for each axis. Guiding corrections (pulses) can also be plotted in the same graph and you can enable them by checking the <guilabel>Corr</guilabel> checkbox below each Axis. The corrections are plotted as shaded areas in the background with the same color as that of the axis.
fr: Le graphique de la dérive est un outil très puissant pour surveiller les performances de guidage. C'est un graphique 2D des <emphasis>déviations</emphasis> du guidage et des <emphasis>corrections</emphasis>. Par défaut, seules les déviations en AD et DEC sont affichées. L'axe horizontal représente le temps en secondes depuis le début du processus de guidage alors que l'axe vertical représente les déviations ou dérives du guidage en secondes d'arc. Les corrections de guidage (impulsions) peuvent être tracées sur le même graphique et vous pouvez les activer en cochant les cases <guilabel>Corr</guilabel> sous chaque axe. Les corrections sont affichées sous la forme de zones ombrées en arrière-plan avec les mêmes couleurs que celles des axes.

source: You can pan and zoom the plot, and when hovering the mouse over the graph, a tooltip is displayed containing information about this specific point in time. It contains the guiding drift and any corrections made, in addition to the local time, this event was recorded. A vertical slider to the right of the image can be used to adjust the height of the secondary Y-axis for pulses corrections.
fr: Vous pouvez déplacer le graphique ainsi que faire un zoom et lorsque vous survolez une zone, des infobulles apparaîtront contenant de l'information pour un moment spécifique. Elle contient la dérive et la correction effectuée et l'heure locale d'enregistrement de l'événement. Un curseur vertical à la droite de l'image permet d'ajuster la hauteur de l'axe Y secondaire qui affiche les impulsions de correction.

source: The <guilabel>Trace</guilabel> horizontal slider at the bottom can be used to scroll through the guide history. Alternatively, you can click the <guilabel>Max</guilabel> checkbox to lock the graph onto the latest point so that the drift graphics autoscrolls. The buttons to the right of the slider are used for autoscaling the graphs, exporting the guide data to a CSV file, clearing all the guide data, and for scaling the target in the <guilabel>Drift Plot</guilabel>. Furthermore, the guide graph includes a label to indicate when a dither occurred so the user knows guiding was not bad at those points.
fr: Le curseur horizontal <guilabel>Trace</guilabel> au bas de graphique permet de défiler dans l'historique du guidage. Vous pouvez aussi cliquer la case <guilabel>Max</guilabel> pour verrouiller le graphique sur le dernier point pour ainsi activer le défilement automatique du graphique de dérive. Les boutons à la droite du curseur permettent la mise à l'échelle automatique du graphique, l'exportation des données de guidage vers un fichier CSV, la réinitialisation de toutes les données de guidage et la mise à l'échelle de la cible dans <guilabel>Graphique de la dérive</guilabel>. De plus, ce graphique affiche une étiquette pour indiquer le moment des mini-déviations (dithering), ce qui est utile à l'utilisateur pour savoir que le guidage n'était pas mauvais à ce moment-là.

source: The colors of each axis can be customized in <link linkend="colors">&kstars; Settings color scheme</link>.
fr: La couleur de chaque axe peut être modifiée dans la boîte de dialogue <link linkend="colors">Réglages de schémas de couleurs de &kstars;</link>.

source: Drift Plot
fr: Graphique des dérives

source: A bulls-eye scatter plot can be used to gauge the <emphasis>accuracy</emphasis> of the overall guiding performance. It is composed of three concentric rings of varying radii with the central green ring having a default radius of 2 arcsecs. The last RMS value is plotted as <inlinemediaobject><imageobject><imagedata fileref="add-circle.png" format="PNG"/></imageobject></inlinemediaobject> with its color reflecting which concentric ring it falls within. You can change the radius of the innermost green circle by adjusting the drift plot accuracy.
fr: Un graphique de dispersion peut être utilisé pour juger de la <emphasis>précision</emphasis> de la performance de guidage globale. Il se compose de trois anneaux concentriques de rayon différent avec l'anneau central ayant un rayon de 2 secondes d'arc. La dernière valeur RMS est tracée avec l'icône <inlinemediaobject><imageobject><imagedata fileref="add-circle.png" format="PNG"/></imageobject></inlinemediaobject> et dont la couleur reflète sa position. Vous pouvez modifier la couleur de l'anneau central en ajustant la précision du graphique de dérive.

source: PHD2 Support
fr: Gestion de PHD2

source: You can opt to select external PHD2 application to perform guiding instead of the built-in guider.
fr: Vous pouvez choisir d'utiliser l'application externe PHD2 pour réaliser le guidage plutôt que d'utiliser le guidage intégré.

source: <screeninfo>Ekos Guide PHD2 settings</screeninfo>
fr: <screeninfo>Réglages du guidage PHD2 Ekos</screeninfo>

source: <phrase>Ekos Guide PHD2 settings</phrase>
fr: <phrase>Réglages du guidage PHD2 Ekos</phrase>

source: If PHD2 is selected, the <guibutton>Connect</guibutton> and <guibutton>Disconnect</guibutton> buttons are enabled to allow you to establish a connection with the PHD2 server. You can control PHD2 exposure and DEC guide settings. When clicking <guibutton>Guide</guibutton>, PHD2 should perform all the required actions to start the guiding process. PHD2 <emphasis role="bold">must</emphasis> be started and configured <emphasis>before</emphasis> Ekos.
fr: Si PHD2 est sélectionné, les boutons <guibutton>Connexion</guibutton> et <guibutton>Déconnexion</guibutton> sont activés pour vous permettre d'établir la connexion avec le serveur PHD2. Vous pouvez contrôler la durée d'exposition de PHD2 et régler le guidage en DEC. Quand vous cliquez sur <guibutton>Guidage</guibutton>, PHD2 réalisera toutes les actions requises pour débuter la procédure de guidage. Veuillez noter que PHD2 <emphasis role="bold">doit</emphasis> être démarré et configuré <emphasis>avant</emphasis> Ekos.

source: After launching PHD2, select your INDI equipment and set their options. From Ekos, connect to PHD2 by clicking the <guibutton>Connect</guibutton> button. On startup, Ekos will attempt to automatically connect to PHD2. Once the connection is established, you may begin the guiding immediately by click on the <guibutton>Guide</guibutton> button. PHD2 shall perform calibration if necessary. If dithering is selected, PHD2 shall be commanded to dither given the offset pixels indicated and once guiding is settled and stable, the capture process in Ekos shall resume.
fr: Après avoir démarré PHD2, sélectionnez votre matériel INDI et configurez les options. Vous pouvez vous connecter à PHD2 directement depuis Ekos en cliquant sur le bouton <guibutton>Connexion</guibutton>. Au démarrage Ekos tentera de se connecter automatiquement à PHD2. Une fois que la connexion est établie, vous pouvez débuter le guidage immédiatement en cliquant sur le bouton <guibutton>Guidage</guibutton>. PHD2 procédera à la calibration si nécessaire. Si les mini-déviations (dithering) sont activées, PHD2 enverra les commandes de mini-déviations données par le décalage des pixels et dès que le guidage est stabilisé et stable, Ekos pourra reprendre la procédure d'acquisition.

source: Ekos saves a CSV guide log data that can be useful for analysis of the mount's performance under <filename>~/.local/share/kstars/guide_log.txt</filename>. This log is only available when using the built-in guider.
fr: Ekos enregistre les données de guidage dans un fichier CSV (<filename>~/.local/share/kstars/guide_log.txt</filename>) qui pourra être utile pour analyser les performances de la montures. Ce fichier journal n'est disponible que pour le guidage interne.
