Repository: gstax/kstars_trad_fr
Catalog: kstars_cpoles.po
Languages: fr

source: The Celestial Poles
fr: Les pôles célestes

source: Celestial Poles
fr: Pôles célestes

source: Equatorial Coordinates
fr: Coordonnées équatoriales

source: The sky appears to drift overhead from east to west, completing a full circuit around the sky in 24 (<link linkend="ai-sidereal">Sidereal</link>) hours. This phenomenon is due to the spinning of the Earth on its axis. The Earth's spin axis intersects the <link linkend="ai-csphere">Celestial Sphere</link> at two points. These points are the <firstterm>Celestial Poles</firstterm>. As the Earth spins; they remain fixed in the sky, and all other points seem to rotate around them. The celestial poles are also the poles of the <link linkend="equatorial">Equatorial Coordinate System</link>, meaning they have <firstterm>Declinations</firstterm> of +90 degrees and -90 degrees (for the North and South celestial poles, respectively).
fr: Le ciel nocturne semble se déplacer vers l'Ouest et retourner à son point de départ en 24 heures (<link linkend="ai-sidereal">sidérales</link>). Ce phénomène est en fait causé par la rotation de la Terre autour de son axe de rotation. L'axe de rotation de la Terre (si on étirait ses deux bouts jusqu'aux confins de l'univers) aboutirait finalement à deux points : les deux <firstterm>pôles célestes</firstterm> de la <link linkend="ai-csphere">sphère céleste</link>. Ces deux points sont en quelque sorte les deux extrémités de l'Univers. Ils sont immobiles et tous les autres objets nous semblent bouger (à cause de la rotation de la Terre autour de l'axe de rotation terrestre). Les pôles célestes sont aussi les pôles du <link linkend="equatorial">système de coordonnées équatorial</link> ; ils possèdent des <firstterm>déclinaisons</firstterm> de +90 degrés et -90 degrés (pour les pôles célestes Nord et Sud respectivement).

source: The North Celestial Pole currently has nearly the same coordinates as the bright star <firstterm>Polaris</firstterm> (which is Latin for <quote>Pole Star</quote>). This makes Polaris useful for navigation: not only is it always above the North point of the horizon, but its <link linkend="horizontal">Altitude</link> angle is always (nearly) equal to the observer's <link linkend="ai-geocoords">Geographic Latitude</link> (however, Polaris can only be seen from locations in the Northern hemisphere).
fr: Il est utile de conserver en mémoire que le pôle céleste nord possède à peu près les mêmes coordonnées que la très brillante étoile <firstterm>Polaris</firstterm> (latin, signifie <quote>étoile polaire</quote>). Cela fait de Polaris un outil de navigation exceptionnel : non seulement se trouve-t-il toujours au-dessus du point nord, mais aussi son angle d'<link linkend="horizontal">altitude</link> est toujours égal (presque égal) à la <link linkend="ai-geocoords">latitude géographique</link> de l'observateur. En revanche, Polaris n'est visible que dans l'hémisphère Nord.

source: The fact that Polaris is near the pole is purely a coincidence. In fact, because of <link linkend="ai-precession">Precession</link>, Polaris is only near the pole for a small fraction of the time.
fr: Le fait que Polaris se trouve près du pôle est une coïncidence. En fait, du fait du phénomène de <link linkend="ai-precession">précession</link>, Polaris se trouve près du pôle pour une courte durée seulement.

source: Exercises:
fr: Exercices :

source: Use the <guilabel>Find Object</guilabel> window (<keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>) to locate Polaris. Notice that its Declination is almost (but not exactly) +90 degrees. Compare the Altitude reading when focused on Polaris to your location's geographic latitude. They are always within one degree of each other. They are not exactly the same because Polaris isn't exactly at the Pole. (you can point exactly at the pole by switching to Equatorial coordinates, and pressing the up-arrow key until the sky stops scrolling).
fr: Utilisez la fenêtre <guilabel>Trouver un objet</guilabel> (<keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>) pour trouver Polaris. Notez que sa déclinaison est presque +90 degrés. Comparez l'altitude que vous obtenez quand vous fixez Polaris, à la latitude de l'endroit où vous êtes situé. Ces deux résultats se trouvent à moins d'un degré l'un de l'autre. La raison pour laquelle ils ne sont pas exactement les mêmes est que Polaris ne se trouve pas exactement au pôle. Vous pouvez viser le pôle lui-même en activant les coordonnées équatoriales et en vous déplaçant vers le haut (flèche sur votre clavier) jusqu'à la limite.

source: Use the <guilabel>Time Step</guilabel> spinbox in the toolbar to accelerate time to a step of 100 seconds. You can see the entire sky appears to rotate around Polaris, while Polaris itself remains nearly stationary.
fr: Utilisez l'outil <guilabel>Ajuster le pas du temps</guilabel>, dans la barre d'outils, pour accélérer le temps (bonds de 100 secondes). Vous noterez que le ciel semble tourner autour de Polaris, et que Polaris demeure presque immobile.

source: We said that the celestial pole is the pole of the Equatorial coordinate system. What do you think is the pole of the horizontal (Altitude/Azimuth) coordinate system? (The <link linkend="ai-zenith">Zenith</link>).
fr: Nous avons vu que le pôle céleste est le pôle du système de coordonnées équatorial. Quel est, d'après vous, le pôle du système de coordonnées horizontal (altitude/azimut) ? (réponse : le <link linkend="ai-zenith">zénith</link>).
