Repository: gstax/kstars_trad_fr
Catalog: kstars._desktop_.po
Languages: fr

# Name
source: Focus started
fr: Démarrage de la mise au point

# Comment
source: Autofocus operation started
fr: Démarrage de l'opération de mise au point automatique

# Name
source: Autofocus Success
fr: Succès de l'opération de mise au point automatique

# Comment
source: Autofocus operation completed successfully
fr: Opération de mise au point automatique terminée avec succès

# Name
source: Autofocus Failure
fr: Échec de l'opération de mise au point automatique

# Comment
source: Autofocus operation failed with errors
fr: Échec de l'opération de mise au point automatique avec des erreurs

# Name
source: Alignment Success
fr: Succès de l'alignement

# Comment
source: Astrometry alignment completed successfully
fr: Opération d'alignement d'astrométrie terminée avec succès

# Name
source: Alignment Failure
fr: Échec de l'alignement

# Comment
source: Astrometry alignment failed with errors
fr: Échec de l'opération d'alignement d'astrométrie

# Name
source: Calibration Success
fr: Calibration réalisée avec succès

# Comment
source: Guiding calibration completed successfully
fr: Calibration du guidage terminée avec succès

# Name
source: Calibration Failure
fr: Échec de la calibration

# Comment
source: Guiding calibration failed with errors
fr: Échec de la calibration du guidage avec des erreurs

# Name
source: Guiding Failure
fr: Échec du guidage

# Comment
source: Autoguiding failed with errors
fr: Échec du guidage automatique avec des erreurs

# Name
source: Capture Success
fr: Acquisition réalisée avec succès

# Comment
source: CCD Capture completed successfully
fr: Acquisition CCD terminée avec succès

# Name
source: Capture Failure
fr: Échec de l'acquisition

# Comment
source: CCD capture failed with errors
fr: Échec de l'acquisition CCD avec des erreurs

# Name
source: FITS Received
fr: Données FITS reçues

# Comment
source: FITS file is received
fr: Le fichier FITS a été reçu

# Name
source: Weather Warning
fr: Alarme météo

# Comment
source: Weather conditions in warning zone
fr: Conditions météo dans la zone d'alarme

# Name
source: Weather Alert
fr: Alerte météo

# Comment
source: Weather conditions are critical. Observatory shutdown is imminent
fr: Les conditions météo sont critiques. L'arrêt de l'observatoire est imminent.

# Name
source: Observatory Startup
fr: Démarrage de l'observatoire

# Comment
source: Observatory is in the startup process
fr: L'observatoire a lancé le processus de démarrage

# Name
source: Observatory Shutdown
fr: Arrêt de l'observatoire

# Comment
source: Observatory is in the shutdown process
fr: L'observatoire a lancé le processus d'arrêt

# Name
source: Scheduler Aborted
fr: Interruption de l'ordonnanceur

# Name
source: Slew Started
fr: Pivotage démarré

# Comment
source: Mount is slewing to target location
fr: La monture pivote vers l'emplacement ciblé

# Name
source: Slew Completed
fr: Pivotage terminé

# Comment
source: Mount arrived at target location
fr: La monture est arrivé à l'emplacement ciblé

# Name
source: Mount Aborted
fr: Interruption de la monture

# Comment
source: Mount motion was aborted
fr: Le déplacement de la monture a été interrompu

# Name
source: Mount Parking
fr: Parcage de la monture

# Comment
source: Mount parking is in progress
fr: Le parcage de la monture est en cours

# Name
source: Parking Mount Completed
fr: Parcage de la monture terminé

# Comment
source: Mount parked
fr: Monture parquée

# Name
source: Mount parking failed
fr: Échec du parcage de la monture

# Comment
source: Mount parking failed
fr: Échec du parcage de la monture

# Name
source: Mount unparked
fr: Monture déparquée

# Comment
source: Mount unparked
fr: Monture déparquée

# Name
source: Dome Parking
fr: Fermeture du dôme

# Comment
source: Parking dome is in progress
fr: La fermeture du dôme est en cours

# Name
source: Dome Parked
fr: Dôme fermé

# Comment
source: Parking dome is complete
fr: La fermeture du dôme est terminée

# Name
source: Dome Unparking
fr: Ouverture du dôme

# Comment
source: Unparking dome is in progress
fr: L'ouverture du dôme est en cours

# Name
source: Dome unparked
fr: Dôme ouvert

# Comment
source: Unparking dome is complete
fr: L'ouverture du dôme est terminée

# Name
source: Filter Wheel Changed
fr: Roue à filtre changée

# Name
source: Video Recording Started
fr: Démarrage de l'enregistrement vidéo

# Name
source: Video Recording Stopped
fr: Arrêt de l'enregistrement vidéo

# Name
source: Meridian Flip Started
fr: Démarrage du retournement au méridien

# Name
source: Meridian Flip Completed
fr: Retournement au méridien terminé

# Name
source: Meridian Flip Failed
fr: Échec du retournement au méridien

# Name
source: Motion Started
fr: Démarrage du déplacement

# Comment
source: Mount manual motion started
fr: Démarrage du déplacement manuel de la monture

# Name
source: Motion Completed
fr: Déplacement terminé

# Comment
source: Mount manual motion completed
fr: Déplacement manuel de la monture terminé

# Name
source: INDI Server Message
fr: Message du serveur INDI

# Comment
source: INDI Server Message (it must be enabled in INDI section of Settings)
fr: Message du serveur INDI (il doit être activé dans la section INDI des paramètres)

# Name
source: Scheduled Ekos job started
fr: Démarrage de la tâche planifiée Ekos

# Comment
source: A scheduled Ekos job is started
fr: Une tâche planifiée Ekos a démarré

# Name
source: Scheduled Ekos job failed
fr: Échec de la tâche planifiée Ekos

# Comment
source: A scheduled Ekos job is failed
fr: Échec de la tâche planifiée Ekos

# Name
source: Imaging in scheduled Ekos job started
fr: L'acquisition a démarré pour la tâche planifiée Ekos

# Comment
source: An image sequence capture is started in a scheduled Ekos job
fr: Une acquisition de séquence d'images a démarré avec une tâche planifiée Ekos

# Name
source: Imaging in scheduled Ekos job finished
fr: L'acquisition est terminée pour la tâche planifiée Ekos

# Comment
source: An image sequence capture is finished in a scheduled Ekos job
fr: Une acquisition de séquence d'images est terminée avec une tâche planifiée Ekos

# Name
source: Telescope is synced in a scheduled Ekos job
fr: Le télescope est synchronisé avec une tâche planifiée Ekos

# Comment
source: The telescope is synced before tracking a new target in a scheduled Ekos job
fr: Le télescope est synchronisé avant de poursuivre une nouvelle cible avec une tâche planifiée Ekos

# Name
source: Captured image received
fr: Image acquise reçue

# Name
source: Known Issue
fr: Problèmes connus

# Comment
source: Desktop Planetarium
fr: Un planétarium sur votre bureau

# GenericName
source: Desktop Planetarium
fr: Un planétarium sur votre bureau

# Name
source: Save Astrometry Index File to a write protected directory
fr: Enregistrer le fichier d'index d'astrométrie vers un dossier protégé en écriture

# Description
source: KStars is attempting to save an Astrometry Index File to a directory owned by root
fr: KStars est en attente d'enregistrement d'un fichier d'index d'astrométrie vers un dossier propriété du superutilisateur

# Name
source: Remove an Astrometry Index File Set
fr: Supprimer un ensemble de fichiers d'index d'astrométrie

# Description
source: KStars is attempting to remove Astrometry Index Files owned by root
fr: KStars est en attente de suppression de fichiers d'index d'astrométrie, propriétés du superutilisateur
