Repository: gstax/kstars_trad_fr
Catalog: kstars_ekos-profile-editor.po
Languages: fr

source: <title>Profile Editor</title>
fr: <title>Modificateur de profil</title>

source: Tools
fr: Outils

source: <tertiary>Profile Editor</tertiary>
fr: <tertiary>Modificateur de profil</tertiary>

source: <screeninfo>Profile Editor</screeninfo>
fr: <screeninfo>Modificateur de profil</screeninfo>

source: <phrase>Profile Editor</phrase>
fr: <phrase>Modificateur de profil</phrase>

source: Profiles
fr: Profils

source: You can define profiles for your equipment and their connection mode using the <guilabel>Profile Editor</guilabel>. Ekos comes pre-installed with the <guimenuitem>Simulators</guimenuitem> profile which can be used to start simulator devices for demonstration purposes:
fr: Vous pouvez définir des profils pour votre matériel et leur mode de connexion en utilisant le <guilabel>Modificateur de profil</guilabel>. Ekos est livré avec le profil <guimenuitem>Simulateurs</guimenuitem> qui peut être utilisé pour démarrer des périphériques de simulations à des fins de démonstrations :

source: <guilabel>Connection Mode</guilabel>: Ekos can be started either locally or remotely. Local mode is when Ekos is running in the same machine as INDI server, &ie; all the devices are connected directly to the machine. If you run INDI server on a remote machine (for example, on a Raspberry PI), you need to set the INDI server host and port.
fr: <guilabel>Mode de connexion</guilabel> : Ekos peut être démarré soit en local soit à distance. Le mode en local es quand Ekos tourne sur la même machine que le serveur INDI, &ie; tous les périphériques sont connectés directement (physiquement) à la machine. Si vous exécutez le serveur INDI sur une machine distante (par exemple sur un Raspberry PI), vous devez configurer l'adresse de l'hôte du serveur INDI ainsi que son port d'écoute.

source: <guilabel>Auto Connect</guilabel>: Check this option to enable automatic connection to all your devices after INDI server is started. If unchecked, INDI devices are created but not automatically connected. This is useful when you want to make changes to the driver (&eg; change baud rate or IP address or any other settings) <emphasis>before</emphasis> you connect to it.
fr: <guilabel>Connexion automatique</guilabel> : sélectionnez cette option pour activer la connexion automatique de tous vos périphériques après le démarrage du serveur INDI. Si vous ne choisissez pas cette option, les périphériques INDI seront créés mais ne seront pas automatiquement connectés. Cela est utile lorsque vous souhaitez modifier le pilote (&ie; modifier le débit en bauds, l'adresse IP ou tout autre réglage) <emphasis>avant</emphasis> la connexion.

source: <guilabel>Site Info</guilabel>: Optionally, you can check the <guilabel>Site Info</guilabel> checkbox and Ekos will load the <emphasis role="bold">current</emphasis> city and timezone whenever is Ekos is started with this profile. This can be useful when connecting to the remote geographic site so that Ekos is in sync location and time wise.
fr: <guilabel>Informations du site</emphasis> : sélectionnez cette option si vous souhaitez qu'Ekos charge les données d'emplacement et de fuseau horaire <emphasis role="bold">courantes</emphasis> au démarrage avec ce profil. Cela peut être utile lorsque vous vous connectez à un site géographiquement distant et pour qu'Ekos puisse se synchroniser.

source: <guilabel>Guiding</guilabel>: Select which Guide application you want to use for guiding. By default, the Ekos internal Guide Module is utilized. External guiders include PHD2 and LinGuider.
fr: <guilabel>Guidage</guilabel> : sélectionnez l'application de guidage que vous souhaitez utiliser. Par défaut Ekos utilise le module de guidage interne. Les applications externes incluent PHD2 et LinGuider.

source: <guilabel>INDI Web Manager</guilabel>: StellarMate Web Manager is a web-based tool to start and stop INDI drivers. You should always check this option when connecting remotely to a StellarMate unit.
fr: <guilabel>Gestionnaire Web INDI</guilabel> : le gestionnaire web de StellarMate est un outil web pour démarrer et éteindre les pilotes INDI. Vous devriez toujours choisir cette option quand vous connectez à distance à un appareil StellarMate.

source: <guilabel>Device Selection</guilabel>: Select your devices from each category. Please note that if you have a CCD with a guide head, you can leave the guider drop-down menu <emphasis>blank</emphasis> as Ekos will auto-detect the guide head from the CCD camera. Similarly, if your CCD includes embedded filter wheel support, then you do <emphasis>not</emphasis> need to specify the filter wheel device in the filter drop-down menu.
fr: <guilabel>Sélection de périphériques</guilabel> : sélection de périphériques par catégories. Veuillez noter que si vous possédez un CCD avec un guide, vous pouvez laisser <emphasis>vide</emphasis> la liste déroulante du guide puisqu'Ekos détectera automatiquement le guide depuis le CCD. De même, si votre CCD intègre une roue à filtres, vous ne devez <emphasis>pas</emphasis> spécifier de périphérique de roue à filtre dans le menu de la liste déroulante.

source: Start &amp; Stop INDI
fr: Démarrer &amp; Arrêter INDI

source: Start and Stop INDI services. Once INDI server is established, INDI Control Panel will be displayed. Here you can change some driver options such as which port the device is connected to &etc;
fr: Démarrer et arrêter les services INDI. Le panneau de contrôle de INDI sera affiché dès que le serveur INDI aura démarré. Vous pouvez modifier ici quelques options des pilotes comme les ports de connexion &etc;

source: Connect &amp; Disconnect Devices
fr: Connecter &amp; Déconnecter les périphériques

source: Connect to INDI server. Based on the devices connected, Ekos modules (CCD, Focus, Guide, &etc;) will be established and available to use.
fr: Connexion au serveur INDI. Selon les périphériques connectés, les modules EKOS (CCD, Mise au point, Guidage, &etc;) seront démarrés et prêt à être utilisés.

source: Once you are ready, click <guibutton>Start INDI</guibutton> to establish INDI server and connection to your equipment. Ekos shall create the various module icons (Mount, Capture, Focus, &etc;) as the connection is established with the device.
fr: Dès que vous êtes prêt, vous pouvez cliquer sur <guibutton>Démarrer INDI</guibutton> pour démarrer le serveur INDI et connecter votre matériel. Ekos créera les icônes des modules (Monture, Acquisition, Mise au point, &etc;) au fur et à mesure que la connexion aux différents périphériques sera effective.
