Repository: gstax/kstars_trad_fr
Catalog: org.kde.kstars.appdata.po
Languages: fr

source: Desktop Planetarium
fr: Planétarium de bureau

source: KStars is freely licensed, open source, cross-platform Astronomy Software by KDE.
fr: KStar est un logiciel d'astronomie sous licence libre, « Open Source » et multi-plate-forme de KDE.

source: It provides an accurate graphical simulation of the night sky, from any location on Earth, at any date and time. The display includes up to 100 million stars, 13,000 deep-sky objects,all 8 planets, the Sun and Moon, and thousands of comets, asteroids, supernovae, and satellites.
fr: Il fournit une simulation graphique précise du ciel nocturne, de n'importe quel endroit sur Terre, à toute date et toute heure. L'affichage comporte plus de 100 millions d'étoiles, 13 000 objets du ciel lointain, toutes les huit planètes, le Soleil et la Lune, des milliers de comètes, d'astéroïdes, supernova et satellites.

source: For students and teachers, it supports adjustable simulation speeds in order to view phenomena that happen over long timescales, the KStars Astrocalculator to predict conjunctions, and many common astronomical calculations.
fr: Pour les élèves et les enseignants, il prend en charge des vitesses de simulation ajustables, afin d'afficher des phénomènes arrivant sur de longues périodes de temps. Le module « Astrocalculator » de KStars effectue les prédictions de conjonctions et de nombreux calculs classiques d'astronomie.

source: For the amateur astronomer, it provides an observation planner, a sky calendar tool, and an FOV editor to calculate field of view of equipment and display them. Find out interesting objects in the "What's up Tonight" tool, plot altitude vs. time graphs for any object, print high-quality sky charts, and gain access to lots of information and resources to help you explore the universe!
fr: Pour l'astronome amateur, il fournit un planificateur d'observation, un outil de calendrier pour le ciel et un éditeur « FOV » (Field Of View) pour calculer le champs d'observation des équipements et les afficher. Vous pouvez aussi trouver des objets intéressants dans l'outil « Quoi de neuf ce soir », tracer une courbe altitude /temps pour n'importe quel objet, imprimer des cartes du ciel en haute qualité et avoir accès à beaucoup d'autres informations et ressources pour vous aider à explorer l'univers !

source: Included with KStars is Ekos astrophotography suite, a complete astrophotography solution that can control all INDI devices including numerous telescopes, CCDs, DSLRs, focusers, filters, and a lot more. Ekos supports highly accurate tracking using online and offline astrometry solver, autofocus and autoguiding capabilities, and capture of single or multiple images using the powerful built in sequence manager.
fr: Faisant partie de KStars, la suite d'astrophotographie Ekos est une solution complète d'astrophotographie, contrôlant tous les périphériques « INDI », dont de nombreux télescopes, des caméras « CCD », des appareils photo « DSLR », des viseurs, des filtres et bien plus. Ekos prend en charge le suivi en haute précision en utilisant des résolveurs en ligne ou hors ligne, des capacités d'autofocus et d'autoguidage et la capture d'images simples ou multiples grâce à un puissant outil de gestionnaire de séquence.

source: Astronomical Catalogs:
fr: Catalogues astronomiques :

source: Default catalog consisting of stars to magnitude 8
fr: Le catalogue par défaut contient des étoiles de magnitude 8

source: Extra catalogs consisting of 100 million stars to magnitude 16
fr: D'autres catalogues contiennent 100 millions d'étoiles de magnitude 16

source: Downloadable catalogs including Messier Images, Abell Planetary Nebulae, Sharpless Catalog, Lynds Dark Nebula Catalog
fr: Les catalogues pouvant être téléchargés contiennent des images de Messier, les nébuleuses planétaires de Abell, le catalogue « Sharpless » et le catalogue de nébuleuses « Lynds Dark ».

source: Corrections for precession, nutation and atmospheric refraction
fr: Corrections pour la précession, la nutation et les réfractions atmosphériques.

source: Tools for retrieval of data from online databases
fr: Outils pour télécharger des données à partir de bases de données en ligne

source: KStars main window
fr: Fenêtre principale de KStars

source: "What's interesting" tool in KStars
fr: Outil « Quoi d'intéressant » de KStars

source: Ekos tool in KStars
fr: Outil Ekos de KStars

source: Observation Planner of KStars
fr: Planificateur d'observation de KStars
