Repository: gstax/kstars_trad_fr
Catalog: documentation/kstars/kstars_cosmicdist.po
Languages: fr

source: <title>Cosmic Distance Ladder</title>
fr: <title>Échelle de distances cosmiques</title>

source: <primary>Cosmic Distance Ladder</primary>
fr: <primary>Échelle de distances cosmiques</primary>

source: The cosmic distance ladder refers to the succession of different methods that astronomers use to measure distances to objects in the sky. Some methods, like <link linkend="ai-parallax">parallax</link>, work well for only nearby objects. Other methods, like using the <firstterm>cosmological redshift</firstterm>, work only for very distance galaxies. Thus, there are several methods, each with its own limited validity, and hence the name.
fr: L'échelle de distances cosmiques se réfère à une succession de différentes méthodes que les astronomes utilisent pour mesurer les distances aux astres dans le ciel. Quelques méthodes, comme la <link linkend="ai-parallax">parallaxe</link>, fonctionne mieux uniquement pour les astres proches. D'autres méthodes, comme l'utilisation du <firstterm>décalage cosmique vers le rouge</firstterm> (redshift), fonctionne mieux pour les galaxies très éloignées. Ainsi, il y a plusieurs méthodes, chacune avec leur validité limitée et leur nom.

source: Direct measurements
fr: Mesures directes

source: The bottom of the ladder consists of objects whose distances can be directly measured, like the moon (see <ulink url="https://en.wikipedia.org/wiki/Lunar_Laser_Ranging_experiment">Lunar Laser Ranging</ulink>). The same technique, using radio waves, is applied to find distances to planets as well.
fr: La base de l'échelle consiste en des astres pour lesquelles les distances peuvent être directement mesurées, comme la lune (veuillez consulter <ulink url="https://fr.wikipedia.org/wiki/R%C3%A9flecteur_lunaire">Mesure de distance lunaire par laser</ulink>). La même technique, utilisant des ondes radio, est appliquée pour trouver la distance à des planètes par exemple.

source: For nearby stars, measuring the <link linkend="ai-parallax">parallax</link> is possible and yields the distance to the star.
fr: Pour les astres proches, la mesure par <link linkend="ai-parallax">parallaxe</link> est possible et fournit la distance à l'étoile.

source: Standard candles
fr: Objets lumineux standards

source: "Standard candles" are objects whose intrinsic brightnesses we can know for sure. The apparent <link linkend="ai-magnitude">magnitude</link>, which is easy to measure, tells us how bright an object appears, not how bright it actually is. Distant objects appear less brighter, because their light gets spread out over a larger area.
fr: Les « Objets lumineux standards » sont des objets dont l'éclat intrinsèque est bien connu. La <link linkend="ai-magnitude">magnitude</link> apparente, qui est facile à mesurer, nous indique la luminosité telle qu'elle nous apparaît et non sa luminosité réelle. Les objets distants sont moins lumineux parce que leur lumière se disperse sur de grandes zones.

source: In accordance with the <firstterm>inverse square law</firstterm> for light intensities, the amount of light we receive from an object drops with the distance squared. Thus, we may compute the distance to an object if we know both how bright it actually is (absolute magnitude; 'M') and how bright it appears to us on earth (apparent magnitude; 'm'). We may define the <firstterm>distance modulus</firstterm> as follows:
fr: En accord avec la <firstterm>loi du carré inverse</firstterm> pour l'intensité lumineuse, la quantité de lumière que nous recevons d'un objet diminue avec le carré de la distance. Ainsi, la distance à l'objet peut être calculée si l'intensité courante est connue (magnitude absolue : « M » ) ainsi que l'intensité observée sur terre (magnitude absolue : « m » ). Le <firstterm>module de distance</firstterm> doit être défini comme suit :

source: Distance Modulus = M - m = 5 log<subscript>10</subscript> d - 5
fr: Modulo de distance = M - m = 5 log<subscript>10</subscript> d - 5

source: Here 'd' is the distance measured in <link linkend="ai-parallax">parsecs</link>.
fr: Dans cet exemple, la distance « d » est mesurée en <link linkend="ai-parallax">parsecs</link>.

source: For these special standard candle objects, we have some other way of knowing their intrinsic brightness, and thereby can calculate their distance.
fr: Pour des objets lumineux standards spéciaux, il existe certaines autres façons de calculer l'intensité intrinsèque et par conséquent de calculer leurs distances.

source: Common "standard candles" used in astronomy are:
fr: Les objet lumineux standards les plus communs utilisés en astronomie sont :

source: Cepheid Variables: A kind of periodic variable star, whose variation period is related to the luminosity
fr: Céphéide Variables : une variété d'étoiles périodiques variable, dont la période de variation est liée à son intensité

source: RR Lyrae Variables: Another such periodic variable star with a well-known period-luminosity relationship
fr: Variables RR de la Lyre : une autre variété d'étoiles variables périodiques avec une relation parfaitement connue entre période et intensité

source: Type-Ia supernovae: These supernovae have a very well-defined luminosity as a result of the physics that governs them and hence serve as standard-candles
fr: Supernova de type Ia : ces supernova ont une intensité parfaitement connue comme le résultat des lois de physique qui les gouvernent et qui sont utilisées comme des objets lumineux standards

source: Other methods
fr: Autres méthodes

source: There are many other methods. Some of them rely on the physics of stars, such as the relationship between luminosity and color for various types of stars (this is usually represented on a <firstterm>Hertzsprung-Russel Diagram</firstterm>). Some of them work for star clusters, such as the <firstterm>Moving cluster method</firstterm> and the <firstterm>main-sequence fitting method</firstterm>. The <firstterm>Tully-Fisher relation</firstterm> that relates the brightness of a spiral galaxy to its rotation can be used to find the distance modulus, since the rotation of a galaxy is easy to measure using <firstterm>Doppler shift</firstterm>. Distances to distant galaxies may be found by measuring the <firstterm>Cosmological redshift</firstterm>, which is the redshift of light from distance galaxies that results from the expansion of the universe.
fr: Il a de nombreuses autres méthodes. Quelques-unes d'entre elles reposent sur la physique des étoiles telles que la relation entre la luminosité et la couleurs de types variables d'étoiles (cela est généralement représenté par le <firstterm>diagramme de Hertzsprung-Russel</firstterm>). Quelques-unes d'entre elles fonctionnent avec des groupes d'étoiles, telles que la <firstterm>méthode des groupes en déplacement</firstterm> et de la <firstterm>méthode de correspondance à la séquence principale</firstterm>. La <firstterm>relation de Tully-Fisher</firstterm> qui relie l'intensité d'une galaxie spirale à sa rotation, peut être utilisée pour trouver le module de distance, puisque la rotation d'une galaxie se mesure facilement en utilisant <firstterm>le décalage de l'effet Doppler</firstterm>.

source: For further information, consult <ulink url="https://en.wikipedia.org/wiki/Cosmic_distance_ladder">Wikipedia on Cosmic Distance Ladder</ulink>
fr: Pour plus d'informations, veuillez consulter <ulink url="https://fr.wikipedia.org/wiki/Mesure_des_distances_en_astronomie">Wikipédia sur les échelles de distances cosmiques</ulink>
