Repository: gstax/kstars_trad_fr
Catalog: website/kstars-kde-org.po
Languages: fr

source: Details on building KStars git master are [here](https://invent.kde.org/education/kstars/-/blob/master/README.md);
fr: Les détails pour compiler KStars à partir de git master est [ici](https://invent.kde.org/education/kstars/-/blob/master/README.md) ;

source: Some junior and not-so-junior jobs [here](http://techbase.kde.org/Projects/Edu/KStars/JuniorJobs)!
fr: Quelques tâches simples et moins simples se trouvent [ici](http://techbase.kde.org/Projects/Edu/KStars/JuniorJobs) !

source: [Git repository](https://invent.kde.org/education/kstars) — hosts the latest code of KStars
fr: Le [dépôt Git](https://invent.kde.org/education/kstars) héberge le code le plus récent de KStars

source: [KStars API](https://api.kde.org/kstars/html/index.html) — KStars API documentation
fr: La documentation de l'[API de KStars](https://api.kde.org/kstars/html/index.html)

source: [GSoC Guide](/gsoc) — Google Summer of Code guide for new prospective students.
fr: Le [guide GSoC](/gsoc) du Google Summer of Code pour les étudiants.

source: Get Involved
fr: Participez

source: Screenshots
fr: Captures d'écran

source: KStars Primary Window
fr: Fenêtre principale de KStars

source: Billions and Billions: 100 million stars using USNO Nomad Catalog
fr: Des milliard et des milliard : 100 millions d'étoiles en utilisant le catalogue USNO Nomad

source: Popup menu
fr: Menu contextuel

source: Detail dialog: Examining Detailed info for M42
fr: Fenêtre de dialogue des détails : info détaillée pour M42

source: Astrocalculator
fr: Calculatrice astronomique

source: Sky Calender
fr: Calendrier céleste

source: Ekos Astrophotography Tool
fr: Outil d'astrophotographie d'Ekos

source: FOV Editor
fr: Modificateur de champ de vue

source: Observation Planner: With Altitude vs. Time tool
fr: Planificateur d'observations : avec graphique de l'élévation en fonction du temps

source: Solar System Tool: With Jupiter moon tool
fr: Outil du système solaire : avec l'outil des lunes de Jupiter

source: Get More Data Online
fr: Obtenez davantage de données en ligne

source: What is up tonight tool
fr: Outil « Dans le ciel cette nuit »

source: Constellation Art
fr: Art des constellations

source: Explore Galaxy with What is Interesting
fr: Explorer la Galaxie avec l'outil « Digne d'intérêt »

source: What is Interesting Tool
fr: Outil « Digne d'intérêt »

source: Other resources
fr: Autres ressources

source: [KStars Deep Sky Catalogs](/catalogs) — Catalogs documentation
fr: [Catalogues du ciel profond de KStars](/catalogs/) - documentation des catalogues

source: [Ekos](https://www.indilib.org/about/ekos.html) — Complete astrophotography and observatory control framework
fr: [Ekos](https://www.indilib.org/about/ekos.html) - Suite complète d'astrophotographie et de contrôle d'observatoire

source: [INDI](https://www.indilib.org/index.php?title=Main_Page) — protocol to operate astronomical instruments
fr: [INDI](https://www.indilib.org/index.php?title=Main_Page) - protocole pour contrôler les instruments astronomiques

source: Check out these other free and open source astronomy software
fr: Jetez un œil à ces autres programmes d'astronomie libres

source: [Stellarium](https://www.stellarium.org/): Stellarium has the most aesthetic rendering of the sky map. Ideal for giving public shows. Has a larger star catalog than KStars. It can distort images for projection on fish-eye planetarium projectors.
fr: [Stellarium](https://www.stellarium.org/) : Stellarium offre la présentation la plus esthétique d'une carte du ciel. Idéal pour des présentations publiques. Possède un catalogue d'étoiles plus étoffé que KStars. Il peut déformer les images pour une projection sur des projecteurs de planétariums fish-eye.

source: [SkyChart (Cartes du Ciel)](https://www.ap-i.net/skychart/): Cartes du Ciel has the largest database of astronomical objects for any free software. It has support for the very very extensive star catalog, PPMXL. Also has tons of other downloadable catalogs.
fr: [SkyChart (Cartes du Ciel)](https://www.ap-i.net/skychart/) : Cartes du ciel possède la plus grande base de données d'objets astronomiques de tous les programmes libres d'astronomie. Il gère le très vaste catalogue d'étoiles PPMXL, et permet également de télécharger beaucoup d'autres catalogues.

source: User Support
fr: Aide aux utilisateurs

source: Release Notes
fr: Notes de publication

source: Version %1 (released on %2)
fr: Version %1 (publiée le %2)

source: Other download options
fr: Autres options de téléchargement

source: **KStars** caters to a wide-variety of use cases. Whether you are a student, an educator, an amateur astronomer or an astronomy enthusiast, you will find tools in KStars that are useful to you. Have a look at the [Features](/features/) page for a full listing of features, organized by use case.
fr: **KStars** répond aux besoins d'une large variété de cas d'application. Que vous soyez un étudiant, un formateur ou un amateur passionné d'astronomie, vous trouverez des outils dans KStars qui vous seront utiles. Jetez un œil à la page des [Fonctionnalités](/features/) pour une liste complète organisées par cas d'application.

source: The latest version is %1, released on %2
fr: La dernière version est la %1, publiée le %2

source: [64bit KStars %1 Installer](%2) for Windows 10 or later
fr: [Installateur de KStars 64bit %1](%2) pour Windows 10 ou ultérieur

source: Use [Quick Hash GUI](%1) to verify the integrity of the executable file.
fr: Utilisez [l'interface graphique Quick Hash](%1) pour vérifier l'intégrité du fichier exécutable.

source: [64bit KStars %1 Installer](%2) for macOS %3
fr: [Installateur de KStars 64bit %1](%2) pour macOS %3

source: After mounting the DMG, please follow the instructions within the DMG.
fr: Veuillez suivre les instructions après avoir monté le fichier DMG.

source: Install KStars from your Linux distribution [software center](appstream://org.kde.kstars.desktop).
fr: Installer KStars depuis votre [magasin d'applications](appstream://org.kde.kstars.desktop) de votre distribution Linux.

source: Under Ubuntu/Mint, you can install the latest KStars by typing the following commands in the console:
fr: Sous Ubuntu/Mint, vous pouvez installer la dernière version de KStars en tapant les commandes suivantes dans un terminal :

source: Add flathub repository:
fr: Ajouter le dépôt flathub :

source: Install KStars:
fr: Installer KStars

source: Install the [latest and stable KStars](%1) on many linux distributions using Snap.
fr: Installer la [dernière version stable de KStars](%1) sur beaucoup de distributions Linux en utilisant Snap.

source: Building from source
fr: Compilation depuis les sources

source: Source tarball
fr: Archive tar des sources

source: Mirror list
fr: Liste de miroirs

source: See [Building KStars from Source](%1) for details.
fr: Lisez [Compiler KStars depuis les sources](%1) pour les détails.

source: You are most welcome to tell us about your problems with KStars on our [mailing list](https://mail.kde.org/mailman/listinfo/kstars-devel) or our [Web Chat channel](https://webchat.kde.org/#/room/#kstars:kde.org) where you can chat directly with developers and users. For some of these issues, there are temporary workarounds, and asking on the mailing list will help you discover these antidotes for symptomatic relief. We welcome your feedback, and discussion on both the mailing list and Web Chat channel. See the [Get Involved](/get-involved) page for more information and pointers.
fr: Vous êtes encouragé à nous partager vos problèmes avec KStars sur notre [liste de diffusion](https://mail.kde.org/mailman/listinfo/kstars-devel) ou notre [canal de discussion chat](https://webchat.kde.org/#/room/#kstars:kde.org) où vous pourrez discuter en direct avec des développeurs et des utilisateurs. Certains problèmes peuvent être réglés temporairement et un appel à l'aide sur la liste de diffusion aidera à trouver des réponses claires à ces problèmes. Tout retour est le bienvenu sur la liste de discussion et le canal Web de chat. Voyez la page [Participez](/get-involved) pour davantage d'information et des liens utiles.

source: KStars has a lot of known issues, and many unknown issues. In either case, reporting a bug is always helpful. To report a bug against KStars, you can use the KDE [bug reporting interface](https://bugs.kde.org/). Choose "kstars" as the product to file the bug against.
fr: KStars a beaucoup de problèmes connus et d'autres inconnus. Dans les deux cas, rapporter un bogue est toujours utile. Pour rapporter un bogue de KStars, vous pouvez utiliser l'[interface de rapport de bogues](https://bugs.kde.org/) de KDE. Choisissez « kstars » comme produit pour enregistrer un rapport de bogue.
