Repository: gstax/kstars_trad_fr
Catalog: website/kstars-kde-org.po
Languages: fr

source: The most feature-rich free astronomy software
fr: L'application d'astronomie libre la plus riche en fonctionnalités

source: Resources
fr: Ressources

source: Donate
fr: Donation

source: KStars - Desktop Planetarium
fr: KStars - Planetarium de bureau

source: Graphical simulation of the sky with the planets, up to 100 million stars, 10000 deep-sky objects, comets and asteroids. Adjustable simulation rate.
fr: Simulation graphique du ciel avec les planètes, avec plus de 100 millions d'étoiles et 10000 objects du ciel profond, des comètes et des astéroïdes. Taux de simulation ajustable.

source: Access to several internet resources for information, imagery and data
fr: Accès à plusieurs sources d'information sur internet, imagerie et données

source: Complete astrophotography workflow
fr: Flux d'astrophotographie complet

source: A host of tools that predict conjunctions, plot time variation of positions of planets, perform calculations etc.
fr: Un ensemble d'outils de prédiction des conjonctions, affichage de la position des planètes en fonction du temps, réalisation de calculs astronomiques, etc…

source: Powerful observation planner to plan your observations
fr: Planificateur d'observations puissant pour préparer vos observations

source: Download
fr: Téléchargement

source: Features organized by use-case
fr: Fonctionnalités organisées selon des cas d'application

source: Pick your use case to see what KStars can do for you:
fr: Choisissez votre cas d'application pour voir ce que KStars peut faire pour vous :

source: [Education](#features-for-educators)
fr: [Éducation](#features-for-educators)

source: [Astrophotography](#features-for-imaging--astrophotography)
fr: [Astrophotographie](#features-for-imaging--astrophotography)

source: [Visual Observation](#features-for-visual-observation)
fr: [Observation visuelle](#features-for-visual-observation)

source: [Astronomy Enthusiasts](#features-for-any-astronomy-enthusiast)
fr: [Passionnés d'astronomie](#features-for-any-astronomy-enthusiast)

source: Features for Educators
fr: Fonctionnalités pour formateurs

source: If you are an instructor, you could recommend KStars to your students for use as a learning aid. If you're a student, you can learn about the sky using KStars.
fr: Si vous êtes un formateur, vous pouvez recommander KStars à vos étudiants comme outil d'aide à la formation. Si vous êtes étudiant, vous pouvez découvrir le ciel avec KStars.

source: Here are some things you can do in KStars to explore astronomy and astrophysics:
fr: Voici ce que vous pouvez faire avec KStars pour explorer l'astronomie et l'astrophysique :

source: Change your geographic location to see how the view of the sky changes with latitude
fr: Modifier votre position géographique pour voir comment le ciel change avec la latitude

source: Understand the difference between sidereal days and solar days by changing the speed of simulation
fr: Comprendre la différence entre les jours sidéraux et jours solaires en changeant la vitesse de la simulation

source: Attach trails to planets and set a high simulation rate to see their trajectories as they perform retrograde motion
fr: Attacher des trainées aux planètes et choisir un taux de simulation plus élevé pour voir leur trajectoire et leur mouvement rétrograde

source: When technical terms are underlined in blue, click on them to bring up an explanation from the included AstroInfo project
fr: Les termes techniques soulignés en bleu sont cliquables et affichent une explication provenant du projet AstroInfo

source: Explore coordinate systems by switching between equatorial and horizontal coordinates, and perform coordinate conversions in the KStars Astrocalculator
fr: Explorer les systèmes de coordonnées en basculant entre les coordonnées équatoriales et horizontales, et réaliser des conversions de coordonnées dans la calculatrice de KStars

source: Learn about various topics in astronomy and astrophysics through the AstroInfo project (part of the KStars Handbook accessible through the Help menu).
fr: En apprendre davantage sur divers sujets d'astronomie et d'astrophysique grâce au projet AstroInfo (qui fait partie du manuel de KStars accessible dans le menu Aide).

source: Set the time ahead by a couple 1000 years to see the effects of precession
fr: Avancer l'heure de plusieurs milliers d'années pour voir les effets de la précession

source: Switch on and switch off gravitational lensing effects around the sun to understand Eddington's experiment
fr: (Dés)activer les effets de lentilles gravitationnelles autour du Soleil pour comprendre l'expérience d'Eddigton

source: Switch to equatorial coordinates, set simulation rate to 1 year, double click on a star to keep it in focus, and zoom in to see the effects of aberration of light
fr: Basculer vers les coordonnées équatoriales, fixer le taux de simulation à une année, double-cliquer sur une étoile pour la garder en ligne de mire et zoomer pour se rendre compte des effets d'aberration de la lumière

source: Switch to equatorial coordinate, set simulation rate to 1 year, double click on an empty region, to see the effects of precession and nutation.
fr: Basculer vers les coordonnées équatoriales, fixer le taux de simulation à une année, double-cliquer dans une région vide pour voir les effets de précession et de nutation.

source: Set the time to the distant future to see how the constellations change shape due to the proper motions of stars (prominent in Gemini, for example)
fr: Régler l'heure dans un futur distant pour voir comment la forme des constellations change en fonction du mouvement propre des étoiles (important pour Gemini par exemple)

source: Right click on any object and open the Details view to easily access lots of information, internet resources, images and professional surveys.
fr: Un clic droit sur n'importe quel objet ouvre la vue Détails qui permet d'avoir facilement accès à beaucoup d'information comme des ressources sur Internet, des images et des relevés professionnels.

source: Obtain sky survey images for any location from the right-click context menu
fr: Obtenir des images de relevés célestes pour n'importe quelle position à partir du menu contextuel

source: Control your observatory using KStars' [extensive support for astronomy equipment](/indi/).
fr: Contrôler votre observatoire en utilisant KStars [gestion complète de l'équipement astronomique](/indi/).

source: KStars speaks your language — you are very likely to find a translation / localization for your region.
fr: KStars parle votre langue - il y a de fortes chances de trouver une traduction/localisation pour votre région.

source: Features for Imaging / Astrophotography
fr: Fonctionnalités pour l'imagerie et l'astrophotographie

source: Whether you are at a professional observatory, or an amateur astrophotographer, KStars can help you image the sky. The Ekos imaging suite provides you with a smooth hassle-free workflow, removing the need to switch between multiple software tools for each part of the workflow.
fr: Que vous soyez dans un observatoire professionnel ou un astrophotographe amateur, KStars peut vous aider à prendre des images du ciel. La suite Ekos pour l'imagerie fournit un flux de travail simple, supprimant le besoin de basculer entre plusieurs programmes pour chaque partie du flux de travail.

source: With extensive support for [INDI](/indi/), KStars can control almost any sort of astronomical equipment, including telescope mounts, motorized focusers, filter wheels and CCD and CMOS cameras.
fr: La gestion complète d'[INDI](/indi/) permet à KStars de contrôler presque tous les équipements d'astronomie, ce qui inclut les montures de télescope, les moteurs de mise au point, les roues à filtres ainsi que les caméras CCD et CMOS.

source: Use the FOV calculator to calculate the field-of-view of your imaging setup
fr: Utilisez la calculatrice de champ de vue pour calculer le champ de vue de votre équipement d'imagerie

source: [Ekos](https://indilib.org/about/ekos.html), KStars' astrophotography suite, provides a complete astrophotography workflow within KStars. Ekos can help with polar alignment, focusing, auto-guiding, and capture.
fr: [Ekos](https://indilib.org/about/ekos.html), la suite astrophotographique de KStars fournit un flux de travail complet pour l'astrophotographie directement dans KStars. Ekos est d'une précieuse aide pour l'alignement polaire, la mise au point, le guidage automatique et l'acquisition.

source: The FITS Viewer lets you view FITS data files.
fr: L'afficheur FITS permet d'afficher des fichiers de données au format FITS.

source: Calculate conjunctions between celestial objects to find rendezvous that you can capture.
fr: Calculer les conjonctions entre les objets célestes pour trouver les meilleurs moments d'acquisition.

source: Features for Visual Observation
fr: Fonctionnalités pour l'observation visuelle

source: KStars has an extensive set of features that enhance your visual observation workflow. With the observation planner, all you need to do is add objects to your list. KStars takes care of ordering them in observing order, and with one click, lets you download DSS images for off-line comparison for observing sites where internet access is unavailable or poor. If you cannot take your laptop to your observing site, you can always export high-quality vector-graphic images of the sky that you can print for use as finder charts.
fr: KStars possède un vaste ensemble de fonctionnalités pour améliorer le flux de travail pour l'observation visuelle. Avec le planificateur d'observations, tout ce qu'il vous reste à faire est d'ajouter des objets à votre liste. KStars s'occupe de les ordonner et d'un clic, télécharge des images DSS pour une comparaison hors-ligne pour des sites d'observation dont la connexion internet est défaillante ou indisponible. Si vous ne pouvez pas prendre votre portable sur le site d'observation, il est toujours possible d'exporter des images vectorielles de haute qualité pour impression.

source: With stars down to 16th magnitude, finding sufficient reference stars in the field is easy.
fr: Avec des étoiles allant jusqu'à la magnitude 16, il est facile de trouver des étoiles de référence dans le champ.

source: If you want more than a complete NGC/IC catalog, you can add your own custom catalogs of objects.
fr: Si vous avez besoin de plus que le catalogue complet NGC/IC, il est toujours possible d'ajouter vos propres catalogues d'objets.

source: The powerful observation planner in KStars will help you plan your observing session, put objects in observation order, and cache DSS images for offline comparison with only a few clicks.
fr: Le puissant planificateur d'observations de KStars vous aidera à planifier vos sessions d'observations en les arrangeant dans un ordre logique, et mettra en cache les images DSS pour une comparaison hors-ligne, et tout cela avec seulement quelques clics.

source: You can also log your observations in KStars (this feature needs more polish to be fully usable, though.)
fr: Vous pouvez aussi tenir un carnet de vos observations dans KStars (bien que cette fonctionnalité nécessite encore un peu de polissage pour être totalement utilisable).

source: KStars supports the OAL XML schema for observation logs, which makes these logs compatible with many software and log-sharing websites.
fr: KStars gère le schéma OAL XML pour les journaux d'observations, ce qui les rend compatibles avec la plupart des programmes et les sites de partage.

source: Calculate your telescope's FOV for various eyepieces and save them in KStars, so you can quickly switch between FOV indicators with Page Up / Page Down keys.
fr: Calculez le champ de vue de votre télescope pour divers oculaires et enregistrez-les dans KStars afin de pouvoir basculer rapidement entre ces différents indicateurs avec les touches Haut et Bas.

source: High quality finder charts allow you to do observation in places without electric power.
fr: Des graphiques en haute qualité vous permettent de faire des observations dans des lieux sans courant électrique.

source: Scripting support gives you the flexibility to write your own scripts to automate creation of finder charts etc.
fr: La gestion de scripts vous offre la flexibilité d'écrire vos propres scripts pour automatiser la création de graphiques, etc…

source: The experimental star-hopper feature automatically works out a star-hopping route from a star to a deep-sky object, given your field-of-view.
fr: La fonctionnalité encore expérimentale de saut entre étoiles calcule automatiquement une route entre étoiles à partir d'objet du ciel profond et de votre champ de vue.

source: The Jupiter's moons tool tells you the positions of Jupiter's Galilean moons, as is normally seen in astronomical ephemerides books.
fr: L'outil des lunes de Jupiter affiche la position des lunes de Jupiter comme dans tout éphéméride astronomique.

source: Configure KStars to alert you every time it learns of a new supernova in the sky!
fr: Configurez KStars pour vous alerter des nouvelles supernovae dans le ciel !

source: Predict conjunctions between celestial objects.
fr: Prédire les conjonctions entre les objets célestes.

source: Interface with XPlanet to render views of planets at any given time.
fr: L'interface avec XPlanet permet d'afficher des vue des planètes à n'importe quel moment.

source: Features for any astronomy enthusiast!
fr: Fonctionnalités pour tout passionné d'astronomie !

source: If you're new to astronomy, or are an enthusiast in general, KStars can be your guide as you explore the heavens. Already in the developers' version, KStars can auto-suggest objects for you to see in the night-sky.
fr: Si vous débutez en astronomie ou si vous êtes un passionné en général, KStars peut être votre guide pour explorer les cieux. KStars peut suggérer des objets à voir dans le ciel.

source: KStars renders an accurate representation of the sky, with the planets, Jupiter's moons, 100 million stars, 10000 deep-sky objects, comets and asteroids.
fr: KStars présente une représentation précise du ciel, avec les planètes, les lunes de Jupiter, plus de 100 millions d'étoiles, 10000 objets du ciel profond, des comètes et des astéroïdes.

source: Learn more about astronomy and astrophysics through the helpful information links and the included AstroInfo project pages.
fr: Apprenez-en davantage sur l'astronomie et l'astrophysique avec les liens d'information et les pages du projet AstroInfo.

source: (Coming very soon) Get predictions for interesting astronomical objects to observe with your equipment / sky conditions on any particular night.
fr: (Bientôt) Obtenez des prédictions pour des objets astronomiques intéressant à observer avec votre équipement et selon les conditions célestes de la nuit.

source: Full listing of important features
fr: Liste complète des fonctionnalités importantes

source: Features unique to KStars
fr: Fonctionnalités uniques de KStars

source: Unique features in KStars not found in other free astronomy software (to the best of our knowledge):
fr: Fonctionnalités uniques de KStars non présentes dans les autres programmes libres d'astronomie (à notre connaissance) :

source: Fetch sky images from Digitized Sky Surveys, and the internet in general.
fr: Obtention d'images du ciel à partir du relevé DSS, et de l'Internet en général.

source: Access information resources on sky objects from within KStars.
fr: Accès à des ressources d'informations sur les objets du ciel directement depuis KStars.

source: Print high-quality, highly customizable, star charts with multiple charts at different zoom levels for each object.
fr: Impression de haute qualité et personnalisation de graphiques d'étoiles dans de multiples niveaux de zoom pour chaque objet.

source: Full fledged astrophotography suite [Ekos](https://indilib.org/about/ekos.html) for a smooth imaging workflow
fr: Suite complète d'astrophotographie [Ekos](https://indilib.org/about/ekos.html) pour un flux de travail d'imagerie facilité

source: Plan and execute your observation sessions and save DSS images for offline use with the Observation Planner and "Execute" feature.
fr: Planifiez et exécutez vos sessions d'observations et enregistrez les images DSS pour un usage hors-ligne avec le planificateur d'observations et la fonctionnalité d'exécution.

source: Set up field of view symbols computed from your eyepiece and telescope focal length.
fr: Choix du symbole de champ de vue calculé à partie de votre oculaire et de la longueur focale.

source: Generate the locations of Jupiter's moons for the near future and near past and plot them as shown in professional astronomical ephemerides.
fr: Calcul des positions des lunes de Jupiter dans un proche passé et futur et les tracer comme dans les éphémérides professionnels.

source: Import your own custom catalogs from within KStars.
fr: Importation de vos propres catalogues depuis KStars.

source: Access some of KStars' internal calculations with the Astro-Calculator.
fr: Accès à quelques calculs internes de KStars avec la calculatrice Astro.

source: Supernova alerts: KStars can automatically alert you about new supernovae at startup!
fr: Alertes de supernovae : KStars peut vous alerter des nouvelles supernovae au démarrage !

source: Click on technical terms / astronomy jargon to open up an explanation from the included AstroInfo project.
fr: Clic sur des termes astronomiques pour afficher une explication à partir du projet AstroInfo.

source: Use your favorite map projection method to render the celestial sphere on a flat screen.
fr: Utilisation de votre méthode de projection favorite pour tracer la sphère céleste sur un écran plat.

source: A very powerful tool to find conjunctions and oppositions (somewhat experimental).
fr: Un outil très puissant pour trouver des conjonctions et oppositions (encore expérimental).

source: Compute star-hopping routes (experimental; incomplete but functional).
fr: Calcul du chemin de saut d'étoiles (encore expérimental mais fonctionnel).

source: Auto-suggest sky objects for beginners (coming soon).
fr: Suggestion automatique d'objets du ciel pour les débutants (arrive bientôt).

source: More translations and localization than most other software.
fr: Davantage de traductions et de localisation que la plupart des autres programmes.

source: Catalogs
fr: Catalogues

source: Default catalog consisting of stars to magnitude 8
fr: Le catalogue par défaut contient des étoiles jusqu'à la magnitude 8

source: Extra catalogs consisting of 100 million stars to magnitude 16
fr: Des catalogues additionnels contenant plus de 100 millions d'étoiles jusqu'à la magnitude 16

source: Default deep-sky NGC / IC catalog (about 10000 objects)
fr: Le catalogue par défaut du ciel profond NGC/IC (environ 10000 objets)

source: Download a more accurate revised NGC / IC catalog
fr: Téléchargement d'un catalogue NGC/IC révisé et plus précis

source: Downloadable catalogs including Messier Images, Abell Planetary Nebulae
fr: Plusieurs catalogues téléchargeables incluant des images des objets Messier et les nébuleuses planétaires d'Abell

source: Add your own custom catalogs
fr: Ajout de vos propres catalogues

source: Telescope / Equipment Control
fr: Contrôle de télescope et d'équipement

source: [Integration with INDI providing support for a wide range of astronomy instruments](/indi/)
fr: [Intégration avec INDI fournissant la gestion d'un grand ensemble d'instruments d'astronomie](/indi/)

source: Other
fr: Autre

source: Corrections for precession, nutation and atmospheric refraction
fr: Correction de la précession des équinoxes, de la nutation et de la réfraction atmosphérique

source: Tools for retrieval of data from Online Databases
fr: Outils pour l'obtention de données à partir de bases de données en ligne

source: Scriptable actions using D-Bus
fr: Actions scriptables avec D-Bus

source: Features for Educators and Students:
fr: Fonctionnalités pour formateurs et étudiants :

source: Adjustable simulation speed in order to view phenomena that happen over long timescales
fr: Vitesse de simulation ajustable afin de voir des phénomènes se déroulant sur les temps longs

source: Astroinfo project to help facilitate learning with the aid of KStars
fr: Le projet AstroInfo pour facilité l'apprentissage à l'aide de KStars

source: What's up tonight tool to see what objects are visible tonight
fr: L'outil « Quoi de neuf ce soir ? » pour visualiser les objets visible ce soir

source: Altitude vs Time tool to plot the time-variation in the altitude of an object (good to decide observation times)
fr: L'outil Élévation en fonction du temps pour tracer la variation en élévation d'un objet (utile pour décider des heures observations)

source: Sky Calendar tool to see how the planets move across the sky over a long duration of time
fr: L'outil de calendrier du ciel pour voir le mouvement des planètes dans le ciel sur de longues périodes de temps

source: Features
fr: Fonctionnalités

source: Interested in KStars? Found KStars useful? Come by our [mailing list](https://mail.kde.org/mailman/listinfo/kstars-devel) and share your suggestions, and tell us what you liked / what you did not like. Any feedback and help will be appreciated.
fr: Vous êtes intéressé par KStars et l'avez trouvé utile ? Venez partager vos suggestions sur la [liste de diffusion](https://mail.kde.org/mailman/listinfo/kstars-devel) et dites-nous ce que vous avez apprécié et ce qui pourrait être amélioré. Tout retour et aide sont les bienvenus.

source: If you know how to program, you're welcome to join our developer team! Get started by building [KStars from source](https://invent.kde.org/education/kstars/-/blob/master/README.md). The [community wiki](https://community.kde.org/Get_Involved/development) also provides resource about setting up your development environment. Most developer discussion happens on our [mailing list](https://mail.kde.org/mailman/listinfo/kstars-devel) or [issue tracker](https://invent.kde.org/education/kstars/-/issues), so if you need help, that's a good place to ask. KStars is written in C++ using [Qt](https://qt-project.org/) and [KDE](https://kde.org) libraries.
fr: Si vous êtes développeur, vous êtes le bienvenu pour rejoindre l'équipe de développeurs ! Commencez par compiler [KStars depuis les sources](https://invent.kde.org/education/kstars/-/blob/master/README.md). Le [wiki communautaire](https://community.kde.org/Get_Involved/development) fournit des informations pour mettre en place un environnement de développement. La plupart des discussions concernant le développement prend place sur notre [liste de diffusion](https://mail.kde.org/mailman/listinfo/kstars-devel) ou notre [système de suivi des bogues](https://invent.kde.org/education/kstars/-/issues), ainsi si vous avez besoin d'aide, c'est le bon endroit pour commencer. KStars est écrit en C++ et utilise [Qt](https://qt-project.org/) et les bibliothèques de [KDE](https://kde.org).

source: If you are an astronomy enthusiast, there is our [AstroInfo](/astroinfo) project.
fr: Pour les passionnés d'astronomie, il y a le projet [AstroInfo](/astroinfo/).

source: Some pointers to get started
fr: Quelques liens pour commencer

source: Join our [mailing list](https://mail.kde.org/mailman/listinfo/kstars-devel);
fr: Rejoignez notre [liste de diffusion](https://mail.kde.org/mailman/listinfo/kstars-devel) ;

source: Hang out on our [KStars Web Chat](https://webchat.kde.org/#/room/#kstars:kde.org) channel;
fr: Trainez sur notre canal de discussion [KStars Web Chat](https://webchat.kde.org/#/room/#kstars:kde.org) ;
